[
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Umar Shakir",
    "title": "Apple has a new ‘Viral’ playlist on Apple Music and Shazam",
    "description": "Apple is launching a new global Viral Chart playlist in Apple Music that consists of tracks people are discovering through the company’s Shazam service. The playlist, which is updated daily, shows the top 50 songs people have heard playing out in the real wor…",
    "url": "https://www.theverge.com/news/663866/apple-music-viral-charts-global-playlist-shazam-top-50",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/23925979/acastro_STK046_03.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-08T21:01:29Z",
    "content": "Now Apple and Shazam users have a quick place to see what music people are discovering in the real world.\r\nNow Apple and Shazam users have a quick place to see what music people are discovering in th… [+928 chars]",
    "full_content": "is a news writer fond of the electric vehicle lifestyle and things that plug in via USB-C. He spent over 15 years in IT support before joining The Verge.\n\nApple is launching a new global Viral Chart playlist in Apple Music that consists of tracks people are discovering through the company’s Shazam service. The playlist, which is updated daily, shows the top 50 songs people have heard playing out in the real world and have logged through Shazam. You can see charts on Shazam’s website as well.\n\nThe playlists use “Shazam’s data to offer a comprehensive view of today’s fastest-growing songs across the globe, David Emery, who works for Apple Music in the UK, says on Threads. Emery notes that charts reflect songs going viral on Shazam in “real time” and then ranks them based on “their weekly growth in Shazam volume.”\n\nAs of writing, the top viral songs in the list include Shake It To The Max (FLY) [Remix] by Moliy, Nothing’s Gonna Stop Us Now by Starship, and Hot Together by The Pointer Sisters. On Shazam’s website, you can look at the rankings by country, if you’d like."
  },
  {
    "source": {
      "id": "wired",
      "name": "Wired"
    },
    "author": "Kate Knibbs",
    "title": "Trump’s Tariffs Are Threatening America’s Apple Juice Supply Chain",
    "description": "Most of the apple juice Americans drink is imported, with a large share coming from China. Experts say families should expect to start paying higher prices for the beloved beverage.",
    "url": "https://www.wired.com/story/apple-juice-shortage-tariffs/",
    "urlToImage": "https://media.wired.com/photos/6812934a8f16f415836a2072/191:100/w_1280,c_limit/Apple-Juice-Shortage-Business-2211147875.jpg",
    "publishedAt": "2025-05-06T11:00:00Z",
    "content": "Few foods are more American than apple pie, but the truth is, some of the countrys favorite apple products arent actually made in the United States. Apple juice, a perennial lunchroom staple, is a pr… [+2760 chars]",
    "full_content": "Few foods are more American than apple pie, but the truth is, some of the country’s favorite apple products aren’t actually made in the United States. Apple juice, a perennial lunchroom staple, is a prime example. The vast majority of the apple juice Americans drink is imported from countries like China, and the Trump’s administration’s berserk tariff policies are now reshaping the market, potentially making beloved pome-based beverages more expensive or harder to find.\n\n“The price of juice is already increasing,” Christopher Gerlach, an executive at the US Apple Association, a trade group representing the domestic apple industry, tells WIRED. Gerlach estimates the wholesale cost of apple juice concentrate has risen 33 percent this year compared to 2024—and he expects it to keep going up. The higher costs will impact more than just plain apple juice, since concentrate is a key ingredient in a wide variety of other juice mixes, like mixed berry and pear, and is also used as a sweetener in a variety of children’s products, including baby food.\n\nThe Trump administration’s protectionist policies have upended the global trading system as a whole. But the biggest impact so far has been on Chinese imports, which now face a new 145 percent tariff. The measure has driven up consumer prices and disrupted the supply chains for products ranging from baby gear to Christmas decorations to sex toys. While produce represents a relatively small portion of China’s exports to the US overall, there are certain types of food and drink heavily sourced from the country, like garlic, seafood, and, yes, apple juice. While apples are not typically associated with China, farmers there began investing more in the crop in the 1980s as they looked for ways to diversify their incomes, according to the US Department of Agriculture (USDA).\n\nThe US has plenty of domestic apple farms, but the industry focuses heavily on selling fresh fruits, which are typically more profitable. Each year, America exports around 16 million gallons of apple juice, but imports 430 million gallons, Gerlach says. For many years, China was the main place where the US sourced its apple juice, but Turkey has recently emerged as a close competitor. It represented 39 percent of US concentrated apple juice imports last year, while China accounted for 31 percent, according to Gerlach.\n\nData from the USDA suggest that Trump’s tariffs have sparked a more dramatic shift in the US toward buying apple juice concentrate from Turkey. So far this year, Americans have imported around 92 million liters of unfrozen apple juice concentrate from China, compared to 29 million liters from Turkey. China saw a major spike in juice buying in January as importers raced to make purchases before the tariffs went into effect; now its sales have plummeted, while Turkey’s are soaring. For the week of April 25, Turkey exported more than twice as much apple juice concentrate to the US as did mainland China."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Emma Roth",
    "title": "Apple asks court to halt App Store rule changes while it appeals",
    "description": "Apple asked a judge to halt an order forcing it to give up control over App Store payments while it appeals the decision. In a filing on Wednesday, Apple says the order contains “extraordinary intrusions” that could result in “grave irreparable harm” to the c…",
    "url": "https://www.theverge.com/news/663361/apple-halt-app-store-ruling-appeal",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/STK468_APPLE_ANTITRUST_CVIRGINIA_C.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-08T14:49:37Z",
    "content": "Apple says the orders requirements profoundly undercut the integrated iOS ecosystem.\r\nApple says the orders requirements profoundly undercut the integrated iOS ecosystem.\r\nApple asked a judge to halt… [+1281 chars]",
    "full_content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nApple asked a judge to halt an order forcing it to give up control over App Store payments while it appeals the decision. In a filing on Wednesday, Apple says the order contains “extraordinary intrusions” that could result in “grave irreparable harm” to the company.\n\nLast week, California District Court Judge Yvonne Gonzalez Rogers found that Apple was in “willful violation” of a 2021 injunction issued as part of the Epic Games v. Apple case. As a result, the judge ordered Apple to stop collecting an up to 27 percent commission on purchases made outside the App Store, and said the company can no longer restrict how developers point users toward external purchases.\n\nApple has since complied with the order, allowing apps like Kindle, Patreon, Spotify, and Delta’s emulator to link iPhone users to external purchases without an added fee or restrictions. However, Apple filed an appeal on Monday, and now it wants its control of the App Store back while it waits for a decision.\n\n“Depriving Apple of control over core features of the App Store is, standing alone, sufficient to warrant a stay,” Apple says in its motion to halt the order. “The new rules profoundly undercut the integrated iOS ecosystem that this Court sustained as lawful and that is the foundation of user trust and confidence in the App Store.”\n\nIn a post on X, Epic Games said Apple’s motion to stay “is a last ditch effort to block competition and extract massive junk fees at the expense of consumers and developers.”\n\nUpdate, May 8th: Added a statement from Epic Games."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Wes Davis",
    "title": "Apple may release a ‘mostly glass, curved iPhone’ in 2027",
    "description": "This morning, while summarizing an Apple “product blitz” he expects for 2027, Bloomberg’s Mark Gurman writes in his Power On newsletter that Apple is planning a “mostly glass, curved iPhone” with no display cutouts for that year, which happens to be the iPhon…",
    "url": "https://www.theverge.com/news/664776/apple-curved-glass-iphone-2027",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25612700/DSC_3108_Enhanced_NR.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-11T20:03:55Z",
    "content": "The iPhone 16 Pro Max, pictured here, is already pretty glassy.\r\n\n\nThis morning, while summarizing an Apple “product blitz” he expects for 2027, Bloomberg’s Mark Gurman writes in his Power On newslet… [+2249 chars]",
    "full_content": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nThis morning, while summarizing an Apple “product blitz” he expects for 2027, Bloomberg’s Mark Gurman writes in his Power On newsletter that Apple is planning a “mostly glass, curved iPhone” with no display cutouts for that year, which happens to be the iPhone’s 20th anniversary.\n\nThat follows a report last weekend from The Information, which said that “at least one 2027 iPhone model that will place the front-facing camera underneath the screen to enable a truly edge-to-edge display.” Late last year, a report from The Elec said Apple is working with its display partners to create a bezel-less iPhone, but not one that curves the display down the side of the phone — a trick companies like Samsung and Vivo have employed in the past.\n\nBut the “mostly glass, curved” part of Gurman’s prediction is more interesting to me, because what the heck does that mean? After all, I’d describe the iPhone 15 Pro sitting on my desk right now as “mostly glass,” with the only exterior metal being around the camera lenses and in its titanium edge, which the front and back curve down to. Assuming he’s not describing a banana-shaped iPhone, the closest hints are probably in Apple patents revealed over the years, like one from 2019 that describes a phone encased in glass that “forms a continuous loop” around the device.\n\nApart from a changing iPhone, Gurman describes what sounds like a big year for Apple. He reiterates past reports that the first foldable iPhone should be out by 2027, and that the company’s first smart glasses competitor to Meta Ray-Bans will be along that year. So will those rumored camera-equipped AirPods and Apple Watches, he says.\n\nGurman also suggests that Apple’s home robot — a tabletop robot that features “an AI assistant with its own personality” — will come in 2027. On that “personality” mention, it’s hard not to think about the adorable robotic lamp Apple’s internal researchers have been tinkering with."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "David Nield",
    "title": "How to turn on Lockdown Mode for your iPhone and Mac",
    "description": "Apple is known for prioritizing privacy and security, but there are additional measures you can turn to if you feel you need them. iPhones, iPads, and Macs have what's known as a Lockdown Mode that takes protecting your data to a whole new level. It's clear t…",
    "url": "https://www.theverge.com/tech/663794/lockdown-mode-iphone-mac-how-to",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/HT020_securityPrivacy_0005.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-09T16:09:27Z",
    "content": "There are security protections, and then there are strong security protections.\r\nThere are security protections, and then there are strong security protections.\r\nApple is known for prioritizing priva… [+4327 chars]",
    "full_content": "Apple is known for prioritizing privacy and security, but there are additional measures you can turn to if you feel you need them. iPhones, iPads, and Macs have what’s known as a Lockdown Mode that takes protecting your data to a whole new level.\n\nIt’s clear that this isn’t for everyone: Apple describes it as being for those who feel they might be attacked by “the most sophisticated threats.” Think journalists working in dangerous regions, activists under threat from surveillance or censorship, or politicians with access to top secret information.\n\nAnyone can turn it on and off as needed — you don’t need any special status or any particular kind of Apple account. It only takes a few taps or clicks, and you’ll have the highest level of security protection that Apple offers.\n\nHow Lockdown Mode protects you\n\nLockdown Mode is available on iPhones, iPads, and Macs. Screenshot: Apple\n\nIt’s worth bearing in mind that there are some tradeoffs when using Lockdown Mode. The software you use will be limited in some of its functionality to give would-be hackers fewer ways to get at you and your data.\n\nYou’ll find most attachments in Messages blocked, while FaceTime calls are only permitted with people you’ve had contact with in the last month. In Photos, you can’t create or even see shared albums, and Focus modes are disabled, too. New device connections are only allowed if your iPhone, iPad, or Mac is unlocked when the connection is made.\n\nCertain parts of Safari get disabled, too, with many web technologies (that may be used to launch an attack) turned off. You’ll see missing images and fonts that don’t look right, and certain websites might load slowly or not work at all.\n\nYou won’t be able to install new configuration profiles (for testing apps, for example), and there’s no support for unsecured Wi-Fi networks. You’ll also lose the ability to access Game Center — sorry, gamers.\n\nLockdown Mode is enabled on a device-by-device basis, so enabling it on your Mac won’t automatically enable it on your iPhone. You will get a prompt across all the devices associated with your Apple account once you’ve turned the mode on for one device.\n\nHow to enable Lockdown Mode\n\nLeft: Lockdown Mode is under Privacy & Security in Settings. Right: You get plenty of info about Lockdown Mode before enabling it. Screenshot: Apple\n\nConsidering how dramatic Lockdown Mode is in terms of the changes it makes to your devices, it’s surprisingly easy to enable.\n\nOn an iPhone or iPad:\n\nOpen Settings in iOS or iPadOS.\n\nChoose Privacy & Security .\n\nScroll down to and tap Lockdown Mode .\n\nSelect Turn On Lockdown Mode . You’ll get a summary of how it will affect your phone use. Tap Turn On Lockdown Mode again to confirm.\n\nSelect Turn On & Restart.\n\nYou’ll need to enter your phone or tablet passcode, and then your device will reboot. When you get back into the software, Lockdown Mode will be enabled.\n\nOn a Mac:\n\nOpen the Apple menu, then go to System Settings > Privacy & Security > Lockdown Mode .\n\nSelect Turn On .\n\nOn the next dialog, click Turn On Lockdown Mode . As with iOS, you’ll get a summary of how it will affect your phone use. Click Turn On Lockdown Mode again to confirm.\n\nFinally, choose Turn On & Restart.\n\nYou’ll need to enter the password associated with your Mac account, and then the computer will reboot, enabling Lockdown Mode along the way.\n\nOnce you enable Lockdown Mode, you’ll need to restart your device. Screenshot: Apple\n\nCustomize and disable Lockdown Mode\n\nThere aren’t many ways to customize Lockdown Mode, but you can exclude certain websites from its restrictions in Safari, if you want to.\n\nWhen you’re on a page in Safari on an iPhone or iPad, tap the menu button (to the left of the web URL), then the three dots, then disable Lockdown Mode.\n\nOn macOS, choose Safari > Settings for <website> , and uncheck Enable Lockdown Mode .\n\nWhatever device you’re using, you’ll see a confirmation dialog appear. Tap Turn Off to confirm.\n\nYou can exclude certain websites from Lockdown Mode restrictions. Screenshot: Apple\n\nYou can review and edit your website exclusion list, too.\n\nFrom Settings on iOS and iPadOS, choose Privacy & Security > Lockdown Mode > Configure Web Browsing .\n\nOn macOS, open Safari then pick Safari > Settings > Websites > Lockdown Mode."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Andrew Webster",
    "title": "Apple’s sci-fi epic Foundation is back for season 3 in July",
    "description": "One of Apple’s biggest series will start streaming again this summer. The company announced that season 3 of Foundation will hit Apple TV Plus on July 11th, with new episodes weekly through September 12th. As part of the announcement, Apple also released the …",
    "url": "https://www.theverge.com/news/662498/foundation-season-3-date-trailer-apple-tv-plus",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/Foundation_302_00301F.jpg?quality=90&strip=all&crop=0%2C3.4635470032239%2C100%2C93.072905993552&w=1200",
    "publishedAt": "2025-05-07T13:14:15Z",
    "content": "You can watch the first teaser trailer right now.\r\nYou can watch the first teaser trailer right now.\r\nOne of Apples biggest series will start streaming again this summer. The company announced that s… [+1777 chars]",
    "full_content": "Set 152 years after the events of season two, The Foundation has become increasingly established far beyond its humble beginnings while the Cleonic Dynasty’s Empire has dwindled. As both of these galactic powers forge an uneasy alliance, a threat to the entire galaxy appears in the fearsome form of a warlord known as “The Mule” whose sights are set on ruling the universe by use of physical and military force, as well as mind control. It’s anyone’s guess who will win, who will lose, who will live and who will die as Hari Seldon, Gaal Dornick, the Cleons and Demerzel play a potentially deadly game of intergalactic chess."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Apple’s New iPad With A16 Chip Just Got Its First Price Drop, Now at Its Lowest Price on Amazon",
    "description": "Need a new tablet? Score this 11-inch Apple iPad (A16 chip) for under $300.",
    "url": "https://gizmodo.com/apples-new-ipad-with-a16-chip-just-got-its-first-price-drop-now-at-its-lowest-price-on-amazon-2000599374",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ipad11.jpg",
    "publishedAt": "2025-05-08T12:10:17Z",
    "content": "If you’re still chugging along using an old tablet, stop what you’re doing. There are some way better options out there. You don’t have to keep relying on that Walmart special. You deserve something … [+2124 chars]",
    "full_content": "If you’re still chugging along using an old tablet, stop what you’re doing. There are some way better options out there. You don’t have to keep relying on that Walmart special. You deserve something far improved over a no-name device, and we’re here to give it to you. Right now, you can get a new iPad for an excellent price, in fact, thanks to Amazon.\n\nSee at Amazon\n\nSnag the 11-inch Apple iPad with an A16 chip for just $299, down from its usual price of $349. That’s $50 off and a discount of 14%. This price applies to the Silver colorway.\n\nA tablet that goes everywhere you do\n\nThis new iPad Air isn’t a total reinvention, but it does come with some important upgrades from the previous edition. The biggest change is the switch to the A16 chip, which is the same processor that’s in some of Apple’s newest MacBooks. Thanks to the A16 chip you get faster performance, no matter what you plan on doing. That includes multitasking, editing photos, or using resource-heavy creative apps.\n\nAs far as the screen goes, it’s sharp, colorful, and bright enough for outdoor use, whether you’re watching videos, sketching with the Apple Pencil, or just browsing the web. It also has 128GB of storage, so you can store whatever files you need on the device without having to worry about relying only on cloud storage.\n\nThe design hasn’t changed much from the last iPad either, and that’s a good thing. It’s still slim, light, and easy to carry around. It also supports Wi-Fi 6E, so if you have a compatible router, you’ll get faster and more stable wireless. And everyone wants to make sure they have stable Wi-Fi. It’s kind of a necessity these days.\n\nSee at Amazon\n\nAnd if you need more out of your iPad Air, know that it can use some of Apple’s best accessories, like the Apple Pencil Pro and Magic Keyboard, which turn it into a powerful tool for work or school. Plus, you get all-day battery life, so you can use it for long periods of time without having to recharge.\n\nFor most people, this version of the iPad Air offers everything they need, and then some. If you’ve been holding out, now might be the time to pull the trigger.\n\nRemember that it’s just $299 right now, so less than $300 nets you a great new tablet that has everything you need to watch your favorite shows, get work done, and do much more on the go. So it’s about time you grabbed one.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Lauren Feiner",
    "title": "Eddy Cue is fighting to save Apple’s $20 billion paycheck from Google",
    "description": "Microsoft's Bing or DuckDuckGo probably won't disrupt Google's dominance in search, said Apple senior vice president of services Eddy Cue - but AI services easily could. Cue was returning to a courtroom in Washington, DC where he last testified in the Justice…",
    "url": "https://www.theverge.com/policy/662974/google-search-remedies-trial-eddy-cue-apple-deal-ai",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/236780_Google_AntiTrust_Trial_Custom_Art_CVirginia__0000_4.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-07T21:40:34Z",
    "content": "AI will disrupt Googles search monopoly even without a breakup, the Apple exec says.\r\nAI will disrupt Googles search monopoly even without a breakup, the Apple exec says.\r\nMicrosofts Bing or DuckDuck… [+5172 chars]",
    "full_content": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nMicrosoft’s Bing or DuckDuckGo probably won’t disrupt Google’s dominance in search, said Apple senior vice president of services Eddy Cue — but AI services easily could.\n\nCue was returning to a courtroom in Washington, DC where he last testified in the Justice Department’s trial against Google’s search monopoly in September 2023. During the current remedies trial on Wednesday, Cue said that in the time since, well-funded generative AI upstarts have made such significant advancements that they could ultimately disrupt that monopoly — perhaps more effectively than the court could.\n\nCue was also, however, there to defend a significant source of Apple’s revenue: the payments Google offers for default search engine placement on Apple’s Safari browser.\n\nAfter the 2023 trial, Judge Amit Mehta found that Google illegally monopolized the online search market, in part through agreements like the Safari deal. For the last two and a half weeks, Google and the DOJ have pitched Mehta on what he should (or shouldn’t) do to fix the problem. The DOJ says Google should be forced to share valuable search data with competitors and spin off its Chrome browser, while Google (which plans to appeal the earlier ruling) wants only restrictions on the deals Mehta deemed unfairly exclusionary. And rather than barring its Apple deal altogether, it would make Google give Apple more flexibility to sign additional default search agreements across its various devices or in private browsing mode.\n\nCue argued Wednesday that rapid AI advancements mean the antitrust threat Mehta identified is shrinking. For the first time in 22 years, Cue said, Apple saw search volume decline in its Safari browser last month — a side effect of users seeking more information from AI chatbots. The DOJ, unsurprisingly, disagrees. It’s not uncommon for technological development to outpace the slow trudge of the court system, but the government says that pace isn’t fast enough to fix a persistent market issue.\n\nApple has a lot of skin in the game here — the DOJ previously revealed it rakes in $20 billion in payments from Google annually. Google’s proposed remedies could reduce it, but they would also open up Apple’s options and preserve much of its revenue flow. The DOJ’s, meanwhile, could wipe out that cash flow altogether. Cue seemed bewildered that Apple could get the short end of the stick for a punishment supposedly inflicted on Google. The idea that the court could decide Google did something wrong and then let it save money at Apple’s expense, he said, “just seems crazy to me.”\n\nGoogle could even keep its prime Safari placement without a deal in the short term, Cue said. “We don’t really have a choice today,” he testified. Even if Apple could cut a new default deal with another company, Google is still the best service available for customers, so they’d probably seek it out — and Apple wouldn’t get a cut. Cue said he’s “lost a lot of sleep” over the prospect of losing the Google deal, and warned it would impact Apple’s ability to make new products.\n\nCue also told Mehta he “can’t say I disagree” with his analysis that Apple was disincentivized from building its own search engine because of its deal with Google. But, he added, “we can’t do everything,” and since Google is really good at what it does, Apple prefers to focus on areas where it can offer unique value.\n\nThere’s “much greater potential because there are new entrants that are attacking the problem in a different way”\n\nAI could eventually change all of this, Cue testified. Apple is already exploring adding AI search options, though it recognizes they can’t yet replace traditional search engines. “To date, they’re just not good enough,” he said.\n\nCue said “good enough” could come sooner than he anticipated. He said there’s “much greater potential because there are new entrants that are attacking the problem in a different way.” Large language model (LLM) AI companies haven’t built a robust enough search index to substitute for Google yet, he said, but combining an LLM with search could let them use a smaller index effectively soon.\n\nEven though he is backing Google’s fight to keep its search deals, he seemed to acknowledge that the DOJ’s proposal to syndicate Google’s search index could get AI rivals up to speed even faster.\n\nCue cautioned the judge that tech is not like other industries, and giants often fall even without court intervention. “When I got to Silicon Valley, all of the best companies, or the most successful companies, either don’t exist today or are significantly smaller and less impactful,” Cue said, pointing to companies like HP, Sun Microsystems, and Intel. In the technology field, being an incumbent might not offer the same benefits it does in other markets. “We’re not an oil company, we’re not toothpaste. These are things that are going to last forever,” he said. “You may not need an iPhone 10 years from now.” After nearly four decades at Apple, Cue now sees AI as “a huge technological shift.”\n\nPutting himself in the judge’s shoes, Cue told Mehta, “we’re lucky, because honestly, if AI had not come about, I don’t know what you could do.” That’s because, he explained, “until there are truly competitive products, people will keep using the best one.”"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Amazon Is Clearing Out the Apple Watch SE (2nd Gen) at Black Friday Prices, Perfect for a Mother’s Day Tech Gift",
    "description": "What time is it? Time to join the smartwatch gang with an Apple Watch SE for under $200.",
    "url": "https://gizmodo.com/amazon-is-clearing-out-the-apple-watch-se-2nd-gen-at-black-friday-prices-perfect-for-a-mothers-day-tech-gift-2000599312",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/awatchse-1.jpg",
    "publishedAt": "2025-05-08T14:55:08Z",
    "content": "If youve been waiting for the right time to upgrade your smartwatch, or maybe get one for the first time, it’s always a good time to wait for a deal. They’re always going on sale, and you shouldn’t h… [+2056 chars]",
    "full_content": "If you’ve been waiting for the right time to upgrade your smartwatch, or maybe get one for the first time, it’s always a good time to wait for a deal. They’re always going on sale, and you shouldn’t have to spend full price for one since so many start being much more affordable after a period of time. And this Amazon deal might be the one that can help you make up your mind.\n\nRight now, you can head to Amazon to get the Apple Watch SE (2nd Gen) for just $169, down from its usual price of $249. That’s $80 off and a discount of 32%. This discount applies to the Starlight Aluminum Case model with Starlight Sport Band.\n\nSee at Amazon\n\nYour go-to premium smartwatch at a low price\n\nThis may not be the newest, latest and greatest Apple Watch, but it does everything you could possible need it to. It tracks your health, keeps you connected, and adds little conveniences that, once you get used to them, are hard to live without. Whether you’re trying to be more active, want to manage notifications without checking your phone constantly, or just want a device that can help keep you safe in an emergency, this watch is a keeper.\n\nAnd just because it’s older, that doesn’t mean it’s a slouch in any way. Apps launch quicker, navigation feels smoother, and Siri now works on-device, so it’s snappier and more private when you compare it to the older Apple Watch SE model. One of the newest features is the double-tap gesture, which lets you control the watch without even touching the screen, too. You’ll love that if you happen to use your hands a lot.\n\nSee at Amazon\n\nThe always-on Retina display is brighter than before, too. And you still get all the health features Apple is known for. That includes heart rate tracking, sleep monitoring, crash detection, and more.. It’s also swim-proof and built for wearing every day, so you can take it just about anywhere.\n\nThis premium smartwatch is an absolute steal at just $169. For less than $200, you get this supreme multitasker that’s better than the previous model in every way. It can tell time, use apps, help you track your fitness journey, health, and other aspects of your day with you having to do much of anything at all. So be sure to get yours while it’s still in stock. You’ll want to keep it with you at all times, we imagine.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "Don’t Buy the New iPad From Apple’s Website, Amazon Is Offering a Shockingly Low Price Right Now",
    "description": "You won’t find any discounts on the 2025 iPad directly from Apple this year, but Amazon is offering a great deal.",
    "url": "https://gizmodo.com/dont-buy-the-new-ipad-from-apples-website-amazon-is-offering-a-shockingly-low-price-right-now-2000600738",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ipad-11-apple.jpg",
    "publishedAt": "2025-05-11T12:40:46Z",
    "content": "Apple is famous for its tight control over pricing, especially on new products. If a deal on a brand-new Apple product is what you’re looking for, you usually have to look beyond the official Apple S… [+1939 chars]",
    "full_content": "Apple is famous for its tight control over pricing, especially on new products. If a deal on a brand-new Apple product is what you’re looking for, you usually have to look beyond the official Apple Store.\n\nThis is why we think it’s really exceptional that the iPad 2025 is now discounted at Amazon: You can buy the newest 128GB Wi-Fi iPad for just $299, which is a full $50 off its $349 introduction price. Make sure you grab yours before it runs out of stock, as over 10,000 units have already been sold in the past few days.\n\nSee at Amazon\n\nPowerful iPad\n\nThe 11th-generation iPad has been introduced in March 2025 and it is a major leap in Apple’s affordable tablet line. Powering it is the A16 Bionic chip, it gives this iPad a huge performance and efficiency boost compared to the last generation. The A16 features a 5-core CPU, a 4-core GPU and 16-core Neural Engine, more than enough to handle intensive apps, multitasking and creative workflows. Paired with 6GB of RAM (and 128GB storage), the iPad 11 delivers a smooth user experience whether you’re streaming or gaming.\n\nThe screen is a standout in itself, and this is why iPads are so popular: an 11-inch Liquid Retina display with a 2360 x 1640 pixel resolution at 264 ppi with sharp images, deep color and excellent viewing angles. True Tone technology adjusts the color temperature of the display to your environment and 500 nits of brightness make the screen readable and clear even in direct sunlight.\n\nFor video calling or photography users, the iPad 11 has a 12MP rear camera with autofocus, Smart HDR 4, and 4K video recording and a 12MP front camera with Center Stage to keep you constantly in frame in video calls. Both cameras come with advanced features like cinematic video stabilization and extended dynamic range. You can use this iPad as a productivity and business tool super easily. With up to all-day battery life, you can count on the iPad 11 to get you through work or a vacation.\n\nApple’s reputation for rarely discounting its devices is true, and this Amazon deal is as one of the best opportunities to get the latest iPad at a reduced price.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Brandon Widder",
    "title": "Samsung’s Galaxy Ring is on sale with a $100 gift card starting at $299.99",
    "description": "Smartwatches have come along way since the first Apple Watch arrived on the scene more than a decade ago. However, despite how ubiquitous they’ve become, they’re still nowhere near as discrete — or long-lasting — as a smart ring like the Samsung Galaxy Ring. …",
    "url": "https://www.theverge.com/tech/663665/samsung-galaxy-smart-ring-shokz-openrun-pro-2-deal-sale",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/Samsung-Galaxy-Ring-Deal-Image.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-09T22:12:30Z",
    "content": "You can also save on the Shokz OpenRun Pro 2 and one of the best RPGs of the past year.\r\nYou can also save on the Shokz OpenRun Pro 2 and one of the best RPGs of the past year.\r\nSmartwatches have com… [+2883 chars]",
    "full_content": "Smartwatches have come along way since the first Apple Watch arrived on the scene more than a decade ago. However, despite how ubiquitous they’ve become, they’re still nowhere near as discrete — or long-lasting — as a smart ring like the Samsung Galaxy Ring. Thankfully, if you’re looking to ditch the watch, Samsung’s first-gen smart ring is available with a $100 gift card at Best Buy and Amazon, where you can pick it up in a variety of sizes starting at $299.99 ($100 off), an all-time low.\n\nIn many ways, the Android-only Galaxy Ring is more of an accessory for existing Samsung users than it is a standalone device. It’s not as a capable as the Oura Ring 4, our No. 1 pick for the best smart ring, though it does showcase excellent hardware and comes in wide ranges of sizes, from 5 to 15. Plus, unlike the Oura, the Galaxy Ring provides standard activity and sleep tracking without requiring you to pay a monthly fee. That’s a boon for anyone with subscription fatigue.\n\nIn terms of basics, Samsung’s IP68 water-resistant ring can measure your blood oxygen level, skin temperature, heart rate, and track your steps and workouts. That being said, you’ll need a Galaxy phone to leverage all of Samsung’s ecosystem-centric tricks, including the ability to access insights about your quality of sleep and Samsung’s Energy Score feature, which attempts to quantify your fatigue levels. If you own a Samsung Galaxy Watch 7 or Ultra, you’ll even get several additional days of battery life, thanks in part to the way Samsung’s Health app prioritizes which device’s sensors to pull from.\n\nAll that is to say that the Galaxy Ring remains best suited for existing Samsung users, rather than those tapped into other ecosystems. But if that’s you, the current promo is the best deal we’ve seen.\n\nMore deals and discounts\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Andrew Webster",
    "title": "Apple’s Murderbot series is goofy sci-fi with a side of existential crisis",
    "description": "I did not expect a TV show called Murderbot to be quite so relatable. On the surface, the Apple TV Plus sci-fi comedy is a somewhat generic futuristic story about a group of humans exploring a dangerous planet with the help of a security bot that's designed t…",
    "url": "https://www.theverge.com/tv-reviews/664090/murderbot-season-1-review-apple-tv-plus",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/Murderbot_Photo_010203.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
    "publishedAt": "2025-05-09T13:54:02Z",
    "content": "The adaptation of Martha Wells Murderbot Diaries adds a playful tone to Apples growing sci-fi lineup.\r\nThe adaptation of Martha Wells Murderbot Diaries adds a playful tone to Apples growing sci-fi li… [+4788 chars]",
    "full_content": "I did not expect a TV show called Murderbot to be quite so relatable. On the surface, the Apple TV Plus sci-fi comedy is a somewhat generic futuristic story about a group of humans exploring a dangerous planet with the help of a security bot that’s designed to protect them. The key is the perspective: the story is told from the bot’s point of view, and that bot is really going through it. It’s experiencing free will for the first time and struggling with the ramifications of that, making it anxious, awkward, and addicted to streaming television. It may be built to kill — but it’s just like me.\n\nThe show opens on Muderbot’s (Alexander Skarsgård) awakening. While seemingly idle and working security at a mining facility, internally it’s actually hacking away at the chip that governs its free will. These bots, called sec units (which is short for security unit) are hybrids, powered by AI and with bodies that are a mix of machine and organic material. But they also have to do whatever they’re told thanks to something called the governor module. Somehow Murderbot manages to disable this and then — well, he’s free, but only kind of. It’s illegal to have a sec unit without a working module, punishable by an acid bath, and so Murderbot is forced to pretend it’s still intact so as to not die and lose its newfound freedom.\n\nEventually, the bot is picked up by a group surveying an alien planet who need a sec unit for insurance purposes. They pick the cheapest model (at this point, Murderbot is a refurbished unit, far from top of the line). However, they also come from a part of the galaxy that is morally against the idea of sec units, viewing these machines as a form of slave labor, which creates an interesting dynamic. While Murderbot is trying to hide all of the elements that show it’s a sentient being with thoughts and feelings and interests, the crew around him slowly start treating it more like an actual human being.\n\nWhile all of this plays out, Murderbot serves as a narrator, which is important; since it’s trying to keep its true self hidden, the only way to really know what’s really going on is to hear it from the bot itself. Skarsgård’s somewhat stilted delivery fits the bot perfectly. It sounds like someone who is trying to sound human. It’s a little awkward and clunky, which is what makes it so fitting.\n\nWhat really makes it work, though, is just how funny and relatable Murderbot is. It hates humans — one of the first things it says is that people are “assholes” — and is terrified of basically every social interaction. At one point, Murderbot weighs the pros and cons of getting an acid bath versus making a speech in front of the rest of the crew, and later it’s forced into the most devastating of all situations: prolonged eye contact. It’s also constantly trying to avoid its responsibilities so that it can watch all of the streaming shows it’s downloaded, and uses its surveillance powers to follow all of the various romantic entanglements happening at the camp. In fact, much of its behavior is derived from soap operas, where it quotes lines in moments of drama because it’s not sure what else to say. Skarsgård’s dry delivery of these quips is the highlight of the show.\n\nAs you’d expect, the charade doesn’t last forever, and eventually the two sides grow into each other. Murderbot becomes more and more comfortable being an autonomous, thinking being, while the research crew slowly starts to understand what Murderbot actually is, and begin treating it like, well, another member of the group (even if some of them remain suspicious).\n\nImage: Apple\n\nIt’s not an especially deep exploration of the concept of free will, but rather a sort of strange and awkward coming-of-age story. Murderbot may be a hulking killing machine, but its arc towards becoming an actual person is both hilarious and relatable, filled with awkward social interactions and important self revelations that feel more high school drama than space opera. It’s heartwarming watching it not only grow into itself, but find the right people to allow for that growth.\n\nAnd it does it all while doing a decent job at being a security unit, fighting off Dune-style sandworms and other malfunctioning bots. These sci-fi elements would be drab and forgettable on their own, but they become hilarious when viewed from Murderbot’s perspective."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Wes Davis, Lauren Feiner",
    "title": "Apple’s Eddy Cue: ‘You may not need an iPhone 10 years from now’",
    "description": "Eddy Cue, Apple’s senior vice president of services, gave an ominous warning today that the iPhone could go the way of the iPod 10 years from now. And the reason, as one might guess, is artificial intelligence. Cue’s remarks came during the Google Search anti…",
    "url": "https://www.theverge.com/news/662769/apple-iphone-may-not-need-10-years",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/gettyimages-2160777605.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C74.160763781953&w=1200",
    "publishedAt": "2025-05-07T17:37:18Z",
    "content": "Cue suggests AI could make the iPhone go the way of Apples former golden goose, the iPod.\r\nCue suggests AI could make the iPhone go the way of Apples former golden goose, the iPod.\r\nEddy Cue, Apples … [+1604 chars]",
    "full_content": "Eddy Cue, Apple’s senior vice president of services, gave an ominous warning today that the iPhone could go the way of the iPod 10 years from now. And the reason, as one might guess, is artificial intelligence.\n\nCue’s remarks came during the Google Search antitrust remedies trial today while discussing how AI has the potential to reshape the tech industry and open the door to new entrants.\n\nIncumbents have a hard time ... we’re not an oil company, we’re not toothpaste — these are things that are going to last forever ... you may not need an iPhone 10 years from now.\n\nCue went on to say that the best thing Apple did was kill the iPod, a move he said was bold. “Why would you kill the golden goose,” he added.\n\nThat may seem like a silly thing for Apple to say, given that more than half of its revenue is iPhone sales. But Cue calls AI a “huge technological shift,” and suggests that such shifts can humble companies that once seemed unassailable. “When I got to Silicon Valley,” he said, “all the best companies or the most successful companies” — he mentioned HP, Sun Microsystems, and Intel — “either don’t exist today or are significantly smaller and much less impactful.”"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Apple AirPods Alternative? Beats Studio Buds+ Are Now Going for Peanuts on Amazon",
    "description": "Need a new pair of earbuds? You can't go wrong with this pick from Beats, especially at this discounted price.",
    "url": "https://gizmodo.com/apple-airpods-alternative-beats-studio-buds-are-now-going-for-peanuts-on-amazon-2000599952",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/bbudsplus.jpg",
    "publishedAt": "2025-05-09T16:35:08Z",
    "content": "A great pair of earbuds can be hard to come by if you’re on a budget. While there are tons to choose from, they’re not all going to reflect the same quality as some of the bigger name brands out ther… [+1988 chars]",
    "full_content": "A great pair of earbuds can be hard to come by if you’re on a budget. While there are tons to choose from, they’re not all going to reflect the same quality as some of the bigger name brands out there. You can generally look to Beats for great audio, however, so when you find a pair on sale, it’s a good idea to snap them up when you can. It just so happens that now is one of those times where you’ll want to get a pair of Beats headphones since you finally can for a good price.\n\nHead to Amazon right now, where you’ll find the Beats Studio Buds+ for $100, down from their usual price of $170. That’s $70 off and a discount of 41%. They’re available in multiple colors for this price, so you can choose the one you like at the same discount.\n\nSee at Amazon\n\nBeats buds for the best bass and bumping in your ears\n\nThese are the upgraded version of the original Studio Buds, and they’ve become a fan favorite over time thanks to their sound quality and compatibility across both Apple and Android devices. They also feel super comfortable to wear, too.\n\nThe sound profile here is nicely balanced with punchy bass, clear vocals, and enough detail to make your playlists feel fresh. They also have active noise cancellation to block out distractions when you need to focus, and a transparency mode when you want to stay aware of your surroundings. Switching between the two is quick and easy.\n\nThere’s more than enough battery to go around to keep you listening for a while, too. You get up to 9 hours of listening time on the buds alone, and the included case brings the total up to 36 hours. A quick 5-minute charge gives you around an hour of playtime, which definitely comes in handy when you’re running out the door. Or you forgot to charge your earbuds, which is pretty common for us. Beyond all that, they’re rated IPX4, too, so sweat and light rain won’t be a problem. Good thing, because you’ll definitely want to wear these to the gym.\n\nYou can get these buds for just $100 (-41%), which is a fantastic price for everything that you get here. From getting to choose the color you want for this price to the absolutely fantastic sound quality, this is a deal you won’t want to pass up. Be sure you grab a pair while you can.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Jennifer Pattison Tuohy",
    "title": "Matter’s latest update brings tap-to-pair setup",
    "description": "Two new features coming to Matter are designed to make setting up smart gadgets easier. Multi-device QR codes and a tap-to-pair onboarding via NFC are new options for adding devices like smart lights, plugs, locks, and more to a Matter home network. The updat…",
    "url": "https://www.theverge.com/news/662266/matter-spec-update1-4-1-nfc-multi-device-setup",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/STKS495_Smart_Home_CVIRGINIA_E.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-07T11:59:19Z",
    "content": "The smart home interoperability standard looks to streamline how you add smart devices to your home.\r\nThe smart home interoperability standard looks to streamline how you add smart devices to your ho… [+4701 chars]",
    "full_content": "Two new features coming to Matter are designed to make setting up smart gadgets easier. Multi-device QR codes and a tap-to-pair onboarding via NFC are new options for adding devices like smart lights, plugs, locks, and more to a Matter home network. The updates are part of the new 1.4.1 specification for Matter announced today by the Connectivity Standards Alliance, the organization that runs the smart home interoperability standard developed by Apple, Amazon, Google, Samsung, and others in the industry.\n\nWith multi-device QR codes, a multi-pack of devices – such as four lightbulbs or a two-pack of plugs – can now use a single QR code. When that’s scanned into a Matter-compatible app, such as Amazon Alexa or Apple Home, it will set up all four bulbs at once, rather than you having to go through the setup four times and scan each code individually, which is the current process.\n\nNFC onboarding brings the option to skip the QR code and just tap or bring your phone near to a device to pair it to a Matter platform. This should speed up the process as well as make it easier to set up devices that have codes in awkward spots, such as lightbulbs, which have to be powered on to be paired. Trying to scan a code on a bulb when it’s already in the fixture can be tricky, not to mention painful to the eyes (speaking from experience).\n\nNFC set-up isn’t new; Apple has offered it as a way of adding HomeKit accessories for a while, and smart lighting manufacturer Nanoleaf also has it as an option on its devices. But it’s not widely used. Hopefully, the addition to the Matter spec will bring more adoption.\n\nA third update with 1.4.1 allows you to accept any terms and conditions a manufacturer requires directly from the smart home controller app you’re using to set up the device — such as Google or Apple’s Home app. Currently, if T&Cs are required, you’ll be kicked into the manufacturer app.\n\nCalled Enhanced Setup Flow, this appears to be designed to meet regulatory requirements such as Europe’s GDPR, but it could be a step towards adding more manufacturer information in smart home controller apps, meaning less need to use third-party apps.\n\nWe won’t see security cameras, smart speakers, or any new major features come to Matter until late 2025 at the earliest\n\nThe release of the Matter 1.4.1 spec and SDK means developers can now implement these features in their devices. However, it will still be a while before you see them on the gadgets you buy for your smart home, and it could be even longer before the smart home platform you use supports them.\n\nAnything that makes setting up a Matter device smoother is a welcome update. To date, the process has been very hit or miss for me, and I’m not alone. While things have definitely improved, easy setup is one of the core ideas behind the standard. It’s been over two years since Matter launched, and I would have hoped this would be solved already.\n\nThese updates are very minor for a new spec release, which is why it has the 1.4.1 designation — the first dot dot release for Matter. The CSA confirmed this is its official spring release, labeling it Matter’s first “minor release,” and saying that they are still on a bi-annual release cadence following the 1.4 update in November 2024. This means we won’t see security cameras, smart speakers, or any other new device types or major features come to Matter until late 2025, at the earliest.\n\nWhile that’s disappointing for those of us watching Matter closely, it does jive with the CSA’s statement from earlier this year that 2025 is going to be a year of focusing on reliability and performance."
  },
  {
    "source": {
      "id": null,
      "name": "MacRumors"
    },
    "author": "Juli Clover",
    "title": "PSA: Apple Card Daily Cash Back From T-Mobile Dropping to 2% in July",
    "description": "Apple has partnered with multiple merchants to provide three percent Daily Cash back for Apple Card purchases, and T-Mobile has participated in the program since 2019. That's going to end in July, though, and Daily Cash back from T-Mobile will revert to the s…",
    "url": "https://www.macrumors.com/2025/05/08/apple-card-daily-cash-back-t-mobile/",
    "urlToImage": "https://images.macrumors.com/t/FQB1rAk-8A5mkMsEQt261I-QL0Y=/2049x/article-new/2025/01/Apple-Card-iPhone-16-Pro-Feature.jpg",
    "publishedAt": "2025-05-08T22:03:10Z",
    "content": "Apple has partnered with multiple merchants to provide three percent Daily Cash back for Apple Card purchases, and T-Mobile has participated in the program since 2019. That's going to end in July, th… [+716 chars]",
    "full_content": "Apple has partnered with multiple merchants to provide three percent Daily Cash back for Apple Card purchases, and T-Mobile has participated in the program since 2019. That's going to end in July, though, and Daily Cash back from T-Mobile will revert to the standard two percent when using Apple Pay.\n\n\n\nIn its Daily Cash support document, Apple says that starting on July 1, 2025, using ‌Apple Card‌ with ‌Apple Pay‌ at T-Mobile will provide only two percent cash back, instead of the bonus three percent cash back.\n\n‌Apple Card‌ users get two percent cash back for all purchases made with ‌Apple Pay‌, so there will no longer be any extra cash back beyond the two percent when transacting with T-Mobile, including for monthly bills.\n\nApple is still offering three percent cash for ‌Apple Pay‌ purchases from Ace Hardware, Booking.com, ChargePoint, Duane Read, Exxon and Mobil gas stations, Nike, Uber, and Walgreens."
  },
  {
    "source": {
      "id": null,
      "name": "MacRumors"
    },
    "author": "Joe Rossignol",
    "title": "Apple Says These Five Games Are Coming to Apple Arcade Next Month",
    "description": "Apple today announced that five additional games will be added to the Apple Arcade library at the beginning of next month.\n\n\n\n\n\nThe most notable addition will be UNO: Arcade Edition, which is a reimagined version of the popular card game. In addition to solo …",
    "url": "https://www.macrumors.com/2025/05/06/apple-arcade-games-coming-in-june/",
    "urlToImage": "https://images.macrumors.com/t/qeSA2lNWJQSsmfCfgW-ayqjG-uo=/1600x/article-new/2020/06/apple-arcade-orange-feature.jpg",
    "publishedAt": "2025-05-06T14:25:41Z",
    "content": "Apple today announced that five additional games will be added to the Apple Arcade library at the beginning of next month.\r\nThe most notable addition will be UNO: Arcade Edition, which is a reimagine… [+731 chars]",
    "full_content": "Apple today announced that five additional games will be added to the Apple Arcade library at the beginning of next month.\n\n\n\nThe most notable addition will be UNO: Arcade Edition, which is a reimagined version of the popular card game. In addition to solo matches with classic UNO rules, players can go a step further with new options like Wild Swap Hands and Color Showdown. There are three game modes: Quick Match, Custom Games, and Single Player.\n\nThe four other games coming to Apple Arcade on Thursday, June 5:\n\nMore details about all of the games are available on the Apple Newsroom website.\n\nAccessible through the App Store, Apple Arcade is a subscription-based service that provides access to hundreds of games across the iPhone, iPad, Mac, Apple TV, and Apple Vision Pro, all free of ads and in-app purchases. In the U.S., Apple Arcade costs $6.99 per month and is bundled with other Apple services in all Apple One plans."
  }
]