[
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Emma Cosgrove",
    "title": "A guide to Nvidia's competitors: AMD, Qualcomm, Broadcom, startups, and more are vying to compete in the AI chip market",
    "description": "Despite Nvidia's AI semiconductor dominance, competitors are innovating to challenge its lead. Read about AMD, Qualcomm, Broadcom, Amazon, and more.",
    "url": "https://www.businessinsider.com/nvidia-competitors",
    "urlToImage": "https://i.insider.com/681509b2c6ad288d147fe203?width=1200&format=jpeg",
    "publishedAt": "2025-05-11T08:57:02Z",
    "content": "Nvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition.I-Hwa Cheng/AFP/Getty Images\r\n<ul><li>Nvidia dominates the AI semiconductor market.</… [+5915 chars]",
    "full_content": "Nvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition.\n\nNvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition. I-Hwa Cheng/AFP/Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nNvidia is undoubtably dominant in the AI semiconductor space. Estimates fluctuate, but the company has more than 80% market share by some estimates when it comes to the chips that reside inside data centers and make products like ChatGPT and Claude possible.\n\nThat enviable dominance goes back almost two decades, when researchers began to realize that the same kind of intensive computing that made complex, visually stunning video games and graphics possible, could enable other types of computing too.\n\nThe company started building its famous software stack, named Compute Unified Device Architecture or CUDA, 16 years before the launch of ChatGPT. For much of that time, it lost money. But CEO Jensen Huang and a team of true believers saw the potential for graphics processing units to enable artificial intelligence. And today, Nvidia and its products are responsible for most of the artificial intelligence at work in the world.\n\nThanks to the prescience of Nvidia's leadership, the company had a big head start when it came to AI computing, but challengers are running fast to catch up. Some were competitors in the gaming or traditional semiconductor spaces, and others have started up from scratch.\n\nAMD\n\nAMD, led by CEO Lisa Su, lags behind Nvidia but remains its most serious competitor. I-Hwa Cheng/AFP via Getty Images\n\nAMD is Nvidia's top competitor in the market for AI computing in the data center. Helmed by its formidable CEO Lisa Su, AMD launched its own GPU, called the MI300, for the data center in 2024, more than a full year after Nvidia's second generation of data center GPUs started shipping.\n\nThough experts and analysts have touted the chip's specifications and potential based on its design and architecture, the company's software is still somewhat behind that of Nvidia, making these chips somewhat harder to program and use to their full potential.\n\nAnalysts predict that the company has under 15% market share. But AMD executives insist that they are committed to bringing its software up to par and that future expectations for the evolution of the accelerated computing market will benefit the company — specifically, the spread of AI into so-called edge devices like phones and laptops.\n\nQualcomm, Broadcom, and custom chips\n\nAlso challenging Nvidia are application-specific integrated circuits or ASICs. These custom-designed chips are less versatile than GPUs, but they can be designed for specific AI computing workloads at a much lower cost, which have made them a popular option for hyperscalers.\n\nThough multipurpose chips like Nvidia's and AMD's graphics processing units are likely to maintain the largest share of the AI-chip market in the long term, custom chips are growing fast. Morgan Stanley analysts expected the market for ASICs to double in size in 2025.\n\nCompanies that specialize in ASICs include Broadcom and Marvell, along with the Asia-based players Alchip Technologies and MediaTek.\n\nMarvell is in part responsible for Amazon's Trainium chips while Broadcom builds Google's tensor processing units, among others. OpenAI, Apple, Microsoft, Meta, and TikTok parent company ByteDance have all entered the race for a competitive ASIC as well.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nAmazon and Google\n\nWhile also being prominent customers of Nvidia, the major cloud providers like Amazon Web Services and Google Cloud Platform, often called hyperscalers, have also made efforts to design their own chips, often with the help of semiconductor companies.\n\nAmazon's Trainium chips and Google's TPUs are the most scaled of these efforts and offer a cheaper alternative to Nvidia chips, mostly for the companies' internal AI workloads. However, the companies have shown some progress in getting customers and partners to use their chips as well. Anthropic has committed to running some workloads on Amazon's chips, and Apple has done the same with Google's.\n\nIntel\n\nIntel and its Gaudi line of AI chips has struggled to compete with Nvidia and AMD. Mandel Ngan/AFP via Getty Images\n\nOnce the great American name in chip-making, Intel has fallen far behind its competitors in the age of AI. But, the firm does have a line of AI chips called Gaudi that some reports have said can stand up to Nvidia's in some respects.\n\nIntel installed a new CEO, semiconductor veteran Lip-Bu Tan, in the first quarter of 2025 and one of his first actions was to flatten the organization so that the AI chip operations reports directly to him.\n\nHuawei\n\nThough Nvidia's American hopeful challengers are many, China's Huawei is perhaps the most concerning competitor of all for Nvidia and all those concerned with continued US supremacy in AI.\n\nHuang himself has called Huawei the \"single most formidable\" tech company in China. Reports that Huawei's AI chip innovation is catching up are increasing in frequency. New restrictions from the Biden and Trump administrations on shipping even lower-power GPUs to China have further incentivized the company to catch up and serve the Chinese markets for AI. Analysts say further restrictions being considered by the Trump administration are now unlikely to hamper China's AI progress.\n\nStartups\n\nAlso challenging Nvidia are a host of startups offering new chip designs and business models to the AI computing market.\n\nThese firms are starting out at a disadvantage, as they don't have the full-sized sales and distribution machines decades of chip sales in other types of tech bring. But several are holding their own by finding use cases, customers, and distribution methods that are attractive to customers based on faster processing speeds or lower cost. These new AI players include Cerebras, Etched, Groq, Positron AI, Sambanova Systems, and Tenstorrent, among others."
  },
  {
    "source": {
      "id": null,
      "name": "Nietras.com"
    },
    "author": "nietras",
    "title": "21 GB/s CSV Parsing Using SIMD on AMD 9950X",
    "description": "Sep 0.10.0 was released April 22nd,\n2025 with optimizations\nfor AVX-512 capable CPUs like the AMD\n9950X (Zen 5) and updated benchmarks\nincluding the 9950X. Sep now achieves a staggering 21 GB/s on the 9950X for\nthe low-level CSV parsing.  Before 0.10.0, Sep…",
    "url": "https://nietras.com/2025/05/09/sep-0-10-0/",
    "urlToImage": null,
    "publishedAt": "2025-05-09T13:38:06Z",
    "content": "Sep 0.10.0 was released April 22nd,\r\n2025 with optimizations\r\nfor AVX-512 capable CPUs like the AMD\r\n9950X (Zen 5) and updated benchmarks\r\nincluding the 9950X. Sep now achieves a staggering 21 GB/s o… [+24419 chars]",
    "full_content": "Sep 0.10.0 was released April 22nd, 2025 with optimizations for AVX-512 capable CPUs like the AMD 9950X (Zen 5) and updated benchmarks including the 9950X. Sep now achieves a staggering 21 GB/s on the 9950X for the low-level CSV parsing. 🚀 Before 0.10.0, Sep achieved ~18 GB/s on 9950X.\n\nSee v0.10.0 release for all changes for the release, and Sep README on GitHub for full details.\n\nIn this blog post, I will dive into how .NET 9.0 machine code for AVX-512 is sub-optimal and what changes were made to speed up Sep for AVX-512 by circumventing this, showing interesting code and assembly along the way, so get ready for SIMD C# code, x64 SIMD assembly and tons of benchmark numbers.\n\nHowever, first let’s take a look at the progression of Sep’s performance from early 0.1.0 to 0.10.0, from .NET 7.0 to .NET 9.0 and from AMD Ryzen 9 5950X (Zen 3) to 9950X (Zen 5), as I have also recently upgraded my work PC.\n\nSep Performance Progression\n\nThe benchmark numbers above are for the package assets CSV data and the low level parse Rows only scope, see Sep README on GitHub or code on GitHub for details on this. Note that all numbers here are single-threaded and are also shown in the table below. Note that there can be a few percentage points variation in the numbers, so for a given release Sep might see minor regressions.\n\nThe main take away is that Sep has seen incremental improvements to performance driven by both major (e.g. almost complete rewrite of internals in 0.2.0) and minor code changes. While also seeing improved performance on new .NET versions. And finally here showing improvement for going from the AMD 5950X (Zen 3) to AMD 9950X (Zen 5). Hence, this showcases how software together with hardware improvements can boost performance to the next level.\n\nWe can see Sep progressing:\n\n~ 7 GB/s (0.1.0, 5950X and .NET 7.0)\n\n(0.1.0, 5950X and .NET 7.0) ~12 GB/s (0.3.0, 5950X and .NET 8.0)\n\n(0.3.0, 5950X and .NET 8.0) ~13 GB/s (0.6.0, 5950X and .NET 9.0)\n\n(0.6.0, 5950X and .NET 9.0) ~18 GB/s (0.9.0, 9950X and .NET 9.0)\n\n(0.9.0, 9950X and .NET 9.0) ~21 GB/s (0.10.0, 9950X and .NET 9.0)\n\nThis is a staggering ~3x improvement in just under 2 years since Sep was introduced June, 2023.\n\nSep .NET CPU Rows Mean [ms] MB MB/s Ratio ns/row 0.1.0 7.0 5950X 1000000 79.590 583 7335.3 1.00 79.6 0.2.0 7.0 5950X 1000000 57.280 583 10191.6 1.39 57.3 0.2.1 7.0 5950X 50000 2.624 29 11120.2 1.52 52.5 0.3.0 7.0 5950X 50000 2.537 29 11503.7 1.57 50.7 0.3.0 8.0 5950X 50000 2.409 29 12111.6 1.65 48.2 0.4.0 8.0 5950X 50000 2.319 29 12581.3 1.72 46.4 0.4.1 8.0 5950X 50000 2.278 29 12811.2 1.75 45.6 0.5.0 8.0 5950X 50000 2.326 29 12544.5 1.71 46.5 0.6.0 9.0 5950X 50000 2.188 29 13339.9 1.82 43.8 0.9.0 9.0 5950X 50000 2.230 29 13088.4 1.78 44.6 0.9.0 9.0 9950X 50000 1.603 29 18202.7 2.48 32.1 0.10.0 9.0 9950X 50000 1.365 29 21384.9 2.92 27.3\n\nThe improvement from 5950X w. Sep 0.9.0 to 9950X w. Sep 0.10.0 is ~1.6x which is a pretty good improvement from Zen 3 to Zen 5. Note the 9950X has a 5.7 GHz boost frequency vs 4.9 GHz for 5950X, so this alone probably explains 1.2x.\n\nAVX-512 Code Generation and Mask Register Issues\n\nSep has had support for AVX-512 since 0.2.3 and back then I noted that:\n\ndifferent here is the use of the mask registers ( k1-k8 ) introduced with AVX-512. However, .NET 8 does not have explicit support for these and the code generation is a bit suboptimal, given mask register are moved to normal registers each time. And then back.\n\nI did not have direct access to an AVX-512 capable CPU then, so I could not test the performance of the AVX-512 in detail, but did verify it on the Xeon Silver 4316 which based on some quick tests showed the AVX-512 parser to be the fastest on that CPU despite the issues with the mask registers.\n\n9950X Upgrade and AVX-512 vs AVX2 Performance\n\nRecently, I then upgraded from an AMD 5950X (Zen 3) CPU to an AMD 9950X (Zen 5) CPU. Zen 3 does not support AVX-512, but Zen 5 does. One of the first things I did on the new CPU was of course to run the Sep benchmarks, and this showed, that Sep hit ~18 GB/s on the 9950X for the low-level parsing of CSV files. This was great and ~1.4x faster than on the 5950X. A pretty good improvement from Zen 3 to Zen 5.\n\nHowever, I still wanted to compare AVX-512 to AVX2. Sep has, unofficial, support for overriding the default selected parser via an environment variable. This is also used for testing all possible parsers fully no matter which parser is selected as best. A bit surprisingly the AVX2 parser on 9950X hit ~20GB/s! That is, it was better than the AVX-512 based parser by ~10%, which is pretty significant for Sep. Hence, it would seem the mask register issue was still an issue.\n\nParser Code/Assembly Comparison and New AVX-512-to-256 Parser\n\nLet’s examine the code and assembly (via Disasmo) for the AVX-512-based parser (0.9.0), a tweaked version (0.10.0), compare it to the AVX2-based parser, and finally review a new AVX-512-to-256-based parser that circumvents the mask register issue and is even faster than the AVX2-based parser, achieving ~21 GB/s as shown above.\n\nParse Methods\n\nAll parsers in Sep follow the same basic layout as shown below and have a single generic Parse method to support both parsing for when handling quotes ( ParseColInfos ) and when not ( ParseColEnds ). The former requires keeping track of more state, and is slightly slower.\n\nIn Sep the Parse method is marked with AggressiveInlining to ensure it is inlined, which means one can in principle go to ParseColEnds in Visual Studio with Disasmo installed and hit ALT + SHIFT + D . Unfortunately, for some reason this does not work currently unless you change the parser from a class to struct . So readers are aware if they want to follow along. See GitHub issue Empty disassembly for method with inlined generic method (used to work) for more.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 public void ParseColEnds ( SepReaderState s ) { Parse < int , SepColEndMethods >( s ); } public void ParseColInfos ( SepReaderState s ) { Parse < SepColInfo , SepColInfoMethods >( s ); } void Parse < TColInfo , TColInfoMethods >( SepReaderState s ) where TColInfo : unmanaged where TColInfoMethods : ISepColInfoMethods < TColInfo > { // Implementation }\n\nTo recap, parsing in Sep is done on a span of char s (from an array) e.g. 16K and outputs a set of column end indices and row column counts for that span. This ensures parsing is done on a significant yet small enough chunk of data to fit in the CPU cache, and facilitates efficient multi-threading after too.\n\nParsing of the span is basically then just a loop where one or two SIMD registers (e.g. Vector256 ) are loaded (as unsigned 16-bit integers e.g. ushort ) and converted to byte SIMD register and then compared to the special characters (e.g.\n\n, \\r , \" , ; ) using SIMD compare instructions. The compare results are then converted to bit masks and each set bit in that mask is sequentially parsed after.\n\nThe interesting part here is the SIMD code and how it’s JIT’ed to machine code on .NET and how efficient that is. Below this specific code and assembly is shown for the parsers mentioned before.\n\nSepParserAvx512PackCmpOrMoveMaskTzcnt.cs (0.9.0)\n\nA breakdown of the below code snippet:\n\nData Loading and Packing: Two 16-bit integer vectors ( v0 and v1 ) are read from memory using unaligned reads.\n\nand ) are read from memory using unaligned reads. These vectors are packed into a single byte vector using PackUnsignedSaturate , ensuring values fit within the byte range.\n\n, ensuring values fit within the byte range. For AVX-512 this means loading two 512-bit SIMD registers each with 32 char s and then packing it to single 512-bit SIMD register with 64 bytes. This means 64 char s are handled in each loop. Reordering Packed Data: The packed data is interleaved, so a permutation operation ( PermuteVar8x64 ) is applied to reorder the bytes into the correct sequence. Character Comparisons: The byte vector is compared against specific characters (e.g.\n\n, \\r , \" , ; ) using SIMD equality operations. These comparisons identify special characters relevant to CSV parsing. Combine Comparison Results: The results of the comparisons are combined using logical operations. Bitmask Generation and Check: A MoveMask operation extracts a bitmask from the SIMD register, allowing for a quick check to skip further processing if no special characters are found.\n\nAll parsers follow the same basic approach, so this description will be omitted going forward. Note how ISA and Vec are aliases used to make the different parsers more similar which makes it easier to compare and maintain the different parsers.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 var v0 = ReadUnaligned < VecI16 >( ref byteRef ); var v1 = ReadUnaligned < VecI16 >( ref Add ( ref byteRef , VecUI8 . Count )); var packed = ISA . PackUnsignedSaturate ( v0 , v1 ); // Pack interleaves the two vectors need to permute them back var permuteIndices = Vec . Create ( 0L , 2L , 4L , 6L , 1L , 3L , 5L , 7L ); var bytes = ISA . PermuteVar8x64 ( packed . AsInt64 (), permuteIndices ). AsByte (); var nlsEq = Vec . Equals ( bytes , nls ); var crsEq = Vec . Equals ( bytes , crs ); var qtsEq = Vec . Equals ( bytes , qts ); var spsEq = Vec . Equals ( bytes , sps ); var lineEndings = nlsEq | crsEq ; var lineEndingsSeparators = spsEq | lineEndings ; var specialChars = lineEndingsSeparators | qtsEq ; // Optimize for the case of no special character var specialCharMask = MoveMask ( specialChars ); if ( specialCharMask != 0u )\n\nAssembly is shown below for a 64-bit CPU with AVX-512 support e.g. the 9950X. What is most interesting here is that each compare Vec.Equals ends up being two instructions vpcmpeqb ( c o mp are eq ual b ytes) and vpmovm2b ( mov e m ask to b yte). That is, there is a lot of going from the mask register, e.g. k1 , to a normal 512-bit register, e.g. zmm5 , and back again.\n\nNote that the C# code does not deal with vector mask registers directly. This is not supported in .NET and hence it is the JIT that is responsible for code generation around this. Unfortunately, here it does not do a good job and the AVX-512 is not as fast as it could be.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 mov edi , r9d lea rdi , bword ptr [ r10 + 2 * rdi ] vmovups zmm4 , zmmword ptr [ rdi ] vpackuswb zmm4 , zmm4 , zmmword ptr [ rdi + 0x40 ] vmovups zmm5 , zmmword ptr [ reloc @ RWD00 ] vpermq zmm4 , zmm5 , zmm4 vpcmpeqb k1 , zmm4 , zmm0 vpmovm2b zmm5 , k1 vpcmpeqb k1 , zmm4 , zmm1 vpmovm2b zmm16 , k1 vpcmpeqb k1 , zmm4 , zmm2 vpmovm2b zmm17 , k1 vpcmpeqb k1 , zmm4 , zmm3 vpmovm2b zmm4 , k1 vpternlogd zmm5 , zmm4 , zmm16 , - 2 vpord zmm16 , zmm5 , zmm17 vpmovb2m k1 , zmm16 kmovq r15 , k1 test r15 , r15 je G_M000_IG03 vpmovb2m k1 , zmm4 kmovq r13 , k1 lea r12 , [ r15 + r8 ] cmp r13 , r12 je G_M000_IG43\n\nSepParserAvx512PackCmpOrMoveMaskTzcnt.cs (0.10.0)\n\nTo address the above code generation issues, in Sep 0.10.0 I changed the AVX-512 based parser by moving the MoveMask calls earlier to avoid the whole mask register back and forth as shown below. For other parsers, MoveMask is only called when necessary to reduce instructions in the “happy”/skip path.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 var v0 = ReadUnaligned < VecI16 >( ref byteRef ); var v1 = ReadUnaligned < VecI16 >( ref Add ( ref byteRef , VecUI8 . Count )); var packed = ISA . PackUnsignedSaturate ( v0 , v1 ); // Pack interleaves the two vectors need to permute them back var permuteIndices = Vec . Create ( 0L , 2L , 4L , 6L , 1L , 3L , 5L , 7L ); var bytes = ISA . PermuteVar8x64 ( packed . AsInt64 (), permuteIndices ). AsByte (); var nlsEq = MoveMask ( Vec . Equals ( bytes , nls )); var crsEq = MoveMask ( Vec . Equals ( bytes , crs )); var qtsEq = MoveMask ( Vec . Equals ( bytes , qts )); var spsEq = MoveMask ( Vec . Equals ( bytes , sps )); var lineEndings = nlsEq | crsEq ; var lineEndingsSeparators = spsEq | lineEndings ; var specialChars = lineEndingsSeparators | qtsEq ; // Optimize for the case of no special character var specialCharMask = specialChars ; if ( specialCharMask != 0u )\n\nThis improves the assembly for the parser quite a bit as can be seen below. Basically, less instructions. We are still going to mask register to normal register but at least only once.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 mov edi , r9d lea rdi , bword ptr [ r10 + 2 * rdi ] vmovups zmm4 , zmmword ptr [ rdi ] vpackuswb zmm4 , zmm4 , zmmword ptr [ rdi + 0x40 ] vmovups zmm5 , zmmword ptr [ reloc @ RWD00 ] vpermq zmm4 , zmm5 , zmm4 vpcmpeqb k1 , zmm4 , zmm0 kmovq r15 , k1 vpcmpeqb k1 , zmm4 , zmm1 kmovq r13 , k1 vpcmpeqb k1 , zmm4 , zmm2 kmovq r12 , k1 vpcmpeqb k1 , zmm4 , zmm3 kmovq rcx , k1 or r15 , rcx or r15 , r13 or r12 , r15 je SHORT G_M000_IG03 mov r13 , rcx lea rcx , [ r12 + r8 ] cmp r13 , rcx je G_M000_IG43\n\nSepParserAvx2PackCmpOrMoveMaskTzcnt.cs (0.10.0)\n\nLet’s compare the AVX-512 to the AVX2 based parser. C# code is shown below.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 var v0 = ReadUnaligned < VecI16 >( ref byteRef ); var v1 = ReadUnaligned < VecI16 >( ref Add ( ref byteRef , VecUI8 . Count )); var packed = ISA . PackUnsignedSaturate ( v0 , v1 ); // Pack interleaves the two vectors need to permute them back var bytes = ISA . Permute4x64 ( packed . AsInt64 (), 0 b_11_01_10_00 ). AsByte (); var nlsEq = Vec . Equals ( bytes , nls ); var crsEq = Vec . Equals ( bytes , crs ); var qtsEq = Vec . Equals ( bytes , qts ); var spsEq = Vec . Equals ( bytes , sps ); var lineEndings = nlsEq | crsEq ; var lineEndingsSeparators = spsEq | lineEndings ; var specialChars = lineEndingsSeparators | qtsEq ; // Optimize for the case of no special character var specialCharMask = MoveMask ( specialChars ); if ( specialCharMask != 0u )\n\nThe assembly below is, however, clearly more straightforward as there are no mask registers involved. This explains why the AVX2 based parser is faster than the old (0.9.0) AVX-512 based parser.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 mov edi , r9d lea rdi , bword ptr [ r10 + 2 * rdi ] vmovups ymm4 , ymmword ptr [ rdi ] vpackuswb ymm4 , ymm4 , ymmword ptr [ rdi + 0x20 ] vpermq ymm4 , ymm4 , - 40 vpcmpeqb ymm5 , ymm4 , ymm0 vpcmpeqb ymm6 , ymm4 , ymm1 vpcmpeqb ymm7 , ymm4 , ymm2 vpcmpeqb ymm4 , ymm4 , ymm3 vpternlogd ymm5 , ymm4 , ymm6 , - 2 vpor ymm6 , ymm5 , ymm7 vpmovmskb r15d , ymm6 mov r15d , r15d test r15 , r15 je SHORT G_M000_IG03 vpmovmskb r13d , ymm4 mov r13d , r13d lea r12 , [ r15 + r8 ] cmp r13 , r12 je G_M000_IG43\n\nSepParserAvx512To256CmpOrMoveMaskTzcnt.cs (0.10.0)\n\nGiven that even the tweaked AVX-512 (0.10.0) based parser had issues with mask registers, I kept thinking that perhaps there was a more straightforward way to do this, and then after some searching and unfruitful discussions with LLMs I figured out that one could just use AVX-512 instructions for loading the char s and then convert the 16-bit to 8-bit bytes saturated as a 256-bit register, avoiding the 512-bit mask registers, by using ConvertToVector256ByteWithSaturation ( vpmovuswb ) as shown below. This “only” parses 32 char s at a time, but it is much simpler and avoids the mask register issue.\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 var v = ReadUnaligned < VecUI16 >( ref byteRef ); var bytes = ISA . ConvertToVector256ByteWithSaturation ( v ); var nlsEq = Vec . Equals ( bytes , nls ); var crsEq = Vec . Equals ( bytes , crs ); var qtsEq = Vec . Equals ( bytes , qts ); var spsEq = Vec . Equals ( bytes , sps ); var lineEndings = nlsEq | crsEq ; var lineEndingsSeparators = spsEq | lineEndings ; var specialChars = lineEndingsSeparators | qtsEq ; // Optimize for the case of no special character var specialCharMask = MoveMask ( specialChars ); if ( specialCharMask != 0u )\n\nThe assembly then is much simpler and direct (closer to AVX2) and not only avoids the mask register issues but also has more straightforward saturated conversion since no permutation is needed as the packed data is already in order just in the ymm4 register (that is the 256-bit part of zmm4 ).\n\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 mov edi , r9d lea rdi , bword ptr [ r10 + 2 * rdi ] vmovups zmm4 , zmmword ptr [ rdi ] vpmovuswb zmm4 , zmm4 vpcmpeqb ymm5 , ymm4 , ymm0 vpcmpeqb ymm6 , ymm4 , ymm1 vpcmpeqb ymm7 , ymm4 , ymm2 vpcmpeqb ymm4 , ymm4 , ymm3 vpternlogd ymm5 , ymm4 , ymm6 , - 2 vpor ymm6 , ymm5 , ymm7 vpmovmskb r15d , ymm6 mov r15d , r15d test r15 , r15 je SHORT G_M000_IG03 vpmovmskb r13d , ymm4 mov r13d , r13d lea r12 , [ r15 + r8 ] cmp r13 , r12 je G_M000_IG43\n\nAnd this is what brings Sep parsing up to a staggering 21 GB/s on the 9950X! 🚀\n\nAll Parsers Benchmarks\n\nFinally, given all the parsers available in Sep I have added a benchmark, that uses the aforementioned environment variable, to run all parsers and compare their performance on the low level row parsing to better gauge their individual performance on the same CPU. Here the AMD 9950X.\n\nThe new AVX-512-to-256 parser is the fastest parser of all hitting ~21.5 GB/s, but the Vector256/AVX2 based parsers are not far behind (about 5%). SepParserVector256NrwCmpExtMsbTzcnt is the cross-platform Vector256 based parser and it is notably now on par with the AVX2, but note how the other cross-platform Vector128 and Vector512 based parsers are not (still fast but 5-10% slower), and even worse that the Vector512 one is slower than the Vector128 .\n\nSepParserIndexOfAny is far behind, and should make it clear that any ideas that this could be used to compete with Sep are not realistic. 😉 Vector64 is not accelerated on the 9950X and therefore very slow. It’s just there for completeness.\n\nParser MB/s ns/row Mean SepParserAvx512To256CmpOrMoveMaskTzcnt 21597.7 27.0 1.351 ms SepParserVector256NrwCmpExtMsbTzcnt 20608.5 28.3 1.416 ms SepParserAvx2PackCmpOrMoveMaskTzcnt 20599.3 28.3 1.417 ms SepParserAvx512PackCmpOrMoveMaskTzcnt 19944.3 29.3 1.463 ms SepParserAvx256To128CmpOrMoveMaskTzcnt 19465.5 30.0 1.499 ms SepParserSse2PackCmpOrMoveMaskTzcnt 19312.5 30.2 1.511 ms SepParserVector128NrwCmpExtMsbTzcnt 18252.1 32.0 1.599 ms SepParserVector512NrwCmpExtMsbTzcnt 18067.4 32.3 1.615 ms SepParserIndexOfAny 2787.0 209.4 10.471 ms SepParserVector64NrwCmpExtMsbTzcnt 459.9 1268.9 63.446 ms\n\nTop Level 5950X vs 9950X Benchmarks\n\nFinally, the table below shows the top level benchmarks for the 5950X and 9950X CPUs for the package assets and floats data.\n\nNote how on the 9950X the one million package assets rows are parsed in just 72 ms for Sep_MT (multi-threaded Sep) compared to 119 ms on the 5950X. Or 8 GB/s on 9950X vs 4.9 GB/s on 5950X. ~8 GB/s! 🚀\n\nSimilarly, for floats Sep can parse 8 GB/s of floating point CSV data multi-threaded. ~8 GB/s! 🌪\n\nThat’s, about 1.5x-1.6x improvement, similarly to the low level benchmarks, going from 5950X to 9950X. That’s significant generational improvements to CPU performance. Kudos to AMD and TSMC.\n\nPackage Assets 5950X\n\nMethod Rows Mean Ratio MB/s ns/row Allocated Alloc Ratio Sep 1000000 432.887 ms 1.00 1348.6 432.9 260.41 MB 1.00 Sep_MT 1000000 119.430 ms 0.28 4888.1 119.4 261.39 MB 1.00 Sylvan 1000000 559.550 ms 1.29 1043.3 559.6 260.57 MB 1.00 ReadLine_ 1000000 573.637 ms 1.33 1017.7 573.6 1991.05 MB 7.65 CsvHelper 1000000 1,537.602 ms 3.55 379.7 1537.6 260.58 MB 1.00\n\nPackage Assets 9950X\n\nMethod Rows Mean Ratio MB/s ns/row Allocated Alloc Ratio Sep 1000000 291.979 ms 1.00 1999.4 292.0 260.41 MB 1.00 Sep_MT 1000000 72.213 ms 0.25 8084.1 72.2 261.63 MB 1.00 Sylvan 1000000 413.265 ms 1.42 1412.6 413.3 260.57 MB 1.00 ReadLine_ 1000000 377.033 ms 1.29 1548.4 377.0 1991.04 MB 7.65 CsvHelper 1000000 1,005.323 ms 3.44 580.7 1005.3 260.58 MB 1.00\n\nFloats 5950X\n\nMethod Rows Mean Ratio MB/s ns/row Allocated Alloc Ratio Sep 25000 20.297 ms 1.00 1001.1 811.9 7.97 KB 1.00 Sep_MT 25000 3.780 ms 0.19 5375.6 151.2 179.49 KB 22.51 Sylvan 25000 52.343 ms 2.58 388.2 2093.7 18.88 KB 2.37 ReadLine_ 25000 68.698 ms 3.38 295.8 2747.9 73493.12 KB 9,215.89 CsvHelper 25000 100.913 ms 4.97 201.4 4036.5 22061.69 KB 2,766.49\n\nFloats 9950X\n\nMethod Rows Mean Ratio MB/s ns/row Allocated Alloc Ratio Sep 25000 16.182 ms 1.00 1255.7 647.3 7.94 KB 1.00 Sep_MT 25000 2.497 ms 0.15 8136.8 99.9 179.81 KB 22.64 Sylvan 25000 38.800 ms 2.40 523.7 1552.0 18.72 KB 2.36 ReadLine_ 25000 54.117 ms 3.34 375.5 2164.7 73493.05 KB 9,253.27 CsvHelper 25000 71.601 ms 4.42 283.8 2864.1 22061.55 KB 2,777.70\n\n🌟 Summary Highlights\n\nAI generated summary highlights 😁\n\n🚀 Blazing Fast Parsing : Sep 0.10.0 achieves an incredible 21 GB/s CSV parsing speed on AMD 9950X, a ~3x improvement since its first release in 2023!\n\n: Sep 0.10.0 achieves an incredible CSV parsing speed on AMD 9950X, a since its first release in 2023! 🖥 Hardware Boost : Upgrading from AMD 5950X (Zen 3) to AMD 9950X (Zen 5) delivers a ~1.6x performance gain , thanks to AVX-512 support and higher clock speeds.\n\n: Upgrading from AMD 5950X (Zen 3) to AMD 9950X (Zen 5) delivers a , thanks to AVX-512 support and higher clock speeds. 🧠 Smarter Parsers : The new AVX-512-to-256 parser circumvents mask register inefficiencies, outperforming AVX2 and older AVX-512 parsers, achieving ~21 GB/s !\n\n: The new circumvents mask register inefficiencies, outperforming AVX2 and older AVX-512 parsers, achieving ! 📊 Cross-Platform Excellence : The Vector256 based cross-platform parser is now on par with AVX2, ensuring top-tier performance across platforms.\n\n: The based cross-platform parser is now on par with AVX2, ensuring top-tier performance across platforms. 🔬 Deep Dive : Explored .NET 9.0 JIT optimizations, SIMD assembly, and parser design for CSV parsing.\n\n: Explored .NET 9.0 JIT optimizations, SIMD assembly, and parser design for CSV parsing. 🏆 Multi-Threaded Power : Sep parses 1 million rows in just 72 ms on the 9950X, achieving 8 GB/s for real-world CSV workloads.\n\n: Sep parses on the 9950X, achieving for real-world CSV workloads. 🔧 Continuous Improvement: Incremental optimizations and hardware advancements have propelled Sep to new heights in just under 2 years.\n\n🎉 Sep is a testament to the power of software and hardware working together to push the boundaries of performance!\n\nThat’s all!"
  },
  {
    "source": {
      "id": null,
      "name": "Slashdot.org"
    },
    "author": "msmash",
    "title": "Microsoft Unveils AI-Powered Overhaul for Windows 11",
    "description": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs, introducing features that leverage neural processing units across the operating system. The update centers on AI-powered helpers across core Windows apps, with an intellig…",
    "url": "https://tech.slashdot.org/story/25/05/06/185254/microsoft-unveils-ai-powered-overhaul-for-windows-11",
    "urlToImage": "https://a.fsdn.com/sd/topics/windows_64.png",
    "publishedAt": "2025-05-06T18:05:00Z",
    "content": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs, introducing features that leverage neural processing units across the operating system. The update centers on A… [+1063 chars]",
    "full_content": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs , introducing features that leverage neural processing units across the operating system. The update centers on AI-powered helpers across core Windows apps, with an intelligent agent in Settings that can locate and adjust options via natural voice commands. Key additions include expanded Click To Do functionality, allowing users to draft Word content based on screen context, engage Reading Coach, or send details directly to Excel tables.The Photos app gains a relight feature with support for three customizable light sources, while Paint adds object selection and text-to-sticker generation. Snipping Tool will automatically detect and crop prominent screen content, adding text extraction and color picking capabilities. System-level enhancements include an updated Start menu with phone companion integration, AI-powered actions in File Explorer for content summarization, and text generation in Notepad with new formatting options.Most features will debut first on Windows Insider builds for Snapdragon-powered Copilot+ PCs before expanding to systems with AMD or Intel chips. Several tools, including Ask Copilot and Reading Coach, are already available to Insiders."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Kyle Barr",
    "title": "A New GTA VI Trailer Is Here, but We Still Don’t Know if the Game Is Coming to Switch 2",
    "description": "Grand Theft Auto VI is going to be on PS5 and Xbox on May 26, though Switch 2 wasn't mentioned at all.",
    "url": "https://gizmodo.com/a-new-gta-vi-trailer-is-here-but-we-still-dont-know-if-the-game-is-coming-to-switch-2-2000598647",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/GTA-VI-Real_Dimez_02.0ea0477d.jpg",
    "publishedAt": "2025-05-06T17:30:57Z",
    "content": "Grand Theft Auto VIwont arrive in 2025, but as a consolation prize, Rockstar Games dropped a video featuring a few snippets of gameplay for whats still one of the most anticipated games set to arrive… [+4651 chars]",
    "full_content": "Grand Theft Auto VI won’t arrive in 2025, but as a consolation prize, Rockstar Games dropped a video featuring a few snippets of gameplay for what’s still one of the most anticipated games set to arrive next year. That slice-of-life trailer cements just how little we know about Rockstar’s ultra-hyped open world. The big question on everyone’s mind: will GTA VI ever launch on Nintendo Switch 2, and if there are plans, will it arrive on the May 26, 2026 release date, or sometime after?\n\nRockstar’s new page for GTA VI offers a few scant details about the game’s story and its expansive cast of criminal characters. Players will terrorize Vice City and the surrounding state of Leonida Keys as Jason Duval, a military vet working for drug dealers. His partner in crime, Lucia Caminos, is an ex-con who wants to make her dreams of a good life a reality by any means necessary. At the top of the page, Rockstar says the upcoming open-world game will be available on PlayStation 5 and Xbox Series X and Series S at launch. It makes no mention of PC or Switch 2 availability.\n\nRockstar normally takes a full year before it publishes its games to other platforms, like it did for Grand Theft Auto V and Red Dead Redemption 2 on PC (these ports are reportedly more complicated than they seem). Still, the company has worked with Nintendo to launch past titles like the first Red Dead Redemption on the original Switch (though not the recent remastered version). Judging by analyst expectations and its massive wave of preorders, the Switch 2 is set to be the biggest console release of the past several years. The video game industry is relying on GTA VI to be a similarly landmark release. Publishers also hope GTA publisher Take-Two Interactive and Rockstar will sell the game for $100, setting a new price ceiling for game prices beyond today’s burgeoning $80 AAA game standard.\n\nOne industry analyst who spoke to Gizmodo mentioned Nintendo may not appreciate the press of the ultra-violent Grand Theft Auto series finally coming to its largely family-friendly platform. Still, Take-Two has every reason to want GTA VI on Switch 2, and Strauss Zelnick, the company’s CEO, said as much during a recent earnings call. Zelnick hedged his bets, telling investors that Nintendo’s consoles aren’t just geared for younger players. He cited games like Civilization VII being on the Switch 2 as an example of the handheld’s aging demographic. He added that his company “actually would fully expect to support Switch [2].”\n\nZelnick recently had to assuage shareholders’ disappointment at the GTA VI delay. A Switch 2 announcement would do a lot to help in that regard, though we’ve not heard anything official. “We’ve had—obviously—a long-standing relationship with Nintendo,” Zelnick said during his February earnings report. “We’ve supported the platform when it made sense for the individual release.”\n\nThere’s also the matter of whether or not the Switch 2 is up to snuff to run GTA VI. The console’s Nvidia-made chipset is speculated to have performance roughly between a PlayStation 4 and PS4 Pro. That being said, the Switch 2 is powerful enough to play Cyberpunk 2077, though only at 1080p when docked and hooked up to a TV. CD Projekt Red worked directly with Nintendo on the port, and developers recently said on a Nintendo Creator’s Voice video the port may be “the most cyberpunk way” of playing the game thanks to the addition of mouse and motion controls on the new Joy-Cons 2. CD Projekt Red VP of business development Jan Rosner told The Game Business that it makes sense for Cyberpunk 2077 to be on Switch 2 since “Nintendo’s audience is growing and broadening.”\n\nCyberpunk 2077 will fit on a 64GB game card, though that’s not the norm. Many other large, third-party games will be loaded on game-key cards, which are essentially a download code for players to get the title on Nintendo’s eShop. GTA VI will likely be a massive title, and it could easily eat up a huge chunk of the system’s 256GB built-in storage. Cyberpunk 2077 will be a slightly different experience than on PC, especially considering the difference in the size of the game, though Rosner stressed that coming back to Night City will still be as engrossing and violent as before.\n\nEven if CD Projekt Red had an easy time porting to Switch 2, there are other technical aspects to consider. Rockstar’s games run on the Rockstar Advanced Game Engine, though we don’t know how much stress it might put on both modern consoles, especially when playing at 4K. The only upscaling tech the game will have access to is the still-limited, AMD-based PSSR on PlayStation 5 Pro, so Rockstar would be better off making GTA VI accessible with the Nvidia-made upscaling on the Switch 2. There’s still plenty of time for Rockstar to finally let us hold up drugstores on Nintendo’s family-friendly console."
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Tobias Mann",
    "title": "Tech titans: Wanna secure US AI leadership? Stop giving the world excuses to buy Chinese",
    "description": "Execs from AMD, Microsoft, and OpenAI tear into profit busting AI diffusion rules\nExecs from several top US tech companies, including Microsoft, AMD, and OpenAI, slammed the Biden administration's export rules for AI chips and said that winning the AI race ag…",
    "url": "https://www.theregister.com/2025/05/09/tech_titans_wanna_secure_us/",
    "urlToImage": "https://regmedia.co.uk/2025/05/09/ai_senate_panel.jpg",
    "publishedAt": "2025-05-09T15:09:13Z",
    "content": "Execs from several top US tech companies, including Microsoft, AMD, and OpenAI, slammed the Biden administration's export rules for AI chips and said that winning the AI race against China hinges on … [+4186 chars]",
    "full_content": "Execs from several top US tech companies, including Microsoft, AMD, and OpenAI, slammed the Biden administration's export rules for AI chips and said that winning the AI race against China hinges on making it easier, not harder, to use American technology.\n\nTheir comments before the US Senate come as the Trump administration weighs sweeping changes to Biden-era export controls, which were set to cap sales of AI accelerators to most countries outside the US and a select few allies.\n\nIn a senate hearing [video] Thursday, Microsoft President Brad Smith said, \"The number one factor that will define whether the United States or China wins this race is whose technology is most broadly adopted in the rest of the world,\" said Microsoft President Brad Smith. He argued that the AI diffusion rules proposed by the prior administration tell the rest of the world that that they can't necessary count on the US to sell them the right goods for their AI needs.\n\n\"How can you make a bet on suppliers if you're not confident that they'll be able to fulfill your needs?\"\n\nAMD CEO Lisa Su echoed Smith's sentiments, warning that if American companies are not permitted to meet the AI needs of other nations, the US government may inadvertently drive them into the arms of Chinese suppliers.\n\nToday, the US produces the most advanced AI accelerators in the world, but China is catching up despite certain disadvantages, Su said. And you don't necessarily need the best chips to be a contender in the AI arena, she added.\n\n\"Having the best chips is great, but even if you don't have the best chips, you can get a lot done,\" she said.\n\nBoth Su and Smith agree that export controls, while necessary from a national security perspective to prevent power American technologies from falling into the wrong hands, would benefit from a lighter touch.\n\n\"I think the conversation about export controls and rules should just be simple, easy to follow,\" Su said.\n\nSmith was more direct, suggesting that Uncle Sam scrap the compute limits proposed for so-called tier-2 nations. These nations include just about every country not already subject to US arms embargoes - and go way beyond the 18 countries on Uncle Sam's best-friends list.\n\n\"We need, I believe, to get rid of the quantitative caps that were created for all of these tier-2 countries,\" he said.\n\nSmith and Su are hardly the first to call this tune. Executives from Nvidia and Cerebras have made similar arguments.\n\n\"We need to accelerate the diffusion of American AI technology around the world,\" Nvidia CEO Jensen Huang said during a press conference earlier this month. \"The policies and encouragement from the administration really need to support that.\"\n\nOpenAI boss Sam Altman also said he was \"glad\" to see the rules rescinded, in contrast to comments from rival Anthropic, which had advocated for tightening chip controls even further.\n\n\"I agree there will need to be some constraints,\" he said. \"But I think if our mental model is winning diffusion instead of stopping diffusion, that directionally seems right,\" he said. \"Influence comes from people adopting US products and services up and down the stack — maybe, most obviously, if they're using ChatGPT versus DeepSeek, but also if they're using US chips and US data center technology.\"\n\nDuring the more than three-hour discussion, Altman downplayed the threat of Chinese models like DeepSeek-R1 and emphasized the importance of combating models like these through competition.\n\n\"We're going to release an open source model that, we believe, will be the leading model this summer, because we want people to build on the US stack,\" he said.\n\nMeanwhile, the Trump administration is signaling that change is indeed on the horizon.\n\n\"The Biden AI rule is overly complex, overly bureaucratic, and would stymie American innovation,\" a Commerce Department spokeswoman told Reuters this week. \"We will be replacing it with a much simpler rule that unleashes American innovation and ensures American AI dominance.\"\n\nGiven the Trump administration's unpredictability so far with regard to foreign trade rules, it's hard to know what those rules will actually look like. Some analysts speculate that the president may seek to use AI accelerators as yet another bargaining chip where tariffs prove ineffective.\n\nThe Biden-era rules were set to take effect May 15, so we'll find out before then. ®"
  },
  {
    "source": {
      "id": null,
      "name": "Windows Central"
    },
    "author": "ben.wilson@windowscentral.com (Ben Wilson)",
    "title": "AMD's new Radeon graphics driver is ready for DOOM: The Dark Ages and delivers FSR 4 upscaling support to Frostpunk 2, more",
    "description": "AMD's new Radeon \"Adrenaline Edition\" graphics driver 25.4.1 supports FSR 4 upscaling tech on The Elder Scrolls 4: Oblivion Remastered and other recent PC favorites.",
    "url": "https://www.windowscentral.com/gaming/pc-gaming/amd-radeon-graphics-driver-may-2025-doom-the-dark-ages",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/Div533X9aJyAbYHf6kppQR.jpg",
    "publishedAt": "2025-05-09T14:00:17Z",
    "content": "Yesterday, AMD updated its \"Adrenaline Edition\" driver for Radeon desktop and laptop graphics hardware to version 25.5.1 — now available for download directly from AMD.com.\r\nAs expected, it includes … [+5212 chars]",
    "full_content": "We awarded DOOM: The Dark Ages a perfect score , and AMD GPUs are now ready to support the game at launch.\n\nYesterday, AMD updated its \"Adrenaline Edition\" driver for Radeon desktop and laptop graphics hardware to version 25.5.1 — now available for download directly from AMD.com.\n\nAs expected, it includes new graphics support for two big PC game releases dropping this month: the perfectly-scored DOOM: The Dark Ages (May 15) and the next racing entry in F1 25 (May 30), alongside an expansion to its list of titles with FSR 4 (FidelityFX Super Resolution 4) upscaling tech supported by Radeon RX 9070 graphics cards.\n\nFSR 4 means titles like the recently updated survival city builder, Frostpunk 2, can render at a lower internal resolution and have the final image upscaled with sophisticated techniques that retain sharp edges and clean textures.\n\nIt essentially reduces the rendering stress when playing at 4K+ resolutions on any compatible RDNA 4 Radeon GPU like the $599 Radeon RX 9070 XT.\n\nMore FSR 4 and HYPR-RX support for Team Red\n\nGhost of Tsushima is a goregeous samurai action adventure that should run better than ever with FSR 4. (Image credit: Sucker Punch Productions)\n\nI'm always happy to see more PC games benefit from AMD's FSR 4 upscaling tech as it continues to fight for relevance against NVIDIA's DLSS 4 and Intel's XeSS 2, and I'm a particular fan of any graphics card manufacturer that makes its more affordable models more capable of running the most graphically intensive games.\n\nThe high-selling samurai adventure blockbuster, Ghost of Tsushima Director's Cut, is among the list of newly-supported games with FSR 4, so if you were previously put off by its demanding GPU requirements, then a $549 RX 9070 RDNA 4 GPU could be the answer (yeah, it's not the cheapest answer, but it's \"future proof\", right?)\n\nOtherwise, more titles like the successful multiplayer shooter Marvel Rivals now have per-game \"HYPR-Tune\" support for AMD's HYPR-RX suite, which combines input latency reduction with FSR 4 and more component tweaks designed to squeeze the maximum performance potential out of your gaming PC or laptop.\n\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors"
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "harish.jonnalagadda@futurenet.com (Harish Jonnalagadda)",
    "title": "ASUSTOR Flashstor 6 Gen2 FS6806X review: Is this all-flash NAS the real deal?",
    "description": "ASUSTOR has a new all-flash NAS in the Flashstor 6 Gen2 FS6806X, and it is quite good.",
    "url": "https://www.androidcentral.com/accessories/smart-home/asustor-flashstor-6-gen2-fs6806x-review",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/8iCq7X8xjYCyrHkyw96oMY.jpg",
    "publishedAt": "2025-05-06T12:09:23Z",
    "content": "Why you can trust Android Central\r\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.ASUSTOR did a great… [+7034 chars]",
    "full_content": "The Flashstor 6 Gen2 FS6806X is a notable upgrade, bringing 10 Gigabit Ethernet and powerful internals. The software is much better this time as well, and with six M.2 slots and the ability to add traditional HDDs via USB 4, you have enough storage. There's no Plex transcoding, and it isn't the best value, but if you're ready to switch to all-flash storage, the FS6806X is a legitimate contender.\n\nWhy you can trust Android Central Our expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.\n\nASUSTOR did a great job overhauling its product portfolio over the last two years, and the brand is now a legitimate contender if you're interested in setting up a home NAS system. The Flashstor 6 Gen2 FS6806X is aimed at those looking to switch to SSDs as the default medium of storage, and the all-flash NAS comes with six M.2 slots and 10 Gigabit Ethernet connectivity.\n\nThere are decent choices in this category now, and having tested TerraMaster's F8 SSD Plus last year, I was keen on seeing what ASUSTOR brings to the table. The brand is doing much better with its software efforts, and its mobile clients are in a decent state.\n\nIf you're ready to switch to SSD storage and want a powerful home server, this is what you're getting with the FS6806X.\n\nASUSTOR Flashstor 6 Gen2 FS6806X: Pricing and availability\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nASUSTOR unveiled the Flashstor 6 Gen2 in November 2024, and the NAS is now available globally. The FS6806X model I'm testing has six M.2 slots and retails for $999 on Amazon, and ASUSTOR also has a 12-drive model dubbed the Flashstor 12 Pro Gen2 FS6812X that costs $1,399.\n\nIn my view, the 6-bay FD6806X should be more than adequate, considering you can add traditional HDD bays if you need to via USB 4. Like the brand's other NAS systems, you get a standard three-year warranty with either model.\n\nASUSTOR Flashstor 6 Gen2 FS6806X: Design\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThe key benefit of an all-flash NAS is that it is considerably smaller than a traditional home server as it doesn't need to accommodate 3.5-inch drive bays. ASUSTOR went with a horizontal design for the FS6806X, and the NAS reminds me of ASUS routers; the angular design is characteristic of the brand, and it looks cool.\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThat said, it is bigger than the F8 SSD Plus while not providing as many SSD slots. You get six M.2 slots on the underside, and I can't help but feel that ASUSTOR could have done a better job with the sizing of the NAS. Then there's the location of the buttons; I'll admit that it took me an embarrassingly long time to locate the power button (it's located on the right).\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThe button glows (obviously), and other than that, you just get the usual status indicators. There's a dual-tone design with a brushed metal effect, but the chassis itself is made out of plastic. The build quality isn't the best; there's a noticeable flex to the chassis, and it doesn't quite have the same sturdiness as other NAS models I tested.\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThere are other issues with the design, particularly with the M.2 drive bay; while most NAS systems use a traditional screw to secure the SSD after it's installed, ASUSTOR went with a plastic backing system that just doesn't measure up. I broke two mounts just by pulling back after installing SSDs, and it is annoying. There's a reason every other SSD NAS in this category uses screws to mount NVMe drives, and I don't know why ASUSTOR decided to innovate in this area.\n\nThankfully, the brand nailed the thermal management, and the addition of a fan over the SSD slots ensures the drives don't overheat. I believe the design needs an overhaul, and ASUSTOR needs to do better with the build quality in general.\n\nASUSTOR Flashstor 6 Gen2 FS6806X: Ports and connectivity\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThe FS6806X doesn't have any shortcomings when it comes to connectivity; the NAS has 10 Gigabit Ethernet as standard, and it has dual USB-C connectors based on USB 4 ports alongside two USB-A ports that use the3.2 Gen2x1 standard. You even get a USB-A up front, and it's convenient to back up external drives using the connector.\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nThe NAS is powered by a 2.3GHz quad-core AMD Ryzen V3C14 platform, and it isn't short on power. If anything, it is one of the better choices in this category, and the only issue I have with ASUSTOR going with AMD is that there's no hardware transcoding, so you miss out on that ability. If you're using Plex and need transcodes, you'll need to get an Intel-based model instead, such as the F8 SSD Plus.\n\nOther than that, you get 8GB of RAM installed out of the box, and as it uses regular SO-DIMM slots, you can switch out memory modules, with the NAS accommodating up to 64GB.\n\nASUSTOR Flashstor 6 Gen2 FS6806X: Performance\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nSetting up the FS6806X is easy; just slot in the drives, and you'll be able to configure ADM, the brand's software. ASUSTOR did a much better job in this area in the last two years, and ADM has a decent interface with plenty of great utilities. I was able to set up Plex and Tailscale without any issues, and install the usual slate of services I use on with every NAS.\n\nI slotted in WD SN770 drives and connected the NAS to my 10GbE network, and it did a fantastic job. It held its own against the F8 SSD Plus in this area, and while there was an issue transferring a 240GB volume of data once, I didn't see any problems after starting over.\n\nThe NAS does a good job as a Plex server; the native client doesn't have any problems as such, but you don't get hardware transcoding. Outside of that, the FS6806X handles the usual tasks without any issues; backing up photos and videos, accessing data outside the house, and generally using the drive as a media streaming device proved to be hassle-free.\n\nASUSTOR Flashstor 6 Gen2 FS6806X: The alternatives\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nI still think the F8 SSD Plus is the best all-flash NAS around; it doesn't cost as much as the FS6806X, and you get eight SSD slots alongside the same 10GbE connectivity. There's plenty to like with the software as well, and coming in at $799, the NAS is a good value.\n\nASUSTOR Flashstor 6 Gen2 (FS6806X): Should you buy it?\n\n(Image credit: Harish Jonnalagadda / Android Central)\n\nYou should buy this if:\n\nYou need a powerful all-flash NAS\n\nYou want 10GbE connectivity\n\nYou shouldn't buy this if:\n\nYou want hardware transcoding in Plex\n\nYou need the best value\n\nWith SSDs getting affordable, it's not that difficult to set up an all-flash NAS, and the FS6806X has the basics covered. While I'm not a fan of the design, the NAS has good thermal management, and that's what ultimately matters in an SSD enclosure. With 10GbE and USB 4, there are no issues with connectivity either.\n\nASUSTOR is making positive strides with its software, and while there are still a few rough edges, it's in a much better position than previous years. Ultimately, there isn't anything wrong with the FS6806X as such, but it isn't quite as good a value as the F8 SSD Plus. The FS6806X gets a recommendation because of the hardware and connectivity, and if you want to maximize value, just know that there are other choices available."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "This 17″ HP Laptop With 64GB RAM, 2TB SSD Is Now $1,700 Off, Amazon Practically Giving It Away",
    "description": "This computer is normally meant for high-end users but it is now affordable even for students.",
    "url": "https://gizmodo.com/this-17-hp-laptop-with-64gb-ram-2tb-ssd-is-now-1700-off-amazon-practically-giving-it-away-2000600673",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/laptop-hp-17.jpg",
    "publishedAt": "2025-05-10T20:31:26Z",
    "content": "With all the laptops available on the market, it is hard to find one that perfectly matches your need. The majority of them offer good performance or great appearances, but few offer the kind of raw … [+2318 chars]",
    "full_content": "If you’re searching for a business laptop that delivers really good performance without draining your wallet, the Dell Latitude 5550 is a deal you won’t want to miss. Right now, this 15-inch machine (32GB DDR5 RAM, 1TB PCIe SSD, Intel 12-Core Ultra 5 135U) is available on Amazon at a record low price, slashed by more than 50% down to just $1,099 from its original $2,299. If you need serious computing power, Dell has always been a reliable choice.\n\nSee at Amazon\n\nFor Demanding Users\n\nThe Dell Latitude 5550 is made for demanding users who need speed, reliability, and flexibility. At its core is the Intel Core Ultra 5 135U processor which is a 12-core powerhouse with 14 threads and a maximum turbo frequency of 4.3 GHz. This chip outpaces the popular i7-1355U in benchmarks and integrates advanced AI accelerators which is ideal for multitasking and business applications. Paired with 32GB of fast DDR5 RAM, you’ll experience seamless performance.\n\nIt also comes with a 1TB PCIe NVMe SSD, so you will get lightning-fast boot times, rapid file transfers and ample space for all your documents. The 15.6-inch Full HD IPS display offers very good visuals and wide viewing angles while its anti-glare coating ensures comfortable use even in bright office environments. The display’s 250-nit brightness and 45% NTSC color coverage make it suitable for any tasks.\n\nThe Dell laptop is equipped with two Thunderbolt 4 ports (which support high-speed data transfer), DisplayPort Alt Mode, USB4, and power delivery. Additional ports include USB 3.2 Gen 1 with PowerShare, HDMI 2.1, RJ-45 Ethernet, a universal audio jack and a microSD card slot. This versatility makes the Latitude 5550 ready for any office setup or on-the-go scenario. Oh and by the way, you’ll also get a free mouse.\n\nThe laptop features a fingerprint reader for quick and secure logins, Dell’s Control Vault 3+ for advanced hardware-based security, and a backlit keyboard with a numeric keypad for comfortable typing in any lighting condition. Windows 11 Pro comes pre-installed on the laptop and provides advanced productivity and security features tailored for business users. Keep in mind that you’ll have to subscribe to Microsoft Office 2024, or download Microsoft 365 (yearly plan) to get the popular Microsoft productivity suite.\n\nDon’t miss this chance to get one of the best Windows laptops at a massive discount: it will run out of stock very soon.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Rock Paper Shotgun"
    },
    "author": "Edwin Evans-Thirlwell",
    "title": "Here are some leaked images of an Xbox-branded handheld and the Asus ROG Ally 2",
    "description": "Cough! Splutter! Sneeze! Excuse me, it's mighty dusty in here all of a sudden. Exceedingly dirty alleged leaked images of both the Asus ROG Ally 2 and what could be Microsoft's rumoured \"Project Kennan\" gaming handheld have burst forth from the tissues of the…",
    "url": "https://www.rockpapershotgun.com/here-are-some-leaked-images-of-an-xbox-branded-handheld-and-the-asus-rog-ally-2",
    "urlToImage": "https://assetsio.gnwcdn.com/ROG-ALLY-2-BLACK-2.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "publishedAt": "2025-05-07T14:52:26Z",
    "content": "Cough! Splutter! Sneeze! Excuse me, it's mighty dusty in here all of a sudden. Exceedingly dirty alleged leaked images of both the Asus ROG Ally 2 and what could be Microsoft's rumoured \"Project Kenn… [+2742 chars]",
    "full_content": "Cough! Splutter! Sneeze! Excuse me, it's mighty dusty in here all of a sudden. Exceedingly dirty alleged leaked images of both the Asus ROG Ally 2 and what could be Microsoft's rumoured \"Project Kennan\" gaming handheld have burst forth from the tissues of the internet in a shower of dead skin particles and grime.\n\nAs reported by Videocardz, 91mobiles and Eurogamer, the images originate from the US Federal Communications Commission's official certification testing procedures. Which is why they look like they've been used as attic insulation, yes.\n\nTwo handhelds are shown in the images, each sporting prodigiously-sized grips. One has the Xbox logo just visible on a button by the left analog stick. That'll be the Xbox-branded one, then, though both are referred to in documentation as versions of the Rog Ally 2. As rumoured by Windows Central earlier this year, Microsoft appear to be collaborating with outside parties on their big break into on-the-go vidyagaming.\n\nImage credit: FCC / Videocardz\n\nThere are no final tech specs, but a quick zoom at each handheld's posterior suggests that the Xbox-branded one will have an AMD eight-core 36W Ryzen Z2 Extreme processor, while the white model comes with an AMD four-core 20W AMD Aerith Plus processor. Each has a seven inch 120Hz screen. You might want to compare and contrast all that with James' review of the original Asus ROG Ally, which he deemed \"a viable alternative\" to the Steam Deck that trades \"some of the ease of use and battery life you get with a Deck\" for \"a nicer screen, more powerful internals, wider game compatibility, and faster storage\".\n\nCare of my Blade Runner-grade forensic scanning equipment, I notice that one of the leaked images also reveals something of the FCC working environment. You can see a small plastic Xmas tree on a filing cabinet in a corner. From this I deduce that either 1) these images were taken around Xmas time, 2) the FCC are pretty loose about tidying up their offices after the holiday season, or 3) the FCC are also road-testing small plastic Xmas trees.\n\nImage credit: FCC / Videocardz\n\nIt's possible Microsoft will air their Xbox handheld properly at their June showcase during this year's Summer Games Fest. Perhaps they'll take the opportunity to comment on the recent BDS boycott of their business links with the Israeli military, as well.\n\nSome might find the dustiness of these prototype handhelds a turn-off, but personally, this is how I want all new computers to look - like potent, forgotten relics of a civilization that perished of disease aeons ago, after all the people in charge of basic sanitation got hooked on Balatro. I would watch a lot more Youtube unboxing videos if the unboxing process were akin to carrying out an archaeological dig. Imagine somebody like Marques Brownlee working the soil with a toothbrush for seven hours in order to get at the latest iPhone. You can have that idea for free, Marques."
  },
  {
    "source": {
      "id": null,
      "name": "Slickdeals.net"
    },
    "author": "Izzy138",
    "title": "ASUS ROG STRIX B650E-I GAMING WIFI Mini ITX AM5 Motherboard $230 + Free Shipping",
    "description": "Newegg [newegg.com] has the Asus ROG STRIX B650E-I GAMING WIFI Mini ITX AM5 Motherboard  for $229.99. Shipping is Free\n\nDetails: AMD B650E\nSupports AMD Ryzen 7000 Series Desktop Processors* * Refer to",
    "url": "https://slickdeals.net/f/18300115-asus-rog-strix-b650e-i-gaming-wifi-mini-itx-am5-motherboard-229-99-free-shipping?utm_source=rss&utm_content=fp&utm_medium=RSS2",
    "urlToImage": "https://slickdeals.net/attachment/3/3/7/7/0/1/3/7/450x450/17537404.thumb",
    "publishedAt": "2025-05-08T07:51:32Z",
    "content": "This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make infor… [+26 chars]",
    "full_content": "This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions.\n\nAdd Entry"
  },
  {
    "source": {
      "id": null,
      "name": "Windows Central"
    },
    "author": "c.cale.hunt@gmail.com (Cale Hunt)",
    "title": "3 of NVIDIA's biggest red flags I can't ignore for its upcoming RTX 5060 launch",
    "description": "NVIDIA's RTX 5060 is expected to launch on May 19. Unfortunately, NVIDIA looks to be limiting review driver access, adding another red flag to the launch.",
    "url": "https://www.windowscentral.com/hardware/nvidia/rtx-5060-launch-red-flags",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/jPKjHFHDb8iDrSSU76htaf.jpg",
    "publishedAt": "2025-05-08T13:51:30Z",
    "content": "NVIDIA made its mid-range RTX 5060 GPUs official on April 15, and the RTX 5060 Ti in 8GB and 16GB versions debuted one day later on April 16.\r\nRumors suggested that the non-Ti 5060 model would launch… [+5477 chars]",
    "full_content": "NVIDIA isn't giving me much confidence in its RTX 5060 launch.\n\nNVIDIA made its mid-range RTX 5060 GPUs official on April 15, and the RTX 5060 Ti in 8GB and 16GB versions debuted one day later on April 16.\n\nRumors suggested that the non-Ti 5060 model would launch on May 19, and NVIDIA has now confirmed that release date with a 9 AM PT (12 PM ET) launch.\n\nStarting May 19 at 9 a.m. Pacific Time, GeForce RTX 5060 graphics cards, desktops, and GeForce RTX 5060 Laptop GPUs will be available from our partners and retailers worldwide.#GeForceRTX50 pic.twitter.com/VLA9bZUWRWMay 6, 2025\n\nAs explained in the NVIDIA post I shared above, standalone RTX 5060 desktop GPUs, pre-built PCs, and laptops are expected to be available on launch day.\n\nThe RTX 5060 is the most affordable \"Blackwell\" GPU that NVIDIA has released so far, arriving with a $299 MSRP. How closely third-party cards stick to that price remains to be seen.\n\nNVIDIA's 60-class GPUs have traditionally been the most popular cards out there for gamers, at least judging by Steam's Hardware survey. A mix of laptop and desktop RTX XX60 cards dominate the list.\n\nRegardless of the 60-class popularity and relatively attractive pricing (at least compared to other RTX 5000 GPUs), some major red flags are popping up as information regarding the RTX 5060's review cycle comes out.\n\nAdd that to the commotion already created by VRAM amounts and a competing AMD Radeon RX 9060 XT that could be unveiled at Computex (which kicks off May 20), and you have a situation in which NVIDIA doesn't look too hot.\n\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nHere are the three biggest issues I have with NVIDIA's upcoming RTX 5060 launch.\n\n🚩 NVIDIA RTX 5060 reviews won't go live on launch day\n\nNVIDIA's RTX 5060 GPU is expected to debut at a $299 MSRP on May 19, 2025. (Image credit: NVIDIA)\n\nThere's no better way to judge a GPU than with first-hand experience and testing.\n\nThis is especially important with NVIDIA's RTX 50-series cards, which have all arrived with boastful performance claims that don't always work out as advertised.\n\nUnfortunately, the most recent news suggests that the company won't provide early access to drivers for press reviewing the RTX 5060.\n\nHardware Unboxed revealed the situation with a post on X, claiming that NVIDIA is \"trying to hide the RTX 5060, just as they did the 8GB RTX 5060 Ti.\"\n\nNvidia: \"We're not hiding the RTX 5060, we're very proud of it and gamers will love it\"...also Nvidia: \"We're going to launch the RTX 5060 on May 19th during Computex, and although reviewers have cards right now we won't be releasing the driver until they go on sale\" pic.twitter.com/Cw0mJnSgUpMay 8, 2025\n\nNo advance drivers means no support for the new RTX 5060, so getting hands on the card early doesn't mean anything.\n\nWorsening the situation is the fact that a lot of the major GPU reviewers will already be at Computex on May 19; hard to properly review a GPU when you're at a trade show.\n\nThe Hardware Unboxed revelation points to a post from igorsLAB with the same information. Igor Wallossek is quoted as saying:\n\n\"I will not (be able to) publish a review of the GeForce RTX 5060 here at the official launch. Not because the sample is missing – it’s already on the table – but because NVIDIA has decided not to provide any press drivers until the launch.\"\n\nNothing like delaying a review until after launch to instill confidence in your product that traditionally sells out within hours (if not minutes) of release.\n\n🚩 NVIDIA's RTX 5060 has only 8GB of VRAM\n\nNVIDIA did a split review opportunity for its RTX 5060 Ti launch, seeding to reviewers ahead of release the version with 16GB of VRAM.\n\nThat left launch-day buyers unsure how well the 8GB version performs, and now that publications have been able to review the card with less VRAM, I can see why.\n\nHardware Unboxed got its hands on the 8GB RTX 5060 Ti and published a review a few days after launch, calling the card \"instantly obsolete.\"\n\nRTX 5060 Ti 8GB - Instantly Obsolete, Nvidia Screws Gamers - YouTube Watch On\n\nTechSpot also provided some in-depth RTX 5060 Ti 8GB testing after launch, and it too called the card \"instantly obsolete.\"\n\nA more complete quote from TechSpot's review sums up the results it saw after testing 15 games:\n\n\"It's painfully obvious that an 8GB frame buffer is no longer satisfactory for PC gaming beyond the most entry-level products, which can't cost more than about $150. Since such products no longer exist in the current market, neither should 8GB VRAM configurations.\"\n\nConsidering the RTX 5060 doesn't have a 16GB VRAM option and falls behind the 5060 Ti in terms of CUDA cores and clock frequency, it's easy to suspect that reviewers won't go easy on the GPU.\n\n🚩 AMD's Radeon RX 9060 XT GPUs are expected soon\n\nAMD's Radeon RX 9060 XT GPUs are expected to be unveiled at Computex 2025. (Image credit: AMD)\n\nRumors suggest that AMD's Radeon RX 9060 XT GPUs will be revealed at Computex 2025.\n\nLike NVIDIA with its RTX 5060 Ti, it looks like AMD plans to offer 8GB and 16GB VRAM options.\n\nConsidering the fallout it's seen regarding NVIDIA's $379 8GB 5060 Ti, I expect AMD will deliver its GPUs at a more affordable price to help justify its own 8GB card.\n\nOf course, the RX 9060 XT GPUs are meant to compete directly with the 5060 Ti — XT is AMD's version of Ti, after all — but a price close to the RTX 5060 would theoretically push a lot of mid-range buyers towards the 9060 XT.\n\nBecause the Radeon announcement is expected so soon after NVIDIA's RTX 5060 launch date, I strongly recommend waiting to see what AMD has created, good or bad, before jumping on any new mid-range GPU."
  },
  {
    "source": {
      "id": null,
      "name": "Rock Paper Shotgun"
    },
    "author": "James Archer",
    "title": "Doom: The Dark Ages doesn’t run badly on PC, but enforced ray tracing slows the pace",
    "description": "I’m liking Doom: The Dark Ages more than local reviewist Nic does, possibly because spending most of 2024 remoulding my brain to learn Elden Ring has unduly engorged the part that appreciates a good parry-and-riposte. C'est la vie demons, and colleague. There…",
    "url": "https://www.rockpapershotgun.com/doom-the-dark-ages-best-settings-pc-performance",
    "urlToImage": "https://assetsio.gnwcdn.com/Doom-The-Dark-Ages-Slayer-prison.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "publishedAt": "2025-05-09T14:03:38Z",
    "content": "I’m liking Doom: The Dark Ages more than local reviewist Nic does, possibly because spending most of 2024 remoulding my brain to learn Elden Ring has unduly engorged the part that appreciates a good … [+9883 chars]",
    "full_content": "I’m liking Doom: The Dark Ages more than local reviewist Nic does, possibly because spending most of 2024 remoulding my brain to learn Elden Ring has unduly engorged the part that appreciates a good parry-and-riposte. C'est la vie demons, and colleague. There is one issue that bothers me, though: why, of all the games on Bethesda’s production lines, was this chosen to be the next game that follows Indiana Jones and the Great Circle in making ray tracing effects compulsory?\n\nIt looks nice enough, and its performance on PC could be a lot worse, considering. But this is Doom, which between the 2016 reboot and Eternal, had become an ambassador for the speedy, low-spec shooter. Living proof that FPS games, even relatively weighty ones, simply feel better when you’re zipzooping around at 100-plus frames per second. No, I’m sorry. They just do. The Dark Ages is at least easier on the ol’ GPU than Indy was, and I’ve had a crack at a settings guide (below) that should give a boost to most rigs, but ray tracing is still a hard requirement that means it won’t even launch on a lot of older hardware.\n\nImage credit: Rock Paper Shotgun/Bethesda Softworks\n\nDoom: The Dark Ages system requirements and PC performance\n\nThese tech changes have also produced system specs that make Doom Eternal’s look like an Aldi shopping list. CPU, RAM, and storage requirements are up considerably across the board, and yes, you will need a graphics card with hardware-based RT capabilities; I tried firing up The Dark Ages on a GTX 1080 Ti and was immediately handed an impassable error message.\n\nDoom: The Dark Ages minimum PC specs (1080p/60fps/Low)\n\nOS: Windows 10 / 11\n\nWindows 10 / 11 CPU: AMD Ryzen 7 3700X / Intel Core i7-10700K\n\nAMD Ryzen 7 3700X / Intel Core i7-10700K GPU: 8GB VRAM; Nvidia GeForce RTX 2060 Super / AMD Radeon RX 6600\n\n8GB VRAM; Nvidia GeForce RTX 2060 Super / AMD Radeon RX 6600 RAM: 16GB\n\n16GB Storage: 512GB or higher NVMe SSD (100GB available)\n\nDoom: The Dark Ages recommended PC specs (1440p/60fps/High)\n\nOS: Windows 10 / 11\n\nWindows 10 / 11 CPU: AMD Ryzen 7 5700X / Intel Core i7-12700K\n\nAMD Ryzen 7 5700X / Intel Core i7-12700K GPU: 10GB VRAM; Nvidia GeForce RTX 3080 / AMD Radeon RX 6800\n\n10GB VRAM; Nvidia GeForce RTX 3080 / AMD Radeon RX 6800 RAM: 32GB\n\n32GB Storage: 512GB or higher NVMe SSD (100GB available)\n\nDoom: The Dark Ages Ultra 4K PC specs (4K/60fps/Ultra)\n\nOS: Windows 10 / 11\n\nWindows 10 / 11 CPU: AMD Ryzen 7 5700X / Intel Core i7-12700K\n\nAMD Ryzen 7 5700X / Intel Core i7-12700K GPU: 16GB VRAM; Nvidia GeForce RTX 4080 / AMD Radeon RX 7900 XT\n\n16GB VRAM; Nvidia GeForce RTX 4080 / AMD Radeon RX 7900 XT RAM: 32GB\n\n32GB Storage: 512GB or higher NVMe SSD (100GB available)\n\nUnusually for a package of pre-release codes, we were also sent early versions of the requisite GPU drivers, namely Nvidia’s GeForce Game Ready 576.31 driver - later updated to 576.40 - and AMD’s Radeon Software 25.10.09.01. These should be out by the time The Dark Ages releases on May 15th (576.40 is out on the 12th), so consider these vital as well. Especially where GeForce RTX 50 series graphics cards are concerned: I tested an RTX 5080 on the then-current 576.28 driver and saw some nasty artifacting, which vanished entirely with version 576.31.\n\nOutside of this, and a seemingly one-off crash when enabling FSR frame generation, The Dark Ages is built pretty stably. More so, again, than The Great Circle, despite its newer and unproven id Tech 8 engine: I haven’t had any of that game’s crashing or black screen problems, nor its fussy insistence on forcing on dynamic resolution when using certain lower-end GPUs.\n\nI still find it uncool, maaaan, to exclude pre-RTX PCs, though it’s not like The Dark Ages puts a medieval shotgun to your head and forces you to buy a 5090 either. In the opening mission, the most technically challenging I’ve played thus far, the humble RTX 4060 was enough to average 60fps at a native 1080p with the Ultra Nightmare preset engaged. That’s maximum quality with all the ray tracing trimmings, no less. My RTX 4050-powered laptop, which actually skirts under the minimum spec by only packing 8GB of system RAM, could also do 71fps on Medium quality – though that was with help from DLSS upscaling, on Quality mode. Last among the cheap n' cheerfuls, Intel’s Arc B580 scored 56fps at native 1080p on Ultra Nightmare, and that was without any cutting-edge early drivers.\n\nImage credit: Rock Paper Shotgun/Bethesda Softworks\n\nHigher resolutions take their toll, though are also more naturally suited to upscaling. As such, the older RTX 3070 could still hang at 1440p, producing 67fps on Ultra Nightmare with Quality DLSS, while the more VRAM-rich Radeon RX 7700 XT managed 74fps (with Quality FSR in place of DLSS). Further upgrades will also yield the triple figures, as the RTX 4070 Ti demonstrated: using the same settings as the RTX 3070, it averaged a smooth (and reasonably consistent) 110fps.\n\nThe 4070 Ti is enough for 4K, too. At this rez, Ultra Nightmare and Quality DLSS yielded 66fps, which climbed up to 104fps using another RTX trick: DLSS 4 frame gen. Naturally, that becomes Multi Frame Generation with an RTX 50 card, allowing the RTX 5080 to go from 85fps at 4K/Ultra Nightmare to 218fps with 4x MFG – and upscaling on Quality mode, in both cases.\n\nUsually, I’d be jumping for joy that a big-money game released in 2025, let alone one with mandatory ray tracing, could get results like these. Especially coming off the back of Oblivion Remastered and Assassin’s Creed Shadows, neither of which are anywhere near as forgiving of cheaper kit. Yet there’s still something disappointing about The Dark Ages’ general performance, which in a way is a victim of id’s own success in assembling fast-running games.\n\nImage credit: Rock Paper Shotgun/Bethesda Softworks\n\nCompared to Doom Eternal, see, The Dark Age’s framerates actually represent a massive slowdown. The extent might vary depending on your CPU as well as your GPU, but on my RTX 4060, reinstalling Eternal revealed it could regularly run at double the new game’s 60fps average at native 1080p. And that’s with ray tracing enabled – switch it off, something you can’t do in The Dark Ages, and it’s closer to quadruple.\n\nI'm aware that I'm whining about big numbers not being as big as big numbers from five years ago, and that the difference might not even be a difference if you're playing on a 60Hz monitor that can't display ultra-rapid framerates anyway. Is the reduction really worth it, though? I’m several hours in and have yet to be wowed by any specific RT effects, as I have been by Cyberpunk 2077’s moody lighting or Control’s impeccably detailed reflections. Full-fat path tracing is coming in a future update, along with DLSS Ray Reconstruction, so more noticeable visual upgrades could still materialise, but then these would cut performance even deeper.\n\nUpdate 11/05: Valve have released SteamOS 3.7.6 Preview, which fixes the crashing problem I was having when trying to launch The Dark Ages on the Steam Deck. No word on when this fix might come to the SteamOS' Beta or Stable branches, but it does the trick for now, and I'm getting 30-40fps on the Low preset with FSR on Performance. I'll revisit after the weekend to see if I can finesse those settings somewhat.\n\nImage credit: Rock Paper Shotgun/Bethesda Softworks\n\nDoom: The Dark Ages best settings guide\n\nDropping the quality toggles should be a viable method for reclaiming Eternal’s sense of speed, except – perhaps because so many of the presets look exactly the chuffing same – there isn’t actually that much performance to be gained from The Dark Ages’ lower settings. Sticking with the RTX 4060 as our guinea pig, that 60fps at 1080p/Ultra Nightmare basically didn’t shift at all on Nightmare, Ultra, and High, while Medium and Low only got the average up to 68fps and 78fps respectively.\n\nThese results delivered a warning that lowering just a few individual options wasn’t going to help much, a fear that was confirmed when I started testing their Low settings one by one. Only two of the eleven main quality settings, shadows and reflections, returned an improved average compared to their Ultra Nightmare equivalents, and these were just 61fps and 62fps. Indistinguishable, in other words.\n\n1 of 6 Attribution\n\nInstead of cutting these, then, we’re going to scrape together some extra frames primarily though upscaling, along with ditching a couple of lesser effects. Try out the following:\n\nChromatic aberration: Off\n\nOff Motion blur: Off\n\nOff Upscaler: DLSS/FSR on Quality\n\nDLSS/FSR on Quality Everything else: Ultra Nightmare\n\n...Now that I’ve written it down, that looks an awful lot like the least sophisticated best settings guide of my career. I apologise, for the second time in this article. Still, there’s no sense in piecemeal-lowering settings that won’t improve framerates, and on that note, this config got the RTX 4060 up to 91fps, a healthy 50% improvement over using the Ultra Nightmare preset as it comes. Don’t be shy about enabling DLSS at a lower resolution like 1080p, either – The Dark Ages uses the up-to-date DLSS 4 with its improved Transformer model, so it’s plenty sharp.\n\nOptionally, DLSS frame generation performs well enough to be worth experimenting with. The 2x setting boosted that 91fps average to 139fps, finally getting back in Doom Eternal territory, though conversely you should stay away FSR frame gen. As in Oblivion Remastered, this is unreliably sluggish and jittery, ultimately making everything look worse than without it.\n\nPartly to make up for the appalling shortness of that list, allow me to also point out some settings that should absolutely be left how they are. Chiefly, Present from Compute should always be set to On; disabling it saw my RTX 4060 plummet from 60fps to 40fps, with no practical benefit. I’d keep Resolution Scaling Mode switched off, too, as upscalers will perform the same role – intentionally lowering resolution to keep performance up – with sharper, more visually consistent results than dynamic scaling."
  },
  {
    "source": {
      "id": null,
      "name": "Quartz India"
    },
    "author": "Niamh Rowe",
    "title": "Here’s why Trump killing the ‘AI diffusion rule’ is a win for chipmakers",
    "description": "The U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips — a policy that had posed challenges for major semiconductor companies like Nvidia (NVDA) and AMD (AMD).Read more...",
    "url": "https://qz.com/nvidia-amd-trump-biden-ai-chips-china-rule-1851779738",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e3e734dd7188b8f9d8051d40af3ea7e5.jpg",
    "publishedAt": "2025-05-08T16:25:00Z",
    "content": "In This Story\r\nThe U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips a policy that had posed challenges for ma… [+1977 chars]",
    "full_content": "The U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips — a policy that had posed challenges for major semiconductor companies like Nvidia (NVDA-1.54% ) and AMD (AMD+0.47% ).\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\n“The Biden AI rule is overly complex, overly bureaucratic and would stymie American innovation,” a spokeswoman from the Commerce Department said in a statement. The Trump administration intends to issue a revised version of the rule, which was set to come into effect on May 15. This process could take months to finalize, sources told Axios.\n\nAdvertisement\n\nThe regulation in question — titled the Framework for Artificial Intelligence Diffusion — would have limited exports of AI chips to over 100 countries. These restrictions aimed to prevent countries from bypassing U.S. export controls, particularly in relation to China.\n\nAdvertisement\n\nChipmakers had criticized the rules, however. They argued it would give an advantage to Chinese competitors, such as Huawei, as they develop and sell their own AI hardware, foregoing an opportunity to ensure that much of the world would rely on American technology. The rule would have affected Nvidia’s ability to sell its high-demand graphics processing units, or GPUs, in markets such as India, Mexico, Singapore, and Switzerland.\n\nAdvertisement\n\nThe shift could reflect a relaxing stance toward regulating AI, offering a momentary boon for chipmakers. Since Bloomberg first reported the reversal on Wednesday, Nvidia and AMD stocks have gained 4.4% and 3.4%, respectively.\n\nBut any respite could prove temporary, and obstacles persist when it comes to accessing the crucial Chinese market.\n\nAdvertisement\n\nNvidia’s most powerful chips, including the A100 and H100, are already banned from export to China, as a result of Biden-era restrictions.\n\nLast month the Trump administration also introduced new license requirements for less powerful chips by Nvidia and AMD in order to comply with export controls. Nvidia said these requirements on its H20 chips had resulted in a $5.5 billion hit to its quarterly earnings, according to a Securities and Exchange Commission filing. The company’s earnings are scheduled to be released May 28."
  },
  {
    "source": {
      "id": null,
      "name": "Windows Central"
    },
    "author": "zacharylboddy@outlook.com (Zachary Boddy)",
    "title": "I've never seen anything like this insanely powerful 14-inch AI laptop, but only about 4 people need it",
    "description": "The HP ZBook Ultra 14 (G1a) is one of the most powerful 14-inch laptops ever made, designed to handle intensive AI workloads in a thin-and-light form factor.",
    "url": "https://www.windowscentral.com/hardware/hp/hp-zbook-ultra-14-g1a-review",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/RCxQUGvZKoNnKpnwX9n8F4.jpg",
    "publishedAt": "2025-05-10T12:00:00Z",
    "content": "Why you can trust Windows Central\r\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.Artificial intellig… [+23111 chars]",
    "full_content": "Only a select few will need so much power in such a compact chassis\n\nDesigned with AI and security in mind, with all the software features to match\n\nHP has taken the most powerful mobile processor AMD has ever built and put it into a 14-inch laptop that wouldn't look out of place on any desk. The ZBook Ultra 14 is ridiculously capable, especially when it comes to AI, yet retains all the qualities of a premium flagship. It's immensely impressive, but this unique blend of features and power will only be needed by a very select few — especially when it costs this much.\n\nWhy you can trust Windows Central Our expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.\n\nArtificial intelligence is all the rage lately, and hardware that can handle even the most intensive AI tasks and workloads is becoming increasingly important.\n\nHP has already started investing heavily in AI, and its ZBook line of ultra-powerful workstations is becoming more capable with every release. The most impressive addition to the family, though, is the HP ZBook Ultra 14 (G1a).\n\nThis flagship machine doesn't look much different from the rest of the thin, light, and premium Windows laptops you can buy, but it packs an absurd amount of power into its compact frame.\n\nCombine that with a unique feature aimed directly at AI developers, as well as some of the most trusted enterprise-grade security and remote management features on the market, and you get a laptop unlike anything else you can buy right now.\n\nDisclaimer This review was made possible thanks to a review sample provided by HP. HP had no input nor saw the contents of this review prior to publication.\n\nWhy You Should Trust Me Why You Should Trust Me Zachary Boddy (They / Them) Social Links Navigation Staff Writer, Expert Reviewer I'm no AI developer, but I can evaluate every part of a laptop's user experience, including its performance, how long it can last off the charger, and if you can trust it to survive years of use. In-depth testing is even more important with enterprise hardware, and I don't cut corners.\n\nZBook Ultra review: Cheat sheet\n\nWhat is it? A premium 14-inch workstation designed with AI, portability, and security in mind.\n\nA premium 14-inch workstation designed with AI, portability, and security in mind. Who is it for? Enterprise customers, AI developers, and other professionals who need as much power as physically possible in a laptop light enough to carry around.\n\nEnterprise customers, AI developers, and other professionals who need as much power as physically possible in a laptop light enough to carry around. How much does it cost? The HP ZBook Ultra 14 (G1a) starts from $2,599 at HP , with configurations going all the way to $8,250 at HP .\n\nThe HP ZBook Ultra 14 (G1a) starts , with configurations going all the way to . What did I like? The flagship-level design and hardware features, the unbeatable performance, and the surprising mobility.\n\nThe flagship-level design and hardware features, the unbeatable performance, and the surprising mobility. What did I not like? The average battery life, the loss of performance off the charger, and the imperfect display.\n\nZBook Ultra review: Pricing and specifications\n\nThe ZBook family is comprised of HP's most capable enterprise-ready workstations. (Image credit: Windows Central | Zachary Boddy)\n\nIf you consider everything that makes a laptop expensive, the HP ZBook Ultra has it all. The design is premium and packed with features, the internals are as powerful as they get, and all the security and remote management features businesses need are included.\n\nSo, the HP ZBook Ultra 14 (G1a) starts from $2,599 at HP with an AMD Ryzen AI MAX PRO 385, 32GB of RAM, 512GB of SSD storage, and a slower, lower resolution, non-touch IPS LCD display.\n\nIf you want to turn every dial up to 11, you can get an HP ZBook Ultra 14 (G1a) for an astonishing $8,250 at HP, with a Ryzen AI MAX+ PRO 395, 128GB of RAM, and 4TB of SSD storage.\n\nThe configuration I reviewed only comes with 2TB of SSD storage, but costs $4,049 at HP. If you're thinking that's a major jump, you'd be right; the ZBook Ultra's pricing is sporadic across configurations, likely dependent on the added enterprise-specific features and packages outside of hardware.\n\nSwipe to scroll horizontally Spec HP ZBook Ultra 14 (G1a) Display 14-inch OLED, 16:10 aspect ratio, 2.8K (2,880 x 1,800) resolution, 48-120Hz variable refresh rate, 400nits max brightness, 100% DCI-P3 color gamut, multi-touch support, HP BrightView & Low Blue Light support CPU Up to AMD Ryzen AI MAX+ PRO 395 (Zen 5 architecture, 16 cores, 32 threads, 5.1GHz max boost) GPU Up to AMD Radeon 8060S (RDNA 3.5 architecture, 40 cores) NPU AMD XDNA 2 (Up to 50 TOPS) Memory Up to 128GB LPDDR5X @ 8,533MHz Storage Up to 4TB M.2 2280 NVMe PCIe Gen 4x4 SSD Ports 2x USB Type-C Thunderbolt 4 (40GBps, DisplayPort 2.1, 140W Power Delivery 3.0), 1x USB Type-C 3.2 Gen 2 (10GBps, DisplayPort 2.1, 140W Power Delivery 3.0), 1x USB Type-A 3.2 Gen 2 (10GBps, charging), 1x HDMI 2.1, 1x 3.5mm audio jack, 1x Kensington Nano Security Slot Connectivity Wi-Fi 7 2x2, Bluetooth 5.4, NFC Battery 74.5Whr 4-cell battery, 140W USB Type-C fast charger Dimensions 312.2 x 215.5 x ~18.5mm (12.29 x 8.48 x ~0.73in) Weight ~1.5kg (~3.3lbs) Warranty 3-year limited\n\nIn the sustainable, plastic-free packaging, you'll find your HP ZBook Ultra 14 (G1a) laptop and a large 140W USB Type-C fast charger. By default, the ZBook Ultra seems to include three years of HP Wolf Pro Security Edition, as well.\n\nRecommended configuration ✅ HP ZBook Ultra 14 (G1a) — Ryzen AI MAX+ 395 Pro | Radeon 8060S | 128GB RAM | 2TB SSD\n\nBuy now: $4,049 at HP If you're considering this laptop, it's already guaranteed that you need all the power you can get. This ZBook Ultra configuration (which happens to be the model I reviewed) is one of the most balanced considering the specs, and you still get the full suite of pro-grade features. 👉See at: HP.com\n\nZBook Ultra review: Design and build quality\n\nThe ZBook Ultra isn't much thicker or heavier than the most popular premium laptops. (Image credit: Windows Central | Zachary Boddy)\n\nDespite its main selling point being the immense amount of power compressed into a 14-inch frame, the ZBook Ultra more or less looks just like any other flagship HP laptop, with a refined and high-quality all-metal chassis and a glass display surrounded by ultra-thin bezels.\n\nAt around 18-20mm in thickness and less than 3.5 lbs, the ZBook Ultra certainly isn't the most diminutive 14-inch laptop — but it's more than slim and light enough to easily slip into any compact travel bag.\n\nIn this respect, the ZBook Ultra boasts similar dimensions to laptops like the Razer Blade 14 (2024) we reviewed and the ASUS ROG Zephyrus G14 (2024) I reviewed, but with unique features and capabilities valuable to enterprise and professional customers.\n\nLike other HP enterprise machines, the ZBook Ultra (G1A) also feels built to last, with tight tolerances in the frame and expert use of premium materials. The keyboard is spill-resistant, too, for the clumsier among us.\n\nImage 1 of 2 From left to right, HDMI 2.1, USB Type-C with 140W Power Delivery, Thunderbolt 4 with 140W Power Delivery, a charging indicator LED, and 3.5mm audio. (Image credit: Windows Central | Zachary Boddy) On the other side, Kensington Nano Security Slot, USB Type-A, and a second Thunderbolt 4 port with 140W Power Delivery. (Image credit: Windows Central | Zachary Boddy)\n\nHP made sure to include a healthy selection of ports, so you don't have to compromise. In fact, the ZBook Ultra is one of a few AMD-powered laptops that boast not one, but two full-featured Thunderbolt 4 ports.\n\nYou also get a third (non-Thunderbolt) USB Type-C port with the same DisplayPort and Power Delivery specifications, although it obviously boasts far less bandwidth. With a separate HDMI 2.1 port, you have endless options for connecting external displays.\n\nYou'll find a legacy USB Type-A port, a trusty 3.5mm audio jack, and a Kensington Nano Security Slot, too. Learning from past laptops and customer feedback, HP has continued to split the Thunderbolt ports, putting one on each side of the ZBook Ultra.\n\nGreat variety, clear labeling, even spacing — what more could you want? Ah, an SD card slot or Ethernet port? Sorry, you'll need a dongle.\n\nZBook Ultra review: Display quality\n\nSleek bezels make this display look even better on the ZBook Ultra. (Image credit: Windows Central | Zachary Boddy)\n\nIf you've seen any HP flagship laptop from the last couple of years, you've probably seen the 2.8K OLED display featured in the ZBook Ultra.\n\nOnce again, it's a great display that I've heavily praised a lot in the past. The 1800p resolution is incredibly crisp at this size, the dynamic 48 - 120Hz refresh rate balances smoothness with efficiency, and the image quality is wonderfully punchy.\n\nGlossy glass and multi-touch support join that impressive panel performance, delivering a premium visual experience that very few would find reason to criticize.\n\nOnce again, HP doesn't disclose the exact High Dynamic Range (HDR) standard to which this display adheres, but I do know it's not Dolby Vision. Either way, it's decent HDR performance that's better to have than not have, but shouldn't be a selling point.\n\nAs always, HP's OLED displays are plenty color accurate. (Image credit: Windows Central)\n\nSwipe to scroll horizontally Setting Brightness Black Contrast White point 0% 4.5 0 Infinite 6,300K (0.316, 0.332) 25% 28.4 0 Infinite 6,200K (0.318, 0.332) 50% 89.1 0 Infinite 6,200K (0.317, 0.332) 75% 205.4 0 Infinite 6,200K (0.317, 0.332) 100% 399 0 Infinite 6,300K (0.317, 0.332)\n\nThis display returned some familiar test results, too. It easily reaches 100% of the DCI-P3 color gamut, as HP promised, with a consistent (if slightly warm) white balance and OLED's characteristic infinite contrast.\n\nMax brightness isn't anything exceptional at right around 400 nits, but it's bright enough, and this display gets quite dim for use in dark environments.\n\nOf course, the ZBook Ultra will receive the same criticisms, too. For one, HP's software is lacking when it comes to display customization and management. ASUS sets the standard here with in-depth settings for OLED protection features, color profiles, anti-flicker, and more.\n\nSpeaking of anti-flicker, the ZBook Ultra does use Pulse-Width Modulation (PWM) for dimming, so sensitive users may be afflicted with eye fatigue and even headaches. The flicker rate is average (so on the low side), so it's best to avoid it if you know you're sensitive.\n\nAt least HP does offer a lower-end IPS LCD display option, but only on the entry-level configuration. With no model configurator, you can't equip the ZBook Ultra with its most powerful hardware and that flicker-free display.\n\nZBook Ultra review: Performance and thermals\n\nI can't overstate how ridiculous this laptop is performance-wise. (Image credit: Windows Central | Zachary Boddy)\n\nAMD and Intel make plenty of capable chipsets for highly mobile hardware, but the HP ZBook Ultra 14 (G1a) is a different beast altogether.\n\nThis laptop may be powered by AMD Ryzen AI, but it's not the same Ryzen AI we've seen in plenty of other laptops. This is the AMD Ryzen AI MAX series, the same ridiculously powerful Systems-on-a-Chip (SoCs) I tested in the quirky ASUS ROG Flow Z13 (2025) tablet I reviewed.\n\nThese Accelerated Processing Units (APUs) can be broken into four parts: AMD's fastest and most efficient mobile processor, smartest Neural Processing Unit (NPU), industry-leading integrated graphics (iGPUs), and the ability to share a crazy amount of hyper-fast RAM across the entire chipset.\n\nThe HP ZBook Ultra is also powered by the enterprise-specific PRO variants with upgraded security and remote management features. That'll be very important for the customers that this laptop is aimed at, but for my review I'll be focusing on the raw performance.\n\nMy review configuration is one of the mightiest HP ZBook Ultra 14s you can buy, with an AMD Ryzen AI MAX+ PRO 395 under the hood. Yes, the naming scheme is still dumb, but that chipset rocks 16 cores and 32 threads, with a 5.1GHz max boost and the most powerful iGPU on the market, the 40-core Radeon 8060S.\n\nImage 1 of 6 This SSD is the one area where the ZBook Ultra isn't ridiculously overpowered, matching the PCIe Gen4 SSDs we've seen lots of times. (Image credit: Windows Central) In this CPU test, the ZBook Ultra is only bested by the most powerful gaming laptops and desktops. (Image credit: Windows Central) The ZBook Ultra is just as competitive in this CPU benchmark, but not quite as impressive as the ROG Flow Z13. (Image credit: Windows Central) The ZBook Ultra returns similar scores for general productivity performance as the rest of the most premium Windows laptops. (Image credit: Windows Central) In this GPU benchmark, though, the ZBook Ultra easily beats any ultrabook, competing with the mobile RTX 4060 GPU. (Image credit: Windows Central) The ZBook Ultra managed an impressively short time when encoding a 4K video. (Image credit: Windows Central)\n\nThere's no reaching necessary to claim the ZBook Ultra is one of the most powerful 14-inch laptops ever made. Its PCIe Gen4 SSD is the one area where it simply keeps up with the best, rather than surpassing them.\n\nIn CPU performance, the ZBook Ultra is among the highest-scoring laptops we've ever tested, going up against flagship 16-inch gaming laptops and even full-blown gaming desktops in some cases.\n\nThe GPU may be a more efficient iGPU built directly into the chip, but it still competes with the NVIDIA GeForce RTX 4060, a discrete GPU (dGPU) that consumes far more power and produces far more heat.\n\nI even played Forza Horizon 5 on the ZBook Ultra, and it hit a 90 frames-per-second (FPS) average at 1200p, on the Extreme graphics preset, and with no AMD FidelityFX Super Resolution upscaling.\n\nThere's some serious engineering going on beneath the surface, but on the outside the ZBook Ultra's ventilation doesn't appear abnormal. (Image credit: Windows Central | Zachary Boddy)\n\nThese Ryzen AI MAX chips also boast a unique feature that no laptop with a more powerful dGPU can boast: a shared memory pool. You can equip this laptop with up to 128GB of the fastest LPDDR5X RAM, and it can share up to 96GB of that RAM with just the iGPU.\n\nThat's not useful for playing video games, but it can be immeasurably valuable for AI developers, data scientists, and other professionals who need to run massive models and projects locally.\n\nThermally, the ZBook Ultra can definitely spit out a lot of heat, but it still runs far cooler and quieter than any 14-inch gaming laptop I've used. It never got too hot to comfortably use, on my lap or otherwise, and the fans are well-tuned (during regular usage, you'll almost never hear them).\n\nI ran the ZBook Ultra through the same 3DMark stress test I put all gaming laptops through, looping the Time Spy benchmark 25 times consecutively. There was a 3.4% framerate difference between the best and worst loops, which is more than the ~2% managed by the best gaming laptops, but is better than your average 14-inch laptop with a dGPU.\n\nOn battery power, the ZBook Ultra is still incredibly powerful, but you will experience about an 18% dip in CPU performance and 25% dip in GPU performance when not connected to a charger.\n\nZBook Ultra review: Software and AI experience\n\nYes, you can use Windows Recall now (I haven't, yet). (Image credit: Windows Central | Zachary Boddy)\n\nHP is building one of the most cohesive and comprehensive AI PC ecosystems, and the HP ZBook Ultra 14 (G1a) is meant to be the true hero device for those efforts.\n\nA Copilot+ PC powered by Windows 11, the ZBook Ultra immediately benefits from all the latest AI features in Windows, including Recall, Click to Do, and much more.\n\nOn top of that, HP is building its own AI solutions, including the HP AI Companion. Sure, you get the same search queries, text generation, and other functions of alternatives like Copilot and ChatGPT, but the AI Companion can also create, manage, and parse local libraries of data.\n\nWorking on a major project? Create a library, and the AI Companion can instantly find specific information, summarize, contextualize, and more — and even when the AI Companion does use the cloud (it doesn't always), your data is always secure and private.\n\nThere's also HP Smart Sense, which combines the ZBook Ultra's AI prowess with all the locational, positional, and thermal information its sensors collect to automatically and intelligently tune your laptop's performance depending on where and how you're using it.\n\nHP could definitely consolidate some of its apps, but it has a good thing going on with its latest laptops. (Image credit: Windows Central | Zachary Boddy)\n\nAll of this is made possible by the AMD Ryzen AI chipset inside, which boasts an NPU with up to 50 TOPS of AI computational power. That's great for efficiency and performance, and future-proofs the ZBook Ultra for future AI developments.\n\nEvery ZBook Ultra is protected by HP's Wolf Pro Security suite, too, which can now offload some of its multi-level hardware, firmware, and software security features and real-time protections to that NPU.\n\nThe real draw of this laptop, though, is that integrated GPU, which is verified by Independent Software Vendors for artificial intelligence, machine learning, data science, and other intensive project workloads.\n\nCombine that with the ZBook Ultra's integration into all of HP's other AI development solutions, and it's clear this laptop is in a league of its own... for specific people.\n\nElsewhere, the ZBook Ultra isn't bloated with a ton of unwanted software, mostly preloading AMD, HP, and Poly Studios apps. HP's software is still needlessly fragmented into nine apps, which should be four at most, but HP is at least apparently working on this.\n\nZBook Ultra review: Battery experience\n\nIt's a chunky 140W charger, but it also uses USB Type-C for peak convenience. (Image credit: Windows Central | Zachary Boddy)\n\nThe moment you set out to make the most powerful laptop you can, you've guaranteed that it won't be the longest-lasting. That's just how it works, and the HP ZBook Ultra (G1a) isn't about to defy physics.\n\nThis laptop still managed to impress me, though. Its 74.5Whr battery is quite large, and the AMD Ryzen AI MAX PRO chipsets are still more efficient than any gaming laptop with a dGPU can manage.\n\nThe result? Respectable endurance, but you will want to keep the charger close for long days. Running a generic Microsoft Office workload and then an HD video for one hour each (with default performance settings, 200 nits display brightness, and 50% volume) returned battery losses of 11% and 22%, respectively.\n\nRunning a Windows Battery Report after a few weeks of usage reaffirmed my estimations. The HP ZBook Ultra is no \"all-day\" machine, but you can easily get 4-5 hours of actual usage without compromising on features or performance, and you could squeeze more life out by toning down the OLED display, performance, and more.\n\nCharging is also incredibly easy. You get a large 140W charger in the box that takes full advantage of USB Type-C's capabilities, so there's no proprietary charging solution here. It's fast and easy, and you can use any of the ZBook Ultra's three USB Type-C ports to get the job done.\n\nZBook Ultra review: Keyboard and touchpad\n\nI'll be more surprised when an HP ZBook or EliteBook has a bad keyboard. (Image credit: Windows Central | Zachary Boddy)\n\nThe HP ZBook Ultra thankfully takes its keyboard directly from HP's more mainstream EliteBook line of enterprise laptops, and it greatly benefits from it.\n\nI love HP's laptop keyboards, and this machine is no exception. The layout is spacious, the font is perfectly legible and clear, and the performance is flawless. All of the improvements that HP made for this new generation of hardware are present here.\n\nI will say that I slightly prefer the more tactile keyboard of the HP EliteBook Ultra 14 (G1i) I reviewed, but the difference is so small as to be basically negligible.\n\nOne difference that I won't ignore? The EliteBook Ultra uses a haptic touchpad, and there's no such option for the ZBook Ultra. Sure, this glass touchpad is large enough, with smooth and responsive tracking thanks to Microsoft Precision drivers, but it's not a haptic touchpad. Boo.\n\nZBook Ultra review: Other hardware\n\nThanks to Poly Studios, HP's webcams, microphones, and speakers have gotten pretty good. (Image credit: Windows Central | Zachary Boddy)\n\nPlenty of workstations designed for office environments happily let some of the extraneous hardware features fall by the wayside, but the ZBook Ultra can't follow the crowd and retain its \"premium\" tag.\n\nThis 5MP webcam isn't quite HP's best, but it's still among the best webcams on a laptop, with good low-light performance, great color reproduction, and consistent white balance. It's also backed by great dual-array microphones and HP's AI-powered Poly Studios software.\n\nYou get two forms of Windows Hello biometric authentication with the IR sensor next to the camera and the fingerprint sensor embedded in the power button, and both solutions work great.\n\nThere's also a Human Presence Detection (HPD) proximity sensor, and the ZBook Ultra is one of the most consistent laptops I've used in dimming the screen when you look away, locking when you walk away, and waking when you approach.\n\nA handful of laptops have the ZBook Ultra beat, but these speakers are still great. (Image credit: Windows Central | Zachary Boddy)\n\nThe HP ZBook Ultra even boasts a quad-speaker system, tuned by Poly Studios and split between the keyboard and down-firing chassis. This laptop may be designed with video conferencing in mind, but these speakers are great all around.\n\nThey're loud, full, and detailed, and are more than suitable for music, movies, and gaming. They do seem to drain a fair bit of juice, but it's great to see Windows laptop speakers continue to get better over time.\n\nFinally, wireless connectivity is handled by the latest Wi-Fi 7 2x2 and Bluetooth 5.4 standards, and as expected, there are zero issues here. You won't find any 5G cellular option for the ZBook Ultra, but I didn't really expect that.\n\nZBook Ultra review: Also consider\n\nPowerful(ish) 💪 HP EliteBook X 14 (G1a) — Ryzen AI 9 HX 375 | 64GB RAM | 1TB SSD\n\nBuy now: $2,749 at HP If you need a powerful, portable 14-inch laptop, but don't need that much power, the EliteBook X is a great alternative. The ZBook Ultra clearly has it beat in performance, but that's not all that matters in a laptop. Windows Central review ⭐⭐⭐⭐ 👉See at: HP.com\n\nExcellent Enterprise 💼 HP EliteBook Ultra 14 (G1i) — Core Ultra 268V | 32GB RAM | 1TB SSD\n\nBuy now: $4,869 at HP This EliteBook Ultra can't hold a candle to the ZBook Ultra in terms of firepower, but it's arguably the far better laptop for most people with its thin-and-light design and incredible user experience. It's expensive, but nice things often are. Windows Central review ⭐⭐⭐⭐½ 👉See at: HP.com\n\nZBook Ultra review: Score card\n\nSwipe to scroll horizontally Attribute Rating & notes Value ⭐⭐⭐½ — The ZBook Ultra is expensive like only a tool aimed at businesses can be, but there's nothing else like it. Design ⭐⭐⭐⭐½ — Considering the level of power packed into this frame, this design is premium, practical, and pretty. Display ⭐⭐⭐⭐ — HP's familiar 2.8K OLED display looks as great as ever, but with some reoccuring weaknesses. Performance ⭐⭐⭐⭐⭐ — Especially for AI developers, no 14-inch laptop can compete with the ZBook Ultra in performance. Software ⭐⭐⭐⭐½ — HP's evolving AI PC ecosystem meets the latest Windows 11 features backed by this uniquely capable hardware. Battery ⭐⭐⭐⭐ — The ZBook Ultra was never going to be a true all-day machine, but don't mistake this for your typical 14-inch gaming laptop. Keyboard ⭐⭐⭐⭐½ — HP's EliteBook and ZBook keyboards are notoriously good, and that tracks here... but with no haptic touchpad. Other hardware ⭐⭐⭐⭐½ — Unlike a lot of ZBook workstations, this laptop's hardware features are premium all the way through. Overall ⭐⭐⭐⭐½ — Very few people need to spend so much on a laptop, but the ZBook Ultra expertly fills an extremely specific niche.\n\nZBook Ultra review: My final thoughts\n\nThere's nothing quite like the HP ZBook Ultra. I also may never see another one after I send this review sample back. (Image credit: Windows Central | Zachary Boddy)\n\n✅You should buy this if ...\n\nYou have very specific security and remote management needs.\n\nYou can actually make use of 128GB of RAM and 96GB of VRAM.\n\nYou need the most powerful 14-inch laptop you can get.\n\n❌You should not buy this if ...\n\nYou want this level of power just for gaming or casual usage.\n\nYou don't care about AI or AI development in the slightest.\n\nAttempting to recommend the HP ZBook Ultra 14 (G1a) feels like an exercise in futility, given that the few people who will actually buy this laptop will know long before they reach this conclusion.\n\nThis is an excellent Windows AI laptop, with a fantastic design, gorgeous display, and a premium collection of luxury features. It's also built with a very specific purpose in mind, and that's shoving as much power for AI workloads as possible into a 14-inch frame.\n\nThat level of truly ridiculous and highly specialized performance, combined with the wealth of enterprise-grade security and remote management features, makes the ZBook Ultra expensive even among enterprise workstations — but if you actually need that power, if you can actually use up to 96GB of VRAM, then you're not buying a laptop, you're investing in a valuable tool.\n\nThe HP ZBook Ultra 14 (G1a) is now available from $2,599 at HP, and this powerful review configuration is available for $4,049 at HP."
  },
  {
    "source": {
      "id": null,
      "name": "PCWorld"
    },
    "author": "Michael Crider",
    "title": "AMD Radeon RX 9060 XT leaked by Brazilian retailer",
    "description": "If you’ve been holding out for more affordable next-gen graphics cards before you upgrade… well, you might still have to wait a long time. “Affordable” is a relative term, after all. But newer and cheaper AMD cards appear to be on the way, after a retailer in…",
    "url": "https://www.pcworld.com/article/2773239/amd-radeon-rx-9060-xt-leaked-by-brazilian-retailer.html",
    "urlToImage": "https://www.pcworld.com/wp-content/uploads/2025/05/XFX-AMD-Radeon-RX-9070-and-9070-XT-2.jpg?quality=50&strip=all&w=1024",
    "publishedAt": "2025-05-06T15:07:07Z",
    "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nIf you’ve been holdi… [+2081 chars]",
    "full_content": "If you’ve been holding out for more affordable next-gen graphics cards before you upgrade… well, you might still have to wait a long time. “Affordable” is a relative term, after all. But newer and cheaper AMD cards appear to be on the way, after a retailer in Brazil leaked a new Gigabyte model. Say hello to the AMD Radeon RX 9060 XT.\n\nOnline shop Terabyte showed a Gigabyte version of the as-yet-unannounced card, briefly and with no price attached, before taking the page down. According to VideoCardz.com, this version of the GPU includes 16 gigabytes of GDDR6 memory, a Navi 44 chip, and 2,048 stream processors. That would give it the same memory as the (presumably) more expensive RX 9070, with a less powerful processor and only about 60 percent of the shaders. A big question mark in the spec sheet would be the memory bus, with previous speculation pinning it at 128-bit, half the width of the 9070.\n\nWe saw both 8GB and 16GB versions of the 9060 XT back in March, with that more narrow memory bus on the spec sheet, but some outlets have reported that the 8GB version of the card has been scrapped. Considering the big focus on expanded memory requirements in PC gaming, especially in the mid-range of graphics cards, that makes sense. But we’re also seeing a lot of PC gamers just priced out of upgrades between rising prices, low supply, and various economic factors.\n\nRetail listings tend to indicate an announcement is coming soon, but with so many variables in play, it’s also possible that launches are getting pushed back. We’ll just have to wait and see."
  },
  {
    "source": {
      "id": null,
      "name": "Windows Central"
    },
    "author": "sean.endicott@futurenet.com (Sean Endicott)",
    "title": "Microsoft unveils \"new generation of Windows experiences\" — here's what's on the way to Windows 11 and Copilot+ PCs",
    "description": "Microsoft just announced major Windows 11 and Copilot+ PC updates, adding a bunch of exclusive features and AI capabilities.",
    "url": "https://www.windowscentral.com/software-apps/windows-11/windows-11-new-experiences-announcement-may-2025",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/xPYW4a73GxGBApFQeECW2h.jpg",
    "publishedAt": "2025-05-06T13:00:00Z",
    "content": "Microsoft just announced a ton of new features for Windows 11 and Copilot+ PCs. While the brand-new Surface hardware headlined today's announcements, Microsoft shared what it calls the \"next wave of … [+7708 chars]",
    "full_content": "Microsoft just announced new features for Copilot+ PCs and Windows 11.\n\nMicrosoft just announced a ton of new features for Windows 11 and Copilot+ PCs. While the brand-new Surface hardware headlined today's announcements, Microsoft shared what it calls the \"next wave of Windows experiences\" as well.\n\nCopilot+ PC experiences\n\nAn AI agent will soon be able to help you locate options within the Windows 11 Settings app. (Image credit: Microsoft)\n\nMicrosoft shipped a wave of exclusive Copilot+ PC features recently, including Recall and Click To Do. The tech giant has another wave in the works.\n\nAn AI agent in Windows 11 will help you find settings on your PC and adjust them. You'll be able to use natural voice to find an option, such as telling your PC your mouse pointer is too small. An AI agent will then find the appropriate setting.\n\nIf you grant the agent permission, it will also be able to take actions or change settings for you.\n\nMore actions are on the way to Click To Do as well. One action, called Ask Copilot, will be able to act on an image or text, such as drafting content in Microsoft Word based on what's on your screen.\n\nYou will also be able to engage Reading Coach through Click To Do or use Immersive Reader. Click To Do will gain the ability to chat through Microsoft Teams or send details from content on your screen to a table in Microsoft Excel.\n\nWindows search is getting further AI enhancements. Soon, you'll be able to locate and install apps through the Microsoft Store by using the feature. Microsoft will also add enhanced search to its Photos app.\n\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThe Microsoft Store will soon show a section full of personalized recommendations. Copilot will be able to answer questions about the pages you browse within the store as well.\n\nApps that are exclusive to Copilot+ PCs or leverage AI capabilities will feature a badge to make things clear to people browsing the store.\n\nPhotos, Paint, and Snipping Tool\n\nRelight in Microsoft Paint lets you add up to three light sources that illuminate an image using AI. (Image credit: Microsoft)\n\nSeveral new features are on the way to Photos, Paint, and Snipping Tool as well.\n\nThe Photos app will soon feature a relight feature that allows you to position up to three light sources. You can set the color of those sources and pick a focus point to have lights follow automatically.\n\nYou can control relight manually or use presets for quicker edits.\n\nAn update to Paint will add support for object select, which lets you isolate a specific element from a canvas. Another new Paint feature will create stickers in response to a text prompt.\n\nAn update to Snipping Tool will scan what's on your screen with AI to create a tightly cropped capture. (Image credit: Microsoft)\n\nAn addition to Snipping Tool will add the option to have screenshots adjusted automatically to capture a tight frame around content. The tool analyzes your screen to focus on prominent content, but you can also fine-tune a selection.\n\nSnipping Tool is also gaining a text extractor and a color picker.\n\nAccessibility\n\nCopilot+ PCs with Snapdragon chips already have accessibility features such as Voice Access. Soon, those same systems will have an improved Narrator.\n\nThe updated Narrator will be able to describe images. Rich image description is available now to Windows Insiders with Snapdragon-powered Copilot+ PCs and will ship to Copilot+ PCs with Intel or AMD chips soon.\n\nWindows 11 experiences\n\nWindows 11's Start menu will soon have more customization options and a phone companion. (Image credit: Microsoft)\n\nWindows Insiders will also gain access to several new Windows 11 experiences over the coming months, including a phone companion and AI actions within File Explorer.\n\nOn top of its new phone companion, which has been in testing for almost a year, the Start menu will gain more customization options soon.\n\nFile Explorer will have AI actions as well. The AI tools in the app will let you summarize content, edit images, and perform other tasks.\n\nA new write function within Notepad will create text from a prompt. Notepad will also support summarizing content with AI and gain some formatting features, such as bold and italic.\n\nCopilot Vision uses AI to scan what's on your screen. (Image credit: Microsoft)\n\nCopilot Vision on Windows is already available to Windows Insiders and will soon ship to everyone. The feature can analyze content on your screen and provide insight.\n\nWindows Insiders can also use Press to Talk by long pressing the Copilot key and speaking with the AI tool.\n\nApps on Copilot+ PCs\n\nMicrosoft highlighted several apps that now work better with Copilot+ PCs by leveraging the NPUs within those computers. Moises Live by Music.AI, which can isolate parts of songs, now works 35 times faster on a Snapdragon X NPU compared to the CPU, according to Microsoft.\n\nThe image upscaling app Gigapixel AI by Topaz Labs has been optimized for Copilot+ PCs as well.\n\nCapcut, DJay Pro, Davinci Resolve, Camo, Cephable, and Liquidtext have also joined the library of apps that can leverage an NPU.\n\nAvailability\n\nMany of the features announced today will be exclusive to Copilot+ PCs. Some of those features will ship to Windows Insiders today, while others will arrive in future updates.\n\nIn many cases, Copilot+ PCs with Snapdragon processors will gain access to the features first. Copilot+ PCs with AMD or Intel chips will get those same features in the future."
  },
  {
    "source": {
      "id": null,
      "name": "Slickdeals.net"
    },
    "author": "Izzy138",
    "title": "Ryzen 9 7900X + 1TB Patriot P400 Lite M.2 PCIe Gen 4 x4 SSD + Monster Hunter Wilds $335.25 + Free Shipping",
    "description": "Newegg [newegg.com] has the *AMD Ryzen 9 7900X 4.7 GHz 12-Core Processor + Patriot P400 Lite M.2 PCIe Gen 4 x4 1TB SSD + Monster Hunter Wilds Game* for $335.24. *Shipping is Free* \n \nDetails: \n* Zen...",
    "url": "https://slickdeals.net/f/18296155-amd-ryzen-9-7900x-4-7-ghz-12-core-processor-patriot-p400-lite-m-2-pcie-gen-4-x4-1tb-ssd-monster-hunter-wilds-game-335-24-free-shipping?utm_source=rss&utm_content=fp&utm_medium=RSS2",
    "urlToImage": "https://slickdeals.net/attachment/3/3/7/7/0/1/3/7/450x450/17526313.thumb",
    "publishedAt": "2025-05-07T01:29:04Z",
    "content": "This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make infor… [+26 chars]",
    "full_content": "Deal History includes data from multiple reputable stores, such as Best Buy, Target, and Walmart. The lowest price among stores for a given day is selected as the \"Sale Price\".\n\n\n\nSale Price does not include sale prices at Amazon unless a deal was posted by a community member."
  }
]