[
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Jess Weatherbed",
    "title": "Amazon now sells prescription pet pills",
    "description": "Amazon is expanding its prescription medication business to include your pooches and pussycats. Through its Vetsource partnership announced on Thursday, Amazon says that “hundreds of prescription pet medications” will now be available for US customers to purc…",
    "url": "https://www.theverge.com/news/664069/amazon-online-pharmacy-pet-prescription-drugs",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/acastro_STK103__01.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-09T11:19:21Z",
    "content": "US customers can get hundreds of prescription pet medications shipped to their door.\r\nUS customers can get hundreds of prescription pet medications shipped to their door.\r\nAmazon is expanding its pre… [+1609 chars]",
    "full_content": "Amazon is expanding its prescription medication business to include your pooches and pussycats. Through its Vetsource partnership announced on Thursday, Amazon says that “hundreds of prescription pet medications” will now be available for US customers to purchase via Amazon’s storefront, including treatments for fleas, ticks, and chronic conditions.\n\nPrescription pet drugs can be found by searching for the required medication in Amazon’s search bar and inputting your prescribing veterinarian’s information during checkout. The Vetsource online pet pharmacy service will then dispense and deliver medications purchased through Amazon, with shipping expected to take between two and six days.\n\nVetsource will contact your veterinarian for approval for first-time orders, but Amazon says that refills can then “usually be processed without additional veterinarian contact” if your account has an active prescription on file. All of the pet medications provided on Amazon are FDA approved, and the company says that the selection of drugs available will be expanded over time.\n\nThe selling point here, much like when Amazon first launched its human-focused online pharmacy service in 2020, is convenience. Being able to order flea, worming, and other essential pet care prescriptions alongside everyday shopping items is convenient for everyone, but especially people who have mobility issues or live in rural areas and would otherwise have to make their way to a vet’s office or pharmacy location. It also puts Amazon more in line with competing online pharmacy services like Walmart, which launched its own service for pet medications in 2019."
  },
  {
    "source": {
      "id": "wired",
      "name": "Wired"
    },
    "author": "Will Knight",
    "title": "Amazon Has Made a Robot With a Sense of Touch",
    "description": "Vulcan, a robot with tactile senses, is a step towards automating more of picking and stowing work done by humans inside Amazon’s fulfillment centers.",
    "url": "https://www.wired.com/story/ai-lab-amazon-launches-vulcan-a-robot-that-can-feel/",
    "urlToImage": "https://media.wired.com/photos/681a7d0a2d86dd4e461dbaea/191:100/w_1280,c_limit/AI-Lab-Robot-That-Can-Feel-Business.jpg",
    "publishedAt": "2025-05-07T08:00:00Z",
    "content": "Amazon has developed a new warehouse robot that uses touch to rummage around shelves to find the right product to ship to customers.\r\nThe robot, called Vulcan, is a meaningful step towards making rob… [+3039 chars]",
    "full_content": "Amazon has developed a new warehouse robot that uses touch to rummage around shelves to find the right product to ship to customers.\n\nThe robot, called Vulcan, is a meaningful step toward making robots less sausage-fingered compared to human beings. Honing robots’ tactile abilities further may allow them to take on more fulfillment and manufacturing work in the years ahead.\n\nAaron Parness, Amazon’s director of robotics AI who led the development of Vulcan, explains that touch sensing helps the robot push items around on a shelf and identify what it’s after. “When you’re trying to stow [or pick] items in one of these pods, you can't really do that task without making contact with the other items,” he says.\n\nThe Vulcan system consists of a conventional robotic arm with a custom spatula-like appendage for poking into a shelf and a sucker for grabbing items to pull them out.\n\nVulcan has sensors on several of its joints that allow the robot to detect the edges and contours of items. Parness says that machine learning is key to making sense of the sensor signals and also forms part of the algorithmic loop that controls how a robot takes actions. “The special sauce we have is the software interpretation of the force torque and how we wrap those into our control loop and into our motion plans,” he says.\n\nAmazon revealed Vulcan at a fulfillment center in Hamburg, Germany, today. The company says the robot is already working at this facility and another in Spokane, Washington.\n\nAmazon\n\nThe new robots will work on the same line as human pickers and will aim to spare them from back-aching work by grasping more items from shelves that are high up or down low. Items that the robot decides it cannot find will be reassigned to human workers."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "Like on Prime Day, Amazon Is Offering 50% Off (Almost) All Fire TV Stick Stock Until Supplies Run Out",
    "description": "Amazon is no longer making any profit on these products.",
    "url": "https://gizmodo.com/like-on-prime-day-amazon-is-offering-50-off-almost-all-fire-tv-stick-stock-until-supplies-run-out-2000599515",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Amazon-Fire-TV-Stick-HD-newest-model.jpg",
    "publishedAt": "2025-05-08T12:10:55Z",
    "content": "Amazon currently has one of its biggest sales ever going on for Fire TV Sticks, and the savings rival both Black Friday and Prime Day. The best part is that unlike Prime Day, you don’t have to be a P… [+2143 chars]",
    "full_content": "Amazon currently has one of its biggest sales ever going on for Fire TV Sticks, and the savings rival both Black Friday and Prime Day. The best part is that unlike Prime Day, you don’t have to be a Prime member in order to enjoy these savings. This flash sale won’t last long so if you’ve been thinking about upgrading your streaming setup, now is the time to act.\n\nThe Fire TV Stick lineup includes several models and each of them is designed to suit different needs and budgets. The entry-level (and newest) Fire TV Stick HD is now just $19, down from $34. This model is perfect if you have an older TV or simply don’t need 4K resolution. It streams up to 1080p HD content and lets you stream all of the most used streaming services like Netflix, Prime Video, Disney+, and many more.\n\nSee Fire TV Stick HD at Amazon\n\nIf you have a 4K TV or are in the process of upgrading soon, the Fire TV Stick 4K is the middle ground of the lineup and now only $29, having fallen from $49. It’s the version for the masses (and the most popular of all Fire TV Stick devices) which offers great 4K Ultra HD streaming, Dolby Vision and HDR10+ compatibility, and Dolby Atmos audio.\n\nSee Fire TV Stick 4K at Amazon\n\nIf you want the best of the best, the Fire TV Stick 4K Max is Amazon’s high-end streaming stick and currently only $39, down from $59. This model adds to the regular 4K Stick with even quicker performance, twice the storage (16GB), and a future-proof Wi-Fi 6E support. The 4K Max also has the Fire TV Ambient Experience, making your TV a digital art gallery when not streaming shows. It’s also the sole Fire Stick with support for the Xbox Game Pass app for cloud gaming.\n\nSee Fire TV Stick 4K Max at Amazon\n\nAlexa Integration\n\nAll Fire TV Sticks come with Alexa voice remote, which makes it easy to search for content, control playback and manage smart home devices. They’re simple to set up-just plug into your TV’s HDMI port, connect to Wi-Fi, and you’re ready to stream.\n\nSummed up: Fire TV Stick HD is perfect for older TVs or low-end specifications, the Fire TV Stick 4K for the average customer with a 4K TV at best price, and the Fire TV Stick 4K Max for the customer who needs the best performance, extra storage, and the latest features.\n\nDon’t wait too long, though: with discounts this steep, stock is likely to run out fast.\n\nSee Fire TV Stick 4K at Amazon"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Sheena Vasani",
    "title": "The best Mother’s Day gifts you can still grab",
    "description": "Running out of time but still want to impress Mom this Mother’s Day? Don’t panic – there’s still time to grab a gift that ships fast and won’t scream “last-minute.” Whether you’re after something to make her life easier or something to help her unwind, we’ve …",
    "url": "https://www.theverge.com/tech/662298/best-mothers-day-gifts-last-minute-sale-deal",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/thevergelastminmothersdaygifts.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-07T21:38:17Z",
    "content": "Believe it or not, many of our favorite gadgets and gifts are not only on sale theyll also arrive in time for the holiday.\r\nBelieve it or not, many of our favorite gadgets and gifts are not only on s… [+5788 chars]",
    "full_content": "Running out of time but still want to impress Mom this Mother’s Day? Don’t panic – there’s still time to grab a gift that ships fast and won’t scream “last-minute.” Whether you’re after something to make her life easier or something to help her unwind, we’ve rounded up the best gadgets and goodies to do just that. Even better, most are on sale, so you can treat yourself to some savings, too."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Joe Tilleli",
    "title": "Beats Solo 4 Headphones Just Went From Full Price to Nearly Free, Thanks to Apple’s Massive Discount",
    "description": "Save 50% on the Beats Solo 4 wireless Bluetooth on-ear headphones over at Amazon.",
    "url": "https://gizmodo.com/beats-solo-4-headphones-just-went-from-full-price-to-nearly-free-thanks-to-apples-massive-discount-2000598254",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/BeatsSolo4SpatialAudio.jpg",
    "publishedAt": "2025-05-06T14:35:14Z",
    "content": "A solid pair of headphones will beat out earbuds any day. Beats is one of the bigger names on the market for headphones and for a good reason. Right now, you can save 50% on the Beats Solo 4 on-ear B… [+2132 chars]",
    "full_content": "A solid pair of headphones will beat out earbuds any day. Beats is one of the bigger names on the market for headphones and for a good reason. Right now, you can save 50% on the Beats Solo 4 on-ear Bluetooth headphones. That has brought them down to their lowest price of all time at just $100. $100 for a set of wireless headphones with high-quality sound is a pretty darn good deal, so hop on it before it’s too late and they go back up to $200.\n\nWhile these are stellar headphones, note that the Beats Solo 4 do not support active noise cancelling or transparency mode. These are super useful features, but they can really drive up the price of a pair of headphones. If those are important deal breakers for you, consider the Beats Studio Pro. If not, you’ll still be getting a super solid pair of Bluetooth on-ear headphones for just $100.\n\nSee at Amazon\n\nYou’ll get a full 50 hours of listening time on a single charge. If you ever catch yourself having forgot to charge it and you’re about to head out of the house for the day, no worries. The Beats Solo 4 support Fast Fuel charging which only requires 10 minutes of charging time to go from zero to five full hours of battery life.\n\nThe Beats Solo 4 are a comfortable wear. The ultralight yet durable construction means you’ll be able to keep them on all day without weighing your head down. The flex-grip headband, adjustable angled ear cups, and UltraPlush ear cushions ensure they will remain stable and comfortable on heads of all shapes and sizes.\n\nEasy to Connect\n\nWhether you have an iPhone or an Android, pairing to your devices is super easy. All you need to do is touch to pair. In no time, you’ll be able to enjoy all your favorite music, audiobooks, or podcasts. You can even use the built-in microphone to take calls or use your phone’s voice assistant. For high resolution lossless audio, you can connect over USB-C or the 3.5mm audio jack which I don’t care that it’s been nearly a whole decade—I’m still angry at the phone companies for removing this perfect port.\n\nThe Beats Solo 4 on-ear Bluetooth headphones comes in four different stylish colors. Choose between slate blue, cloud pink, black/gold, or matte black. All four options are on sale right now for a full 50% off. You can secure yourself your own pair for the reduced price of just $100—its lowest price ever.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Joe Tilleli",
    "title": "Amazon Offers Toshiba Smart 32-inch Smart Fire TV for Practically Free, With Alexa Voice Remote Included",
    "description": "Save 31% on the 32\" Toshiba Fire TV for a limited time at Amazon.",
    "url": "https://gizmodo.com/amazon-offers-toshiba-smart-32-inch-smart-fire-tv-for-practically-free-with-alexa-voice-remote-included-2000598789",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/FireTVToshiba.jpg",
    "publishedAt": "2025-05-07T14:55:33Z",
    "content": "Not every TV in your home needs to be state-of-the-art. We love a good 80+ inch TV in the living room where you entertain guests, have movie nights, or play games. But your bedroom may not need a $3,… [+2250 chars]",
    "full_content": "Not every TV in your home needs to be state-of-the-art. We love a good 80+ inch TV in the living room where you entertain guests, have movie nights, or play games. But your bedroom may not need a $3,000 display, and neither does your garage or kitchen. If you’re looking for a quick and easy way to watch something in a 32″ space, we’ll we have good news. This smart TV from Toshiba is down 31%, bringing it just under $100.\n\nSee at Amazon\n\nWhat More Can You Ask for When Spending Under $100 on a TV?\n\nLook. This isn’t a TV meant for viewing the Avatar sequel and getting the cinematic, theatrical experience right from your couch. This TV has it’s job and that is to be able to pull up movies, TV shows, and YouTube videos so you can view them in 1080p. This is the TV for second-screen activities. This is the TV for people who scroll through Instagram while watching reruns of Friends. This is the TV for folks who need background sound to fall asleep to.\n\nAs a smart TV, it has Amazon Fire TV built right into it. Stream your choice of millions of movies and TV show episodes and access tons of different apps like Hulu, Netflix, Max, and Disney+.\n\nWhile the on-board sound is decent, the Toshiba Fire TV supports HDMI Arc for anyone out there hoping to connect to a soundbar or AV receiver. I will continue to be one of the few dozens of us shouting from the rooftops that audio quality is more important than picture quality. Find yourself an inexpensive soundbar and you’ve got yourself a perfectly serviceable home entertainment center.\n\nBeing an Amazon Fire TV, one would expect the remote to support voice controls with Alexa. Well, one would be absolutely correct! Alexa makes it so simple to find the movie or TV show you’re looking for. What I really love is the Fire TV logs which streaming apps have the movie or show you just searched for available, so you don’t have to feverishly search through all your services to find what you want to watch. Just hold down the button and say Twins. Next thing you know, you’re hanging out with Danny DeVito and Arnold Schwarzenegger on your television screen for 107 minutes.\n\nApple AirPlay is also supported, so you can share your videos, pictures and more easily to your TV with the touch of a button. Or do what I mostly use it for which is finding a YouTube video on your phone to cast to the TV while eating lunch.\n\nRight now, you can grab this Toshiba 32″ television with Fire TV for just $90. That’s a 31% discount from it’s usual price of $130.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "Don’t Buy the New iPad From Apple’s Website, Amazon Is Offering a Shockingly Low Price Right Now",
    "description": "You won’t find any discounts on the 2025 iPad directly from Apple this year, but Amazon is offering a great deal.",
    "url": "https://gizmodo.com/dont-buy-the-new-ipad-from-apples-website-amazon-is-offering-a-shockingly-low-price-right-now-2000600738",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ipad-11-apple.jpg",
    "publishedAt": "2025-05-11T12:40:46Z",
    "content": "Apple is famous for its tight control over pricing, especially on new products. If a deal on a brand-new Apple product is what you’re looking for, you usually have to look beyond the official Apple S… [+1939 chars]",
    "full_content": "Apple is famous for its tight control over pricing, especially on new products. If a deal on a brand-new Apple product is what you’re looking for, you usually have to look beyond the official Apple Store.\n\nThis is why we think it’s really exceptional that the iPad 2025 is now discounted at Amazon: You can buy the newest 128GB Wi-Fi iPad for just $299, which is a full $50 off its $349 introduction price. Make sure you grab yours before it runs out of stock, as over 10,000 units have already been sold in the past few days.\n\nSee at Amazon\n\nPowerful iPad\n\nThe 11th-generation iPad has been introduced in March 2025 and it is a major leap in Apple’s affordable tablet line. Powering it is the A16 Bionic chip, it gives this iPad a huge performance and efficiency boost compared to the last generation. The A16 features a 5-core CPU, a 4-core GPU and 16-core Neural Engine, more than enough to handle intensive apps, multitasking and creative workflows. Paired with 6GB of RAM (and 128GB storage), the iPad 11 delivers a smooth user experience whether you’re streaming or gaming.\n\nThe screen is a standout in itself, and this is why iPads are so popular: an 11-inch Liquid Retina display with a 2360 x 1640 pixel resolution at 264 ppi with sharp images, deep color and excellent viewing angles. True Tone technology adjusts the color temperature of the display to your environment and 500 nits of brightness make the screen readable and clear even in direct sunlight.\n\nFor video calling or photography users, the iPad 11 has a 12MP rear camera with autofocus, Smart HDR 4, and 4K video recording and a 12MP front camera with Center Stage to keep you constantly in frame in video calls. Both cameras come with advanced features like cinematic video stabilization and extended dynamic range. You can use this iPad as a productivity and business tool super easily. With up to all-day battery life, you can count on the iPad 11 to get you through work or a vacation.\n\nApple’s reputation for rarely discounting its devices is true, and this Amazon deal is as one of the best opportunities to get the latest iPad at a reduced price.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "This Safe 16 Mph Electric Scooter Is 40% Off, As Amazon Clears Stock With No Markup",
    "description": "This electric scooter costs two to three times less than its competitors.",
    "url": "https://gizmodo.com/this-safe-16-mph-electric-scooter-is-40-off-as-amazon-clears-stock-with-no-markup-2000599500",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/volpam-scooter.jpg",
    "publishedAt": "2025-05-08T11:40:37Z",
    "content": "Summer is just around the corner, now is the perfect time to spend money on a fun, and eco-friendly means of getting around town. Amazon’s current sale of the Volpam electric scooter at an all-time l… [+2214 chars]",
    "full_content": "Summer is just around the corner, now is the perfect time to spend money on a fun, and eco-friendly means of getting around town. Amazon’s current sale of the Volpam electric scooter at an all-time low price of $179 makes the chance to try out a safe scooter. Despite its good safety ratings and strong customer reviews, Amazon is clearing out its stock at this record low price, a discount we’ve only seen once before (back in April). Otherwise, this scooter has consistently sold for $289.\n\nSee at Amazon\n\nFolds Into One Second\n\nThe Volpam scooter stands out for its balance of performance, portability, and safety, all at a budget-friendly price. It features a 350W powerful motor which achieves a maximum speed of 16 mph, which is way enough for commuting within the city or beach cruises. It’s high-torque, low-power motor ensures that you have the speed and efficiency without using up the battery prematurely.\n\nThis scooter offers a good battery which provides up to 12 miles of range on a single charge which is perfect for daily commutes, short runs or weekend trips. It charges quickly and easily and it needs only 4-5 hours to completely recharge. There’s a built-in cruise control feature which allows a hands-free ride where you can maintain a steady speed on longer distances without constant throttle tweaking.\n\nYou will also love how portable it is: with its quick fold system, the scooter folds into one second and can be stashed in your trunk or dragged aboard the bus. At close to 30 lbs, it’s light enough to carry anywhere, to the office, the park, or to a buddy’s house. The 8.5-inch solid tires are self-maintaining and durable enough for typical city roads so you don’t have to go through the bother and cost of repeatedly repairing tires.\n\nSafety hasn’t been overlooked either, and this is why it is so popular: The scooter features a dual braking system-EABS electronic braking and a rear drum brake-providing reliable stopping power even in sudden situations. Bright LED lights and a clear display ensure you’re visible at night and always aware of your speed, battery level, and other key stats.\n\nThe majority of the comparable-spec rivals are much more expensive, and this model’s balance of speed, range, and build quality is hard to surpass at this price. With Amazon having a clearance sale, this could be your last chance to get a well-rated, secure electric scooter at such a discount price.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Apple AirPods Alternative? Beats Studio Buds+ Are Now Going for Peanuts on Amazon",
    "description": "Need a new pair of earbuds? You can't go wrong with this pick from Beats, especially at this discounted price.",
    "url": "https://gizmodo.com/apple-airpods-alternative-beats-studio-buds-are-now-going-for-peanuts-on-amazon-2000599952",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/bbudsplus.jpg",
    "publishedAt": "2025-05-09T16:35:08Z",
    "content": "A great pair of earbuds can be hard to come by if you’re on a budget. While there are tons to choose from, they’re not all going to reflect the same quality as some of the bigger name brands out ther… [+1988 chars]",
    "full_content": "A great pair of earbuds can be hard to come by if you’re on a budget. While there are tons to choose from, they’re not all going to reflect the same quality as some of the bigger name brands out there. You can generally look to Beats for great audio, however, so when you find a pair on sale, it’s a good idea to snap them up when you can. It just so happens that now is one of those times where you’ll want to get a pair of Beats headphones since you finally can for a good price.\n\nHead to Amazon right now, where you’ll find the Beats Studio Buds+ for $100, down from their usual price of $170. That’s $70 off and a discount of 41%. They’re available in multiple colors for this price, so you can choose the one you like at the same discount.\n\nSee at Amazon\n\nBeats buds for the best bass and bumping in your ears\n\nThese are the upgraded version of the original Studio Buds, and they’ve become a fan favorite over time thanks to their sound quality and compatibility across both Apple and Android devices. They also feel super comfortable to wear, too.\n\nThe sound profile here is nicely balanced with punchy bass, clear vocals, and enough detail to make your playlists feel fresh. They also have active noise cancellation to block out distractions when you need to focus, and a transparency mode when you want to stay aware of your surroundings. Switching between the two is quick and easy.\n\nThere’s more than enough battery to go around to keep you listening for a while, too. You get up to 9 hours of listening time on the buds alone, and the included case brings the total up to 36 hours. A quick 5-minute charge gives you around an hour of playtime, which definitely comes in handy when you’re running out the door. Or you forgot to charge your earbuds, which is pretty common for us. Beyond all that, they’re rated IPX4, too, so sweat and light rain won’t be a problem. Good thing, because you’ll definitely want to wear these to the gym.\n\nYou can get these buds for just $100 (-41%), which is a fantastic price for everything that you get here. From getting to choose the color you want for this price to the absolutely fantastic sound quality, this is a deal you won’t want to pass up. Be sure you grab a pair while you can.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "This Roborock Q8 Max Delivers 3x the Power of Average Models, Now 60% Off on Amazon",
    "description": "The Roborock Q8 Max offers the best quality you can find, especially at this unbeatable price.",
    "url": "https://gizmodo.com/this-roborock-q8-max-delivers-3x-the-power-of-average-models-now-60-off-on-amazon-2000600499",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/roborock-q8max.jpg",
    "publishedAt": "2025-05-10T13:40:48Z",
    "content": "There’s a boom in popularity of robot vacuums on store shelves, and choosing the right one can be quite a challenge. Among experts, there’s near-unanimous welcome that Roborock is one of the best con… [+2682 chars]",
    "full_content": "There’s a boom in popularity of robot vacuums on store shelves, and choosing the right one can be quite a challenge. Among experts, there’s near-unanimous welcome that Roborock is one of the best contenders out there.\n\nRoborock’s “Q” series has particularly been well-praised for its value for money, and the latest Roborock Q8 Max carries on this tradition. Amazon is now offering this great version at its all-time lowest price of just $259, which is a massive 57% discount from its initial price tag of $599. It’s a great opportunity, and this is one of our favorite models. Now, almost all new Roborock vacuums are sold above $1,000 which makes this Q8 Max an even better deal.\n\nSee at Amazon\n\nVacuum and Mop\n\nRoborock Q8 Max has a great 5,500 Pa HyperForce suction system, which is triple that of a typical robot vacuum. It is capable of effortlessly scooping up dust, crumbs and even tough pet hair on carpets and hardwood floors with equal ease. The Q8 Max also has Roborock’s groundbreaking DuoRoller brush mechanism-two rubber rollers that rotate in opposite directions to pick up more dirt and prevent hair from becoming tangled as often by 20%.\n\nBut the Roborock Q8 Max is not just a vacuum: It mops and vacuums in one, complete with a 350ml water tank and 30 adjustable water flow levels to tackle everything from loose dust to embedded dirt. The mop part is merely removable so that you can switch between modes or use them sequentially on each other for a deeper clean. It has a large 770ml dustbin so you won’t be having to empty it nearly as often and the battery life is just as good: up to 240 minutes of usage on a single charge which is long enough to clean up to 300 square meters.\n\nRoborock is also very popular for its PreciSense LiDAR technology: it maps your home accurately and quickly getting familiarized with the layout and adapting cleaning routes for optimal efficiency. The robot can hold up to four independent floor plans so it’s perfect for multi-level homes-just place it on a new floor, and it’ll know where it is right away. The Q8 Max also uses advanced obstacle avoidance, sensing and avoiding chairs, cables, and even toys that would send less advanced robots stumbling. You can set no-go zones and virtual walls through the Roborock app so you have complete control over where and how it cleans.\n\nThe Roborock app itself is simple to use and feature-packed: You can schedule cleanings, customize settings, monitor the robot’s progress in real time, and even view a 3D map of your home. Voice control is also supported through Alexa, Google Home, and Siri. The Q8 Max is as hands-free as possible and automatically goes back to its base to charge and, in the case of the Q8 Max+ model, even emptying its own dustbin for complete autonomous use.\n\nIf you’re looking for a reliable and ultra performing robovac, this is the one you should go for.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Joe Tilleli",
    "title": "First Price Drop Comes Early, Beats Powerbeats Pro 2 Now at Its Lowest Yet on Amazon",
    "description": "Save 20% on the Beats Powerbeats Pro 2 wireless Bluetooth earbuds for a limited time.",
    "url": "https://gizmodo.com/first-price-drop-comes-early-beats-powerbeats-pro-2-now-at-its-lowest-yet-on-amazon-2000598237",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/BeatsPowerbeatsPro2.jpg",
    "publishedAt": "2025-05-06T12:20:11Z",
    "content": "Apple released an upgrade to the popular Beats Powerbeats Pro wireless Bluetooth earbuds just a few short months ago. Well, the Powerbeats Pro 2 are now seeing their very first discount and it’s subs… [+2677 chars]",
    "full_content": "Apple released an upgrade to the popular Beats Powerbeats Pro wireless Bluetooth earbuds just a few short months ago. Well, the Powerbeats Pro 2 are now seeing their very first discount and it’s substantial. Normally, these noise-cancelling in-ear headphones go for $250, but Apple has slashed 20% off the price tag. That brings it down to just $200, amounting to a savings of $50. If you want reliable performance, a comfortable fit, extended playtime, intuitive controls, and of course, quality sound, the Beats Powerbeats Pro 2 check all the boxes and you can save yourself some cash if your decide to purchase today at Amazon. Choose between four fun colors including quick sand, jet black, hyper purple, and electric orange.\n\nSee at Amazon\n\nExperience the freedom and convenience of Beats’ totally wireless Powerbeats Pro 2 earphones, meticulously designed to support your most intense workouts. These earphones are built with a reinforced structure, ensuring durability and resilience against the elements with sweat and water-resistant capabilities. Whether you’re pushing through a rigorous training session or braving the elements on a long run, the Powerbeats Pro 2 earphones are engineered to keep up with you.\n\nComfort and stability are paramount when it comes to earbuds, and the Powerbeats Pro 2 excel in both areas. The adjustable, secure-fit ear-hooks stay snugly in place, regardless of how intense your movements are. This personalized fit means you can focus on your activity without constantly readjusting your earphones. Furthermore, built-in controls on each earbud allow for seamless control over volume and skipping tracks. You can even use voice command adjustments. This intuitive control system ensures you have easy access to your music and calls without needing to reach for your device, keeping you in the zone.\n\nSee at Amazon\n\nImprovements Over the Powerbeats Pro\n\nWith the new model comes some fancy new features. For one, Apple has added a heart rate sensor in the earbud for monitoring during workouts. The Powerbeats Pro 2 now support fast pairing with both iOS and Android devices. The case is smaller and now supports USB-C and Qi charging. The earbuds themselves also now come in a more compact form factor.\n\nBattery life when including the playtime you get with the charging case delivers up to 45 hours of listening time before they need to be plugged in again.\n\nComfort and battery life would mean diddly squat without good sound quality. The Powerbeats Pro 2 earphones with help of Apple’s H2 chip deliver a powerful and balanced audio experience. With dynamic range and noise isolation, you can immerse yourself in your music, free from external distractions. Spatial Audio deliver a surround sound-like experience you can take with you anywhere, whether that’s in the gym or on the go. Get the newest Beats Powerbeats Pro 2 at its lowest price ever on Amazon.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Forget Anker, This HP USB-C Docking Station Marked Down Over 50% on Amazon",
    "description": "Save nearly $150 on an instrumental part of any work-from-home office layout with this discount.",
    "url": "https://gizmodo.com/forget-anker-this-hp-usb-c-docking-station-marked-down-over-50-on-amazon-2000599332",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/hpdock.jpg",
    "publishedAt": "2025-05-08T12:50:11Z",
    "content": "Weve all been there: tangled cords, a mess of adapters, and the daily scramble to connect your laptop to everything else on your desk before it’s time to clock in. If you work from home, your compute… [+2038 chars]",
    "full_content": "We’ve all been there: tangled cords, a mess of adapters, and the daily scramble to connect your laptop to everything else on your desk before it’s time to clock in. If you work from home, your computer setup can make or break your day. And if you’re unorganized, it can be a real time-wasting task to get everything together before you start your shift. That goes double if you use a work laptop. That’s where a good docking station comes in.\n\nRight now, you can get the HP USB-C Dock for just $120, down from its usual price of $259. That’s $139 off and a discount of 54%. It works with a wide variety of laptops, and it plugs into the wall so you have one central power point that you can plug everything in to.\n\nSee at Amazon\n\nOne dock to rule them all\n\nSince it just uses one USB-C cable, that means you can hook your laptop up to multiple devices at once. That list of items probably includes a keyboard and mouse, a headset, Ethernet cable, and USB storage and maybe even an additional monitor if you need two. That means you don’t have to plug everything in with an extension cord to another dock or use multiple outlets.\n\nThe dock itself is super clean and minimalistic, with a square-shaped design that makes it easy to tuck behind a monitor or sit neatly next to your laptop. It’s functional without being flashy, and that’s exactly what you want from a device that’s supposed to simplify things. You don’t want a huge hulking adapter taking up your entire desk.\n\nIt’s also good at keeping your laptop’s battery charged for you while you’re working since it has up to 100 watts of power deliver. That’s one less cord to worry about.\n\nIt works across a variety of operating systems too, including Windows, macOS, and Chrome OS, so it’s a flexible option whether you’re on a PC or using a MacBook. If you’re tired of cable chaos and want a smoother transition between mobile and desk setups, this little gadget might be the biggest game-changing addition to your setup you’ve had in some time.\n\nYou can simplify your home work setup for $120 (54% off). Sure, you’ll still have to be working (and no one wants to do that) but at the very least you can count on your setup to work great and be less cluttered, and that’s something we can all appreciate.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "Your New Guard Dog Is Here, The Blink Outdoor Camera Is 50% Off on Amazon",
    "description": "These cameras are simple to set up and operate, and they provide reliable protection against intruders.",
    "url": "https://gizmodo.com/your-new-guard-dog-is-here-the-blink-outdoor-camera-is-50-off-on-amazon-2000599539",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/11/blink-outdoor-new.jpg",
    "publishedAt": "2025-05-08T12:40:15Z",
    "content": "Summer is approaching and break-ins are on the rise: getting your home secure is even more important, especially if you’d like to enjoy your holidays with a clear mind. Right now, Amazon is offering … [+2167 chars]",
    "full_content": "Summer is approaching and break-ins are on the rise: getting your home secure is even more important, especially if you’d like to enjoy your holidays with a clear mind. Right now, Amazon is offering a massive 50% discount on the Blink Outdoor 4, its new wire-free smart security camera.\n\nWhether you just need a single camera (now $49 down from $99) or want to cover your entire property with a pack of five ($199 down from $399), these deals are on par with the cheapest prices that have surfaced on Prime Day or Black Friday, and you don’t need to be a Prime member to take advantage.\n\nSee Single Blink Cam at Amazon\n\nSee 5-pack at Amazon\n\nEasy to Install, Super Efficient\n\nThe Blink Outdoor 4 is notable for how easy it is to install and how strong its features are: This fourth-generation device is fully wireless and powered by two AA lithium batteries with a lifespan of up to two years so you can install it anywhere outside your house without having to find power outlets or change batteries on a regular basis. What’s more, the weather-resistant design of the camera allows it to work properly in rain, snow, or sunshine.\n\nVideo quality has made a quantum leap in this generation with 1080p HD quality and a super-wide 143-degree field of view so that you can capture more of your yard, driveway, or entrance. Enhanced low-light performance and infrared nighttime vision give you bright video clarity at night. The camera features improved motion detection and uses dual-zone sensors and AI-powered person detection (with a Blink subscription) to avoid unwanted alerts and notify you when someone is actually on your property.\n\nTwo-way audio lets you hear and speak with guests right from within the Blink app, home or away. It’s great for greeting guests, keeping intruders away, or talking with delivery personnel. With Alexa integration, there’s even more convenience: you can view live footage, receive motion alerts and arm or disarm your system with simple voice commands or using Echo Show devices.\n\nThe Blink Outdoor 4 is also flexible when it comes to storage: You can store video clips in the cloud with a free 30-day trial of the Blink Subscription Plan, or store the footage locally using the included Sync Module 2 and a USB drive. That way, you’re not locked into a subscription if you prefer your recordings stored offline.\n\nSee Single Blink Cam at Amazon\n\nSee 5-pack at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "This Huge 25,000mAh 145W Power Bank Is Nearly Free, Amazon Clears Stock Before Tariff Hike",
    "description": "This is one of the most premium brands and most powerful chargers on the market.",
    "url": "https://gizmodo.com/this-huge-25000mah-145w-power-bank-is-nearly-free-amazon-clears-stock-before-tariff-hike-2000600469",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ugreen-powerbank.jpg",
    "publishedAt": "2025-05-10T11:10:27Z",
    "content": "UGREEN is one of the top names in the portable charging world, side by side with Anker at the very top of the market. Both are famous for innovation and their products are the go-to option if you nee… [+2421 chars]",
    "full_content": "UGREEN is one of the top names in the portable charging world, side by side with Anker at the very top of the market. Both are famous for innovation and their products are the go-to option if you need to keep your devices charged while on the go.\n\nBut with tariffs looming that will have a major impact on the cost of electronics imported from Asia, there has never been a better time to purchase quality equipment while it is still available in the US at current prices. The UGREEN 25,000mAh 145W power bank is one of the most powerful and advanced options available today, and it’s currently on sale at Amazon for just $65, which is a full 34% discount from its usual $99 price and an all-time low price!\n\nSee at Amazon\n\nHuge Charging Speed, Massive Capacity\n\nWhat truly distinguishes this UGREEN power bank from all other devices on the market is 1) its incredible charging speed and 2) its capacity. With a total output of 145W and support for Power Delivery 3.1 and Quick Charge 3.0, this battery pack can fast-charge almost any device you can imagine.\n\nThe main USB-C1 port delivers up to 140W which can be used to charge a 16-inch MacBook Pro from dead to 56% in just 30 minutes. This is a game-changer for professionals and travelers who need to recharge laptops, tablets, or gaming devices like the Steam Deck in record time. The power bank features three output ports-two USB-C and one USB-A-making it easy to charge multiple devices at once, whether you’re topping up your phone, tablet, or even a drone.\n\nThe massive capacity of 25,000mAh (most of the competitors only offer 10,000mAh) means you can fully charge most laptops at least once, and smartphones up to five times before you have to recharge the power bank itself. Despite this huge capacity, the unit is still fairly compact, light-weighted and portable. It fits smoothly into a laptop bag or backpack and is perfect for traveling, business trips or long days away from wall sockets. Another feature is the smart digital display that shows how much battery percentage is left with a glance, which is quite cool and useful.\n\nCharging the power bank itself is fast and efficient, thanks to its two-way fast charging: Using a 65W PD charger (not included), you can top up the entire battery in just two hours which is extremely fast for a device of this size. The bi-directional charging also means that you can charge the power bank and your devices simultaneously.\n\nAs tariffs are set to raise prices on almost all electronics, this is maybe your last chance to grab one of the most powerful power banks out there at an all-time low price.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Anker Is Clearing Out Its Prime USB-C Charger at a Near-Free Price on Amazon",
    "description": "This compact Anker Powerhouse for charging multiple devices is for under $60.",
    "url": "https://gizmodo.com/anker-is-clearing-out-its-prime-usb-c-charger-at-a-near-free-price-on-amazon-2000600039",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ankerprime-1.jpg",
    "publishedAt": "2025-05-09T14:35:26Z",
    "content": "Have too many chargers littered around your desk? How about zero travel chargers when you actually need to take one with you? There’s an easy solution: buy an extra! You can get one for an absolutely… [+2083 chars]",
    "full_content": "If you’ve ever found yourself frustrated by the lack of ports on your laptop (whether you use a Mac or a PC), you’re not alone. The push in recent years toward thin devices has meant sacrificing necessary connectivity and you’re left with dongles or needing to unplug devices just to get through the day.\n\nBut there is a simple, game-changing solution: the Anker USB-C Hub 5-in-1. This compact device packs an impressive punch and offers all the ports you’re missing in a travel-friendly form factor. And right now, it’s available on Amazon at a record low price of just $19, down from $34 which is a massive 43% discount that makes it almost impossible to pass up.\n\nSee at Amazon\n\nYou Will Love It\n\nDon’t let its small size fool you: the Anker 332 USB-C Hub is a powerhouse of utility. With a single connection to your laptop’s USB-C port, you have instant access to five useful ports. You have a 4K HDMI port that allows you to connect to an external monitor or TV and present with ease, extend your desktop or watch movies in beautiful ultra-high definition.\n\nYou also have two USB-A 3.0 ports and one USB-C data port (both up to 5Gbps speeds) which allow you to move large files in seconds, sync your phone or connect peripherals like keyboards without giving up performance. And with a single 100W Power Delivery input, you can charge your laptop to capacity while working via the hub, courtesy of up to 85W of pass-through charging.\n\nSetting up the Anker hub is straightforward: You just have to plug it in, and it connects to both MacBooks and Windows laptops, Chromebooks, and any USB-C accepting device that supports DisplayPort Alt Mode and Power Delivery. No complex drivers and software installation are required. Despite its minimalist appearance, the hub is designed for heavy daily use and comes backed by Anker’s reliable 18-month warranty and customer support, offering peace of mind with every purchase.\n\nWhether you’re working from a coffee shop, traveling for business, or setting up a home office, the Anker USB-C Hub ensures you’re never left scrambling for adapters or unplugging devices. The current deal on Amazon has never been seen outside of major sales events, and now is the perfect time to solve your connectivity woes for good.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Gizmodo Deals",
    "title": "Amazon Is Slashing Prices on the Latest iPad 11, Now Cheaper Than the iPad From Two Generations Ago",
    "description": "This is the most recent but also the greatest value iPad available.",
    "url": "https://gizmodo.com/amazon-is-slashing-prices-on-the-latest-ipad-11-now-cheaper-than-the-ipad-from-two-generations-ago-2000599763",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/ipad-11-apple.jpg",
    "publishedAt": "2025-05-08T17:06:48Z",
    "content": "Apple has always been at the forefront of premium tablets, and we love the iPads for the smooth ecosystem, its advanced tech, and the great design. Released in March 2025, the new iPad 11th gen is (s… [+2599 chars]",
    "full_content": "Apple has always been at the forefront of premium tablets, and we love the iPads for the smooth ecosystem, its advanced tech, and the great design. Released in March 2025, the new iPad 11th gen is (surprisingly) already on sale at Amazon. It is not the case on Apple’s own website (or on other retail websites), so make sure you grab yours before it runs out of stock.\n\nAmazon is offering the 128GB Wi-Fi tablet at its all-time low price of $299, compared to its original release price of $349. This $50 discount is notable in that it not only gets the latest iPad cheaper but it is cheaper than some models previously sold but still available elsewhere. Fun fact, the new MacBook Air M4, released at the same time as the iPad 11th gen, is also on sale exclusively at Amazon!\n\nSee at Amazon\n\nRemember: Apple doesn’t like discounts, this is an opportunity you shouldn’t miss.\n\nLimited Time Deal, Hurry Up\n\nThe 11th-generation iPad is full of features that separate it from others: At the heart is Apple’s speedy A16 Bionic chip which is the same processor the iPhone 14 Pro lineup has. This chip delivers a huge performance increase for a tablet and enables effortless multitasking, lightning-fast app launch and amazing graphics for games and creative activities. With 6GB of RAM, the iPad 11th generation is more responsive than ever before, handling demanding apps, video editing, and immersive games with ease.\n\nThe device’s 11-inch Liquid Retina display is another highlight and you’ll absolutely enjoy the vibrant colors, sharp details and a comfortable viewing experience in any lighting thanks to True Tone technology. Whether you’re streaming movies or editing photos, the display’s 2360-by-1640 resolution and 500 nits of brightness ensure everything looks stunning.\n\nStorage options start at a generous 128GB (which is the case for the cheapest version currently on sale) and provides good space for apps, photos, videos and documents (you can always use one of the best cloud storage services on top). The iPad supports Wi-Fi 6 for a high-speed internet connection. The front and rear cameras are both 12MP with the front camera featuring Center Stage for active video calls that keep you perfectly framed.\n\nBattery life is another strong point of this latest tablet: this iPad is delivering all-day performance so you can work, play or create without constantly searching for a charger. Available in four stylish colors-silver, blue, pink, and yellow (the pink version is already out of stock on Amazon), the 11th-generation iPad offers something for everyone.\n\nWhat really makes this deal stand out is its synergy of exclusivity, new capabilities, and unmatchable price: Amazon is the sole location offering a discount on the 11th-generation iPad, and at $299, it’s the lowest ever price for this model.\n\nSee at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Brittany Vincent",
    "title": "Amazon Is Clearing Out the Apple Watch SE (2nd Gen) at Black Friday Prices, Perfect for a Mother’s Day Tech Gift",
    "description": "What time is it? Time to join the smartwatch gang with an Apple Watch SE for under $200.",
    "url": "https://gizmodo.com/amazon-is-clearing-out-the-apple-watch-se-2nd-gen-at-black-friday-prices-perfect-for-a-mothers-day-tech-gift-2000599312",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/awatchse-1.jpg",
    "publishedAt": "2025-05-08T14:55:08Z",
    "content": "If youve been waiting for the right time to upgrade your smartwatch, or maybe get one for the first time, it’s always a good time to wait for a deal. They’re always going on sale, and you shouldn’t h… [+2056 chars]",
    "full_content": "If you’ve been waiting for the right time to upgrade your smartwatch, or maybe get one for the first time, it’s always a good time to wait for a deal. They’re always going on sale, and you shouldn’t have to spend full price for one since so many start being much more affordable after a period of time. And this Amazon deal might be the one that can help you make up your mind.\n\nRight now, you can head to Amazon to get the Apple Watch SE (2nd Gen) for just $169, down from its usual price of $249. That’s $80 off and a discount of 32%. This discount applies to the Starlight Aluminum Case model with Starlight Sport Band.\n\nSee at Amazon\n\nYour go-to premium smartwatch at a low price\n\nThis may not be the newest, latest and greatest Apple Watch, but it does everything you could possible need it to. It tracks your health, keeps you connected, and adds little conveniences that, once you get used to them, are hard to live without. Whether you’re trying to be more active, want to manage notifications without checking your phone constantly, or just want a device that can help keep you safe in an emergency, this watch is a keeper.\n\nAnd just because it’s older, that doesn’t mean it’s a slouch in any way. Apps launch quicker, navigation feels smoother, and Siri now works on-device, so it’s snappier and more private when you compare it to the older Apple Watch SE model. One of the newest features is the double-tap gesture, which lets you control the watch without even touching the screen, too. You’ll love that if you happen to use your hands a lot.\n\nSee at Amazon\n\nThe always-on Retina display is brighter than before, too. And you still get all the health features Apple is known for. That includes heart rate tracking, sleep monitoring, crash detection, and more.. It’s also swim-proof and built for wearing every day, so you can take it just about anywhere.\n\nThis premium smartwatch is an absolute steal at just $169. For less than $200, you get this supreme multitasker that’s better than the previous model in every way. It can tell time, use apps, help you track your fitness journey, health, and other aspects of your day with you having to do much of anything at all. So be sure to get yours while it’s still in stock. You’ll want to keep it with you at all times, we imagine.\n\nSee at Amazon"
  }
]