[
  {
    "source": {
      "id": null,
      "name": "Parade"
    },
    "author": "Emily Laurence",
    "title": "I'm a Gastroenterologist, and This Is My Go-To Order When I Eat Out",
    "description": "Gut-healthy? Check. Delicious? Double check.",
    "url": "https://parade.com/health/gastroenterologist-go-to-order-when-eating-out",
    "urlToImage": "https://media.zenfs.com/en/parade_250/56d5a1fef513c4c1d372821c4a2bfb8a",
    "publishedAt": "2025-05-11T22:25:00Z",
    "content": "When you cook at home, you have complete control over the ingredients. You can make your meal as nutrient-rich as you want and avoid anything you know wont sit well with you. When you eat out, knowin… [+4814 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "wired",
      "name": "Wired"
    },
    "author": "Ryan Waniata",
    "title": "JBL Tour One M3 Review: Great Noise-Canceling Headphones",
    "description": "JBL’s top wireless headphones match powerful noise canceling with tons of extras.",
    "url": "https://www.wired.com/review/jbl-tour-one-m3-smart-tx/",
    "urlToImage": "https://media.wired.com/photos/681bdc8ea222c2c7fe36f1da/191:100/w_1280,c_limit/JBL-Tour-One-M3-Headphones_052025_Lede.jpg",
    "publishedAt": "2025-05-08T12:03:00Z",
    "content": "There are plenty of sonic-friendly features, including a volume limiter to keep your hearing safe, Smart Talk to pause sound when you speak, and personalized listening with a built-in hearing test. S… [+1867 chars]",
    "full_content": "One of the coolest developments in modern portable audio is just how good noise canceling has gotten. Bose’s latest QuietComfort headphones are still the clear leaders, but a raft of rivals, from Sony’s WH-1000XM5 (9/10, WIRED Recommends) to the Sonos Ace (8/10, WIRED Recommends), provide similarly excellent performance and distinctive functionality. Count JBL’s new Tour One M3 headphones among that group, providing powerful sonic solitude in a loaded package that’s all JBL.\n\nPhotograph: Ryan Waniata\n\nThere aren’t many features these unassuming headphones lack, which is a good thing considering the price. The most notable new addition is a tagalong transmitter that mimics the touchscreen cases in JBL earbuds like the Tour Pro 3. The little touchscreen block acts as a spare controller and, more intriguingly, transmits audio from virtually any plug-in source to compatible wireless devices over the new Auracast Bluetooth system.\n\nJust where you find Auracast-ready devices outside JBL is a fair question, given that JBL is among the first and most fervent adopters. You’re paying a premium for that privilege, which may not appeal to non-frequent fliers, but the Tour One M3’s other wiles, from clear and snazzy sound to a ridiculously comfy fit and sterling call quality, make them a worthy new option.\n\nLaidback Comfort\n\nPhotograph: Ryan Waniata\n\nI loved the Tour One M3’s case from the moment I opened the box. It’s compact and stylish, shaped like a giant guitar pick, and the tactile exterior looks and feels good. I was less enamored with the headphones at first. While I wasn't able to test the Tour One M2, the M3 look almost identical, and my first impression was that they seemed eerily close to Soundcore’s $80 Life Q30.\n\nUpon further investigation, the JBL pair feels significantly more robust and scratch-resistant. They don’t have the same premium polish as Bose’s fancy QuietComfort Ultra (9/10, WIRED Recommends), but they mostly look the part, and the blue and gold versions provide some added style points. Most importantly, these are among the comfiest travel headphones I’ve worn, providing multiple days of listening without a single pain point. That’s all the more handy since they offer an impressive 40 hours of battery life with noise canceling (less over LDAC), or up to 70 hours without it, letting me tune out for a week of evaluation without charging."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Lauren Feiner",
    "title": "Instagram CEO testifies about competing with TikTok: ‘You’re either growing, or you’re slowly dying’",
    "description": "When Adam Mosseri took over Meta-owned Instagram as CEO in 2018, the app was experiencing what he'd later call \"concerning\" drops and plateaus in user engagement, thanks partly to fierce competition from a new app: TikTok. Instagram estimated in 2019 that 23 …",
    "url": "https://www.theverge.com/antitrust/663894/instagram-ceo-adam-mosseri-ftc-meta-antitrust-trial",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/STKS507_FTCxMETA_ANTITRUST_CVIRGINIA_4_A.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-08T22:00:30Z",
    "content": "Adam Mosseri says Meta got a reality check when TikTok gained steam.\r\nAdam Mosseri says Meta got a reality check when TikTok gained steam.\r\nWhen Adam Mosseri took over Meta-owned Instagram as CEO in … [+4707 chars]",
    "full_content": "When Adam Mosseri took over Meta-owned Instagram as CEO in 2018, the app was experiencing what he’d later call “concerning” drops and plateaus in user engagement, thanks partly to fierce competition from a new app: TikTok. Instagram estimated in 2019 that 23 percent of the decline in time spent on Instagram in the US was due to TikTok. ByteDance’s video app kept expanding through the onset of the covid-19 pandemic. “We can’t explain it all, but what’s clear at this point is that we need to adapt, and do so quickly,” Mosseri wrote to his team in March 2020. Instagram needed to recover, he testified Thursday in a DC courtroom, because “you’re either growing, or you’re slowly dying.”\n\nMosseri described the dire situation while testifying in the Federal Trade Commission’s antitrust trial against Meta, where the government alleges the company illegally monopolized the market for personal social networking services, a category that it says includes Snapchat but not more entertainment-focused apps like YouTube or TikTok. Mosseri’s testimony highlighted how much Instagram sees itself as in competition with TikTok, but it also showed that even as entertainment content becomes a larger portion of its offerings, connecting with friends is still a central part of its service — meaning it may still be a relevant market for the court to find it monopolizes.\n\nSince his March 2020 warning, Instagram has seen more success, thanks in part to improved AI recommendations for Reels. But TikTok still represents “the fiercest competition that we have faced.” As Instagram has sought to compete more effectively with TikTok in building out Reels, TikTok has become more similar to Instagram, Mosseri testified. While he used to consider TikTok a more “lean-back experience,” where users passively watch videos, he now sees it as “every bit as participatory as we are at this point.” TikTok is actively trying to engage users’ connections with their friends, he testified, noting it’s rolled out a feed to watch friends’ videos. (A TikTok executive testified earlier in the trial that only 1 percent of videos watched on the platform are through that tab.)\n\nMeta has emphasized throughout the trial that connecting with friends and family has become a smaller part of its business in the face of competitive pressures. But Mosseri’s testimony highlighted that helping users engage with their friends is still a core use case for Instagram today, and a way it sees itself being differentiated from rivals. Mosseri said in a 2024 video on his own Instagram account that the reason the app wouldn’t expand into long-form video was because it wasn’t as conducive to sharing with friends. “I still think friends are an important part of the experience,” he testified, though he also shared that as the app has grown overall, “the percentage of the app spent on friend content has gone down.”\n\n“Instagram will always need to focus on friends,” Zuckerberg wrote in a 2018 email to Mosseri. Even as it grows to include more entertainment, he added, it “can never exclusively be for public figures or it will cease to be a social product.”\n\nMosseri also bridged the gap between earlier testimony from Zuckerberg, who testified about all the ways Facebook helped Instagram grow, and Instagram cofounder and former CEO Kevin Systrom, who testified that eventually, Zuckerberg pulled back resources from Instagram in favor of Facebook. Mosseri took over as CEO when Systrom left in 2018, and he gave a third perspective on the key question of whether Meta helped grow Instagram in ways it couldn’t have otherwise, or whether it bought it to squash a nascent competitor and later deprive it of resources.\n\nMosseri came over to Instagram from a role at Meta, so he was familiar with the cultures and gripes in both organizations. “As a new member of the Instagram team and a previous member of the Facebook team, I sat right in the middle of it,” he testified. Mosseri observed that in some ways, Instagram had “drifted culturally a bit too far apart in my opinion. We used to refer to Instagram as its own company, and it’s not.” He could see why Instagram’s founders were upset with some of the changes Facebook made to reduce promotion of Instagram from Facebook, but he saw both sides. “I disagreed with some of the changes personally, but I also thought they were being made more of than they needed to be.”\n\nUltimately, Mosseri testified, Facebook’s decision to buy Instagram could go down as ​​“one of the best acquisitions of all time.” Instagram got to access Facebook’s resources and experience, and Facebook got to access the Instagram founders’ unique talent for coming up with innovative products — something Meta would need to stay ahead of competition in years to come. Both companies, he said, “benefited greatly.”"
  },
  {
    "source": {
      "id": null,
      "name": "NPR"
    },
    "author": "Jon Hamilton",
    "title": "Chimps' rhythmic drumming and complex calls hint at origins of human language",
    "description": "Two studies of wild chimps point to the evolutionary roots of human language. The studies found that chimp communication often relies on rhythmic structures and call combinations.",
    "url": "https://www.npr.org/2025/05/12/g-s1-65840/chimpanzee-rhythms-calls-origins-language-human",
    "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/467x263+0+207/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1b%2Fc4%2F564bd2ca40fa9acb8d9e956e74eb%2Flow-res-dsc042332.jpeg",
    "publishedAt": "2025-05-12T10:00:00Z",
    "content": "Researchers have found two important building blocks of human speech in wild chimpanzees, one of our closest relatives.\r\nA pair of studies finds that chimp communication includes both rhythmic struct… [+4641 chars]",
    "full_content": "Chimps' rhythmic drumming and complex calls hint at origins of human language\n\ntoggle caption Liran Samuni/Taï Chimpanzee Project\n\nResearchers have found two important building blocks of human speech in wild chimpanzees, one of our closest relatives.\n\nA pair of studies finds that chimp communication includes both rhythmic structures and call combinations , two key elements of spoken language.\n\nTaken together, the studies add to an emerging \"early footprint\" indicating how human language may have evolved, says Catherine Crockford , an author of one of the studies and a research director at the French National Centre for Scientific Research in Lyon.\n\nThe chimp findings also bolster research on communication in other primates, including orangutans and bonobos .\n\nSponsor Message\n\nHowever, studies like these are increasingly hard to carry out, researchers say, as wild chimpanzee populations are depleted by hunting, the pet trade, and habitat destruction.\n\nDrum beats with meaning\n\nThe study of rhythmic structures, which appears in the journal Current Biology, analyzed the drumming patterns of chimps from the rainforests in East and West Africa.\n\nThe trees in those rainforests often have large buttress roots extending from the trunk that make \"fantastic resonant drumming surfaces,\" says Cat Hobaiter , an author of the study and a professor at the University of St. Andrews in Scotland.\n\nAdult chimpanzees often drum with their feet, Hobaiter says, \"so they're using their hands to hold on to those roots and then they're kind of dancing.\"\n\nChimps use drumming to communicate over long distances. The message may indicate what direction a particular chimp is traveling, or just be a social check-in.\n\n\"They have their own individual signatures,\" Hobaiter says, \"so I know if I hear a drum, that's Frank or that's Fred.\"\n\nHobaiter was part of a team that analyzed hundreds of recorded drumming episodes from several different chimp communities. She says the analysis confirmed what field scientists had long suspected.\n\n\"Not only do chimpanzees have rhythmic structure in their drumming, but different populations of chimpanzees use different structures,\" Hobaiter says, a bit like a regional accent or dialect.\n\nThat suggests the rhythms are learned and under the control of the drummer — both important attributes of the rhythms that are integral to human language.\n\nThe results also suggest that rhythmic structures were already around when the first humans appeared more than 1 million years ago.\n\nAnd Hobaiter says rhythm isn't just for music and dance.\n\n\"It's present in the back-and-forth of a conversation, in the timing of a slow country drawl or a fast-talking city accent,\" she says. \"So rhythm is something that's really present in lots of aspects of our social behavior.\"\n\nSponsor Message\n\nCombining calls to create new meanings\n\nSpoken language also combines a finite number of vocal sounds in ways that allow for an unlimited number of meanings.\n\nSo Crockford and a team of researchers studied the call combinations used by 53 wild chimps in Côte d'Ivoire.\n\nThe team would begin observing the chimps each day at dawn and stay until evening, recording \"everything they do, every activity change, every social interaction, every vocalization,\" Crockford says.\n\nThis allowed the team to know the context for the more-than-4,000 utterances they analyzed.\n\nThe utterances included a dozen distinct calls. Sometimes the calls were used on their own and sometimes in combinations. The analysis focused on two-call combinations, known as bigrams.\n\n\"What we found then is that there is some shift in meaning when these single calls are embedded into these bigrams — and that the meaning can change in several ways,\" Crockford says.\n\nFor example, a \"hoo\" call on its own often means a chimp is resting, while a \"pant\" call on its own usually means a chimp is playing.\n\nBut when the two calls are combined, it is likely to mean that a chimp is building a nest.\n\nPrevious research has found this use of call combinations to alter meaning, but only when it involved sounding an alarm about something dangerous, like a snake.\n\nSome linguists and other scientists have been quick to point out that chimpanzee communication is far less flexible and complicated than human language.\n\nCrockford agrees, saying that the evidence so far does not justify equating chimp calls with human words and sentences.\n\nNonetheless, humans and chimps may share one common motivation for communicating: gossip.\n\nA chimp often can't see first-hand what's going on with other members of the troop. So Crockford says they may need to ask around to find out: Have they had a shift in status? Have they fallen out with somebody?\n\nCrockford says it makes sense that chimps also have many other uses in daily life for their ability to combine calls.\n\n\"It probably didn't evolve just because once in a while we saw a predator,\" she says. \"It probably evolved because we need to somehow navigate our social world.\""
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "David Nield",
    "title": "Your email inbox isn’t just an annoyance—it’s a privacy risk",
    "description": "We understandably avoid our overflowing our email inbox, in favor of getting on with something else more fun, but there are very good privacy reasons to want to tackle this pile of digital detritus—and there are powerful tools to help.Delete old accounts, pro…",
    "url": "https://gizmodo.com/your-email-inbox-isnt-just-an-annoyance-its-a-privacy-risk-2000598016",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/Mailbox-1-1.jpg",
    "publishedAt": "2025-05-08T12:39:58Z",
    "content": "For most of us, taking a long, hard look at our inbox isn’t fun: Typically, the digital clutter and spam email is piled high, while anything useful and informative often gets lost in the deluge. Gett… [+7492 chars]",
    "full_content": "For most of us, taking a long, hard look at our inbox isn’t fun: Typically, the digital clutter and spam email is piled high, while anything useful and informative often gets lost in the deluge. Getting to inbox zero seems like an impossible task, so we close down our email apps again, only to find the situation is even worse the next time they’re opened.\n\nWe understandably avoid our overflowing inboxes, in favor of getting on with something else far more fun, but there are very good privacy reasons to want to tackle this pile of digital detritus—and there are powerful tools to help, as well (more on this shortly).\n\nCheck out at Yorba\n\nThink about the emails attached to old accounts that you leave neglected but open—each account is a way for bad actors to get at you and your data. Maybe the account uses a simple password that’s easy to guess, or the app involved has been taken over by an organization with shady intentions, or the service itself has long since gone out of business and some enterprising hackers have grabbed its unguarded databases.\n\nWith all of these scenarios and more, you’re at risk. Once a hacker gets into one of your accounts, it’s easier to move on to the others, whether that’s because of a trusted connection you’ve established, or because there are key pieces of information (payment details, postal addresses) inside the exposed account.\n\nIf you’re not properly sorting through your inbox and closing down these accounts, then you might well be missing warnings that hackers breached your security. Ideally, you want to be shuttering digital accounts as soon as you’re done with them—then there’s nothing for anyone else to access.\n\nYou’ve got another reason to stay on top of your inbox: subscription fees. Almost anything digital now comes with a subscription attached, from music streamers to online publications to AI bots, and if you’re not keeping a close eye on your inbox (and your bank account), then you might end up paying a substantial amount each month for software and services you’re not actually using.\n\nWe promised tools to help further up though, and you’re not alone in attempting to clean up your digital footprint.\n\nEnter Yorba, an online tool for people who want an easier way to manage their accounts, subscriptions, and inbox. It’s like a spring cleaning service for your email and your wider digital life, not only cutting down on the volume of messages for a clean inbox, but also tidying up what those messages are linked to.\n\nWith a simple dashboard that helps you organize your online life, Yorba makes it easy to cancel subscriptions, delete old accounts, and stop getting unwanted emails so you can avoid surprise charges and feel in control of your digital footprint. It works across the US, Canada, and the EU, so millions of people can use it.\n\nYou can try all of this out for free, including weekly insight reports and smart suggestions about what needs cleaning up. With a Premium account, yours for $72 a year, you get more active monitoring tools and easier subscription canceling (and Yorba is thankfully ad-free too).\n\nNot convinced yet? Yorba has some heavyweight backing too. This company is part of the Santander X 100 global community for its innovative proposal. This international community includes the most outstanding companies of Santander X, Banco Santander’s global entrepreneurship initiative, which supports SMEs, startups, scaleups and entrepreneurial projects with training programmes, online courses, benefits and discounts, exclusive events, challenges and prizes, a community of experts and a personalised financial offer.\n\nHow to use Yorba\n\nMuch of what Yorba offers is free to access: You might find you never need the advanced features that cost money, but you can definitely try out most of what’s available and decide how useful it is before parting with your cash. You can sign up with your Google account, your Microsoft account, or with an email address and password.\n\nYorba nicely automates the setup process. Point it towards your inbox, and it’ll scan through vast swathes of email faster than you could ever hope to, picking out mailing lists you’re subscribed to, digital accounts you’re still connected to, ongoing subscriptions that remain active, and data breaches where your email address is mentioned.\n\nWith Google and Microsoft email accounts, Yorba is able to dig deeper, helping you to find old accounts and track subscriptions that you may or may not still need. The main dashboard screen does a great job of giving you a better idea about your digital footprint. It’s a bit like looking at the screen time stats for your phone: Perhaps you haven’t realized quite how bad the problem has got, but Yorba will tell you.\n\nCheck out at Yorba\n\nWhen it comes to mailing lists, for example, they’re split up into categories like technology, shopping, and causes. You can see how often you open up newsletters, how many mailing list messages you’re getting every month, and then either unsubscribe from emails or keep on the list with a click.\n\nFor the data breaches, you get a similar level of detail. You can see which email addresses were exposed and when, and get quick links to delete your account or update your login credentials and passwords.\n\nWhen it comes to your logins and how to delete account information, Yorba makes this straightforward as well. Each login also comes with a privacy grade, and you can see what arer the risks of your information being misused and or sold by the company. For any account you want to get rid of, there’s a Delete Account button that opens detailed instructions and direct delation links .\n\nThe subscriptions tracking feature is something you have to pay for, but you’re likely to save a lot of money if you make use of it. Based on the tool’s analysis of your inbox, you can see how much is going out, and to which companies, and in which order. Anything you’re not using can be spotted pretty quickly.\n\nIf you’ve never undertaken this kind of inbox cleanup before, it can be quite eye-opening just how much stuff you’ve actually signed up to—everything from digital publications to job listing sites to music newsletters, in my case. But even if Yorba uncovers lots to tackle, its interface never feels overwhelming.\n\nIn fact, the service does a fine job of aggregating information across multiple inboxes so you can work through the tidying up process methodically. You don’t have to tackle it all at once either: Yorba always keeps track of your progress, so you can chip away at it slowly.\n\nSomething else I liked from using the service was the way you can set yourself goals, almost like using a fitness or meditation app. You get to see how many actions you’ve taken on your inbox and how far you’ve gone in reducing the clutter and protecting your privacy—which then motivates you to do more.\n\nThere’s a decent level of customization here as well, so you can tailor Yorba in terms of what you’re aiming for and what you want to be notified about. You’ve got nothing to lose by letting the service quickly scan through your email and see what needs fixing—and Yorba won’t be as daunted as you might be by the inbox chaos.\n\nCheck out at Yorba\n\nIn a digital world where your inbox can quietly become a serious privacy liability, Yorba offers a smart, accessible way to regain control, cut through the noise, and protect what matters most-your personal data!"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Cheryl Eddy",
    "title": "This X-Files Episode Is Still One of the Scariest Office Horror Stories",
    "description": "'Folie à Deux,' season five's penultimate episode, first aired May 10, 1998.",
    "url": "https://gizmodo.com/this-x-files-episode-is-still-one-of-the-scariest-office-horror-stories-2000598865",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/X-Files_mulder_hostage.jpg",
    "publishedAt": "2025-05-09T17:00:47Z",
    "content": "Late in The X-Files‘ fifth seasonjust a few weeks before the first X-Files feature film hit theatersviewers were plunged into the terrifying madness of “Folie à Deux.” A weary Agent Fox Mulder (David… [+6018 chars]",
    "full_content": "Late in The X-Files‘ fifth season—just a few weeks before the first X-Files feature film hit theaters—viewers were plunged into the terrifying madness of “Folie à Deux.” A weary Agent Fox Mulder (David Duchovny) trudges to Chicago to check out the latest “monster of the week,” but his head snaps back into the game when he realizes the monster in question just might be targeting him next.\n\nBefore it flips its approach to put Mulder in its crosshairs, “Folie à Deux”—directed by X-Files regular Kim Manners, and written by future Breaking Bad and Better Call Saul creator Vince Gilligan—introduces us to Gary Lambert (Caprica‘s Brian Markinson), a rather ordinary guy working a soul-sucking telemarking job for a vinyl siding company. The calls cycle constantly as Gary reads from a precise script and endures nagging instructions to “dial and smile,” all the better to hook new customers.\n\nIt’s dull and stressful but not exactly toxic—until Gary senses an alarming presence lurking in the office: a giant insect-like creature, masquerading as his boss and turning his co-workers into remote-controlled zombies. It scares him enough to audio-tape a warning about a monster stalking VinylRight employees, which is why the FBI’s resident spooky kids Mulder and Scully (Gillian Anderson) get handed the case.\n\nBut there’s tension in the FBI office too. Mulder and his own boss, FBI Assistant Director Skinner (Mitch Pileggi), are enduring a surly patch in their relationship—not for the first or last time. Mulder’s annoyed the Bureau sees him as “monster boy” (to be fair, there’s a solid reason for that), and tells Scully he can handle this “jerk-off assignment” by himself. But once he flounces off to Chicago, he realizes there’s more to this case than he realized, and he does actually need her help.\n\nMeanwhile, Gary’s reaching his breaking point as he observes his co-workers systematically transforming into dead-eyed automatons. It’s all the paranoia of Invasion of the Body Snatchers, down to Gary being the only person who realizes what’s going on.\n\nEven the audience can’t tell if what Gary sees is real or the result of a very troubled mind… until Gary takes the entire office hostage, including a visiting Mulder. In the chaos Mulder realizes he can also see that Gary’s boss is, in fact, actually a giant insect hellbent on assembling an army of human drones.\n\nThere’s a certain amount of metaphor at play here, as Gary—who ends up being shot to death in the standoff after killing an “infected” co-worker—rails against a creature who “wants to take away who we are and control us.” It could be a supernatural menace; it could be capitalism. Actual human telemarketers have been largely replaced by robo-calls these days, but in 1998 when the episode aired, everyone still had a land line and generally picked up when the phone rang. In a room crammed with cubicles full of people all reading the same pitch over and over, you can see how “dead-eyed automatons” isn’t too far of a leap.\n\nBut this is The X-Files, so something eerie always has to creep in. Even Mulder is skeptical about Gary’s claims at first, but any doubts evaporate once he catches a glimpse of the monster himself. “I saw it too,” he confesses to Scully. She wonders if it’s perhaps a folie à deux, meaning that Mulder was so affected by the experience of being held hostage that he’s now sharing Gary’s delusions.\n\nBut Mulder’s inclined to point to a larger conspiracy. Maybe Gary’s boss, the otherwise unmemorable Greg Pincus (John Apicella), is actually a manifestation of evil capable of using camouflaging mind tricks to conceal its presence?\n\nTurns out there’s some history to back up this admittedly wild-sounding notion. Gary’s audio warning to VinylRight evoked the phrase “hiding in the light,” something that’s popped up in similar X-Files from the past. With some digging, Mulder realizes Pincus has a geographical connection to many of the past incidents.\n\nTrue to form, Scully doesn’t immediately agree with Mulder; what’s more, she’s not keen on the idea of legitimizing Gary’s crazy-guy talk, especially since he murdered a guy on the way out. But Mulder is unusually sincere here. He even begs Scully to believe him, since she’s his “one in five billion”—the rare person who actually understands where he’s coming from. But it takes an irregular autopsy for Scully to realize that Mulder is right, and something extremely weird is indeed happening.\n\nAlong with this, an increasingly furious Skinner wonders if this will be the case that finally sees Mulder booted from the FBI into a padded room—and Mulder does end up strapped down to a hospital bed at one point, frantically shrieking at the nurse to set him free so he can protect himself from the zombie-creating critter.\n\nBy season five, X-Files fans had come to appreciate Mulder’s extremely open-minded way of looking at the unexplained. But it’s not that far-fetched to imagine that after years of not being believed, and years of witnessing some of the most bizarre discoveries in the history of the FBI, his own mental health would suffer. Maybe even start to crack?\n\nIt takes Scully’s intervention to admit that while she can’t explain exactly what happened, there’s enough concrete evidence surrounding the case to confirm that Mulder hasn’t gone full cuckoo. Skinner admits “I’m at a bit of a loss here,” but despite his frustration with Mulder—which spirals into a physical fight at one point in the episode—he’s fair enough to accept Scully’s judgment as rational and reasonable.\n\nAt the end of the story, with a still-perplexed Scully suggesting maybe she and Mulder are the ones experiencing the folie à deux, we see a new call center, packed with anxious employees trying to “dial and smile” without losing their minds. Except, of course, there’s a classic X-Files button to push, as one very unlucky man suddenly catches sight of what looks like a giant, freaky insect scuttling around the office.\n\nThe X-Files is streaming on Hulu."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Justin Carter",
    "title": "Avengers: Age of Ultron Anniversary Vid Reminds You It Exists",
    "description": "Marvel didn't really give Age of Ultron any flowers for its 10th anniversary, probably because it's both unncessary and strangely vital to the MCU.",
    "url": "https://gizmodo.com/avengers-age-of-ultron-anniversary-vid-reminds-you-it-exists-2000600544",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/age-of-ultron.jpg",
    "publishedAt": "2025-05-10T18:50:33Z",
    "content": "Did you know Avengers: Age of Ultron had its 10th birthday last week? The occasion got overshadowed by the release of Thunderbolts*sorry, New Avengersbut it’s now a decade old, and Marvel’s got an an… [+3150 chars]",
    "full_content": "Did you know Avengers: Age of Ultron had its 10th birthday last week? The occasion got overshadowed by the release of Thunderbolts*—sorry, New Avengers—but it’s now a decade old, and Marvel’s got an anniversary video to celebrate.\n\nThe five-minute compilation runs through a handful of the film’s key moments, including the team trying to lift Thor’s hammer, Thor birthing the Vision, and Tony using the Hulkbuster armor to bring down a mind-controlled Banner. It isn’t so much a highlight reel as it is a collection of fairly popular scenes meant to show the Avengers at the friendliest, messiest, and mightiest. Great, but it might also remind about the weird space this movie has occupied in the years since its release.\n\nBack when Age of Ultron first released on May 1, 2015, it was regarded as a solid, albeit disappointing sequel to the original Avengers. By the time the credits rolled, folks left the theater feeling something was off, and it became the first real blow to Marvel’s fairly solid track record up to that point. Thor: The Dark World had Loki to use as a shield, but Ultron lacked the “wow” factor that ended up diminishing the appeal of another group outing for these characters. Save for maybe Hawkeye, it didn’t really do anyone here any favors, and the best thing you could say about it was how it served as a jumping off point for more interesting MCU developments down the line: without it, would Captain America: Civil War just a year later feel like a more proper (and frankly better) Avengers movie? Does Thor: Ragnarok exist if Ultron doesn’t take the god out of the film for an Infinity Stones-focused detour that felt wildly out of place at the time?\n\nOutside its own franchise, Ultron helped lay the foundation for writer/director Joss Whedon’s creative future and subsequent ousting following abuse allegations from Buffy star Charisma Carpenter. Much of that can be laid at Whedon pairing Black Widow with Banner and revealing she’d had a forced hysterectomy during her upbringing in the Red Room, the former further exacerbated by Chris Evans and Jeremy Renner calling her a slut in an interview. The goodwill Whedon had previously earned through his handling of women in his prior work gradually came crashing down after the Avengers sequel, and the film’s mixed reception led to his time at Marvel being functionally over. Ultron lit the match, and the fire truly started when he directed the 2017 cut of Justice League. Its release and later details of his alleged on-set conduct blew up his career and after exiting The Nevers, which he created for HBO Max in 2021, there’s been no real word of him since.\n\nSo yeah, Age of Ultron, weird movie to watch, talk about, and generally exist as a piece of media. WandaVision, Hawkye, and Ultron’s return in the Vision’s own upcoming series ensure it won’t be completely forgotten, but of the various Avengers and Phase Two movies, it’s maybe the most “great, but this really could’ve just been an email” of the bunch. Maybe it’s improved with age, but that require listening to going through the smarmy quips again, and I think we’re all good on that front."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "michael.hicks@futurenet.com (Michael L Hicks)",
    "title": "I assembled an Ultrahuman smart ring by hand and learned how they work",
    "description": "During an Ultrahuman factory tour, they walked us through every step to make a smart ring. It was surprisingly fun and deceptively simple.",
    "url": "https://www.androidcentral.com/wearables/i-assembled-a-smart-ring-by-hand-and-learned-how-they-work",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/TGKGxeCNU45PgJTWM94iAQ.jpg",
    "publishedAt": "2025-05-11T15:00:00Z",
    "content": "(Image credit: Android Central)\r\nIn this weekly column, Android Central Wearables Editor Michael Hicks talks about the world of wearables, apps, and fitness tech related to running and health, in his… [+7528 chars]",
    "full_content": "Sunday Runday (Image credit: Android Central) In this weekly column, Android Central Wearables Editor Michael Hicks talks about the world of wearables, apps, and fitness tech related to running and health, in his quest to get faster and more fit.\n\nThis week, I flew to Plano, Texas, to check out Ultrahuman's new factory. After they walked me through every official step of manufacturing a smart ring, I did my best impression of a factory worker and built an Ultrahuman Ring Air from the raw parts. And it gave me a new appreciation for my own smart ring.\n\nSmart rings aren't designed to be taken apart and put back together like other tech. You might know what sensors are inside, but you probably don't know what else is sitting inside all that titanium, resin, and ceramic, and what determines how thick these rings are.\n\nBut with Ultrahuman's Ring Air in a sales and patent war with the Oura Ring, the company decided to show off its new American factory. This had the nice side effect of finally sating our curiosity about how smart rings are made, something other brands have been reluctant to talk to us about.\n\nPlus, now I get to say that I helped make a smart ring that someone in the U.S. will buy!\n\nHow smart rings are made\n\n(Image credit: Ultrahuman)\n\nThe photo galleries below show nearly every step of Ultrahuman's smart ring-making process, starting with the creation of printed circuit boards (PCBs), which contain the SoC, PPG, IMU, temperature, and Bluetooth components.\n\nThese components are mass-producible — an engineer suggested one machine could produce 10,000 PCBs in a day — and made of fiberglass, polyamide, and ceramic materials, chosen to make them bendable enough to slide naturally into the rounded ring shape.\n\nBut the \"UltraFactory\" currently only makes about 400 smart rings per day, though Ultrahuman has promised to hit about 1,350 per day or 500,000 per year by the end of 2025. There are several pain points, starting with the fact that the other mass-produced components have to be soldered onto the PCB by hand.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nImage 1 of 5 A standard selection of Ultrahuman Ring Air PCBs in sets of 12. (Image credit: Michael Hicks / Android Central) The machine that mass-produces Ultrahuman Ring Air PCBs. (Image credit: Michael Hicks / Android Central) The PCBs are placed inside an X-Ray machine to check for internal component issues. (Image credit: Michael Hicks / Android Central) They then use camera close-ups to check the PCB's external components for any major defects. (Image credit: Michael Hicks / Android Central) Lastly, the PCBs are programmed to add the software you're familiar with in the Ultrahuman Ring Air. (Image credit: Michael Hicks / Android Central)\n\nAfter they create the PCBs, do internal and external spot checks for any flaws, and program each PCB with the requisite software, they're ready for the next step: soldering.\n\nFirst, the Rx coil is soldered onto the PCB; then, the battery is soldered onto the coil. They brush off the excess alloy, leaving one seamless, bendable component ready to be inserted into the ring.\n\nImage 1 of 2 Soldering the Rx coil onto the PCB. (Image credit: Michael Hicks / Android Central) Soldering the battery onto the PCB and coil. (Image credit: Michael Hicks / Android Central)\n\nWith a 3D-printed part, the welded-together PCB is curved into a proper J shape. The workers then apply glue to the titanium-carbon ring you're familiar with, remove the cover for the PCB's adhesive layer, and finally shove the component into place.\n\nThey do a software check — since technically, you could wear the ring at this point — and then place the ring inside a silicone mold. One mold with 12 rings is brought to the casting station, which is one part of the factory where they wouldn't let us photograph or record.\n\nThere, they inject epoxy resin into the ring from the thickest portion — the PPG — inside a vacuum-sealed chamber to prevent any resin bubbles. The process takes 24 hours, because heating the resin to harden it faster would damage the components. Ultrahuman said this casting process is one of the big pain points that slows down the ring process.\n\nImage 1 of 6 The worker places glue on the smart ring to attach the PCB. (Image credit: Michael Hicks / Android Central) They test the PCB's software and functionality before sealing the components in resin, so they can fix things first. (Image credit: Michael Hicks / Android Central) The rings are placed inside a silicone mold. (Image credit: Michael Hicks / Android Central) Removing the silicone layer after injecting epoxy resin inside of the smart rings. (Image credit: Michael Hicks / Android Central) How a smart ring looks after injected with epoxy resin (Image credit: Michael Hicks / Android Central) Buffing the smart rings to remove the hard-edged pieces of resin remaining. (Image credit: Michael Hicks / Android Central)\n\nAt this point, the smart ring is almost ready to be worn, but the resin will look rough and have hard edges that'll hurt your finger. They spend about 30 minutes cleaning and polishing it into consumer-ready form.\n\nOnce that's done, they do one more software check to ensure everything is up to code. Then, they place the ring on a 3D-printed part to check its size; if it won't fit or slides all the way down the cylinder, they know it's not to code. Otherwise, the Ultrahuman Ring Air is ready to be sold!\n\nHow I made a smart ring\n\n(Image credit: Michael Hicks / Android Central)\n\nIf you've been paying attention, you'll note that I couldn't make a smart ring from start to finish during this tour. The 24-hour resin process made that impossible. So it's more accurate to say that I got halfway through making a smart ring and then returned a different smart ring for the final part of the process. Nor did I get to handle any software or hardware QC.\n\nI'm still going to say I made a smart ring, though. They told me my halfway-done smart ring would eventually be sold to someone, and that's pretty neat.\n\nImage 1 of 3 I soldered both the receiver coil and battery onto the PCB. (Image credit: Michael Hicks / Android Central) Then I removed the adhesive material and inserted the components into a smart ring. (Image credit: Michael Hicks / Android Central) With that done, I inserted my ring into a mold to be sent to the casting machine. (Image credit: Michael Hicks / Android Central)\n\nFollowing the steps above, I soldered the receiver coil onto the PCB by scraping some adhesive onto the coil and then stepping on a switch to trigger the machine (without burning off my thumbnail, thankfully). I then had to solder two separate points to attach the battery before brushing away the excess adhesive.\n\nI curved the Ring Air components so they would fit inside, ripped off the adhesive with tweezers, shoved them inside the ring, and then pressed hard on the sensors to make them stick.\n\nI was sure my clumsy, shaking fingers would break something, but it turned out my only issue was being too gentle. One portion came loose as I started to shove my smart ring into the casting mold, but I got it reattached and waved farewell to my ring.\n\nThen they gave me another ring further along in the process and had me clean off the resin, using an electric spinning brush, sandpaper, and some 3M buffing fluid. I didn't get to finish the full 15+ minutes before Ultrahuman staff hustled me along to my interview, but I can honestly say I got that Ring Air into good enough shape that the resin wouldn't cut any fingers or look unsightly.\n\nHow smart ring manufacturing might change\n\n(Image credit: Michael Hicks / Android Central)\n\nI asked Ultrahuman's CEO, Mohit Kumar, and chief business officer, Bhuvan Srinivasan, about smart ring repairability, a major issue with all smart rings. The resin that keeps components in place and protected also makes it all but impossible to take rings apart for repair, and there are no visible buttons for resetting a malfunctioning ring.\n\nThey explained that they hope to add a tiny, hidden button to their smart rings. If a Ring Air is sent in for repair, they'll be able to remove a tiny bit of resin to hold down that button and reboot the ring into a mode where it can receive firmware updates.\n\nI asked if they had any hopes for a more modular design that would let them remove and replace a battery, since smart ring batteries are so small and susceptible to losing capacity after a couple of years. Kumar replied that they're interested in it, but I got the sense that it's more of a pie-in-the-sky goal than something they're actively pursuing at the moment.\n\n(Image credit: Michael Hicks / Android Central)\n\nFor now, they're more focused on optimization. Because American labor costs are higher than in their Indian facility, they're looking to make the process more efficient; for example, they found a new casting machine that would inject resin into four times as many rings at once, breaking open that bottleneck in the factory line.\n\nAs for me, I'm curious how the manufacturing processes of other smart rings differ from those of Ultrahuman and how they are evolving as the tech improves. But proprietary differences aside, the UltraFactory experience gave me respect for the amount of quality control that goes into making a smart ring — while also surprising me that someone like me with no industrial experience can go through the steps with enough hand-holding and patience."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Justin Carter",
    "title": "X-Men Writer Jonathan Hickman Laments His Unfinished Krakoa Saga",
    "description": "HIckman's brief time with the X-Men remains 'really, really difficult' to look back on positively when it didn't end as he hoped.",
    "url": "https://gizmodo.com/x-men-writer-jonathan-hickman-laments-his-unfinished-krakoa-saga-2000600750",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/xmen-house-powers.jpg",
    "publishedAt": "2025-05-11T20:15:11Z",
    "content": "The X-Men have been through plenty of shakeups, and the Krakoan Age felt like a breath of fresh air when it started in 2019. Beginning with writer Jonathan Hickman and artists Pepe Larraz and R.B. Si… [+2304 chars]",
    "full_content": "The X-Men have been through plenty of shakeups, and the Krakoan Age felt like a breath of fresh air when it started in 2019. Beginning with writer Jonathan Hickman and artists Pepe Larraz and R.B. Silva’s House of X and Powers of X, the mutants established their newest unified society that promised to better things for their people after years of being beaten down. But Hickman, whose previous Marvel tenure established him as a long-term writer, exited with the Inferno miniseries in 2022, and Krakoa’s story continued without him.\n\nIn a recent episode of the Off-Panel podcast, Hickman looked back on his time leading the charge at the X-books. By now, he considers it “the most disappointing creative experience” of his comics career, largely owing to him not getting to finish his intended story. Back when he first pitched his plans to Marvel, he’d unveiled the entire three-story arc. As he tells it, he was “very clear” about the overall point he wanted to make, and teased those who heard the full pitch knew it was a “real bummer” things didn’t pan out.\n\nHickman claimed his departure wasn’t so much one thing as it was several factors, ranging from COVID to business and publishing-related issues. Had he stayed, he’s certain he would’ve made an X-Men saga for the ages, but he also stressed he’s got no issue with the creative teams who stepped up after his leaving, or Marvel itself. “It’s on me to tell the story that I’m supposed to tell, period,” he continued. “I don’t have any negative feelings about any other stuff outside of me not bringing it home, and I don’t think I’ll ever talk about it, because it’s shitty.”\n\nThe Krakoan Age officially ended in 2024, and the X-Men have since gone back to the “hated and feared” ways of the past across their various books. But the impact of the island-nation still hovers over the current mutant crop, and the run is getting one last farewell with a new Hellfire Gala one-shot in July. As for Hickman, he remains at Marvel, mainly as a key architect for the revamped Ultimate Universe—a duty he took over from Thor writer Donny Cates following his car accident in 2023—and writing Ultimate Spider-Man. He’s also got an upcoming cosmic event in the primary Marvel universe, Imperial, which is set to begin in June.\n\n[via The Popverse]"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Justin Carter",
    "title": "The Revenge of the Sith Game Writer Still Thinks About Its Wild Alternate Ending",
    "description": "In another world, theRevenge of the Sith tie-in game could've launched a new and darker AU for Star Wars to play with.",
    "url": "https://gizmodo.com/the-revenge-of-the-sith-game-writer-still-thinks-about-its-wild-alternate-ending-2000600742",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Hayden-Christensen-Revenge-of-Sith.jpg",
    "publishedAt": "2025-05-11T21:00:56Z",
    "content": "Star Wars Episode III: Revenge of the Sith turns 20 years old later in May, and for many, the film will bring to mind its tie-in game. One reason it holds a special place in fans’ hearts is its two e… [+2224 chars]",
    "full_content": "Star Wars Episode III: Revenge of the Sith turns 20 years old later in May, and for many, the film will bring to mind its tie-in game. One reason it holds a special place in fans’ hearts is its two endings: the canonical one where Obi-Wan defeats Anakin to begin the Original Trilogy, and an alternate one where Anakin kills his former master, then Palpatine, and becomes the new Emperor.\n\nTalking to Inverse, game writer Jeremy Barlow revealed the ending partially came from an idea pitched by LucasArts. When developer The Collective scaled back its ambitions for separate Anakin and Obi-Wan campaigns into a single one with alternating perspectives, it opted to stick with that different take, and Barlow got to handle the specifics. To him, Anakin killing Obi-Wan was a “no-brainer,” since it’d prove he was the strongest Force user in the galaxy and give him the confidence to betray his childhood confidant.\n\n“It totally fit in with the whole Sith ideal of the apprentice growing and killing the master, and we all went nuts for it,” said Barlow of the idea. The Revenge of the Sith game had a shaky development—The Collective replaced an entirely different studio and restarted development less than a year before its scheduled release—and Barlow said they had to “get the point as fast and seamlessly as possible. We only had like a [90-second] cutscene.” Despite the brief ending, he called it “rewarding [to see] it’s still in people’s minds and hearts. It’s not a reflection on me, but a reflection on just how powerful that idea was and what Star Wars means to people.”\n\nIf Barlow had his way, he’d explore the fallout of the Emperor Anakin ending. Under Anakin’s rule, he thinks the galaxy would be much worse off, since Palpatine at least “followed the rules in a weird way.” But the new paradigm shift would lead to some interesting family drama: how does Padme raise the twins while married to the most powerful man in the galaxy (who she’s already admitted to being terrified of), and how do Luke and Leia survive “being raised by these parents who have a public face together, but behind closed doors are obviously opposed?”\n\nLucasfilm may not provide the answers, but that’s what fanfiction’s for."
  },
  {
    "source": {
      "id": null,
      "name": "Hackaday"
    },
    "author": "Al Williams",
    "title": "Wireless USB Autopsy",
    "description": "It might seem strange to people like us, but normal people hate wires. Really hate wires. A lot. So it makes sense that with so many wireless technologies, there should be a way to do USB over wire…",
    "url": "https://hackaday.com/2025/05/07/wireless-usb-autopsy/",
    "urlToImage": "https://hackaday.com/wp-content/uploads/2025/05/usb.png",
    "publishedAt": "2025-05-07T23:00:46Z",
    "content": "It might seem strange to people like us, but normal people hate wires. Really hate wires. A lot. So it makes sense that with so many wireless technologies, there should be a way to do USB over wirele… [+1337 chars]",
    "full_content": "It might seem strange to people like us, but normal people hate wires. Really hate wires. A lot. So it makes sense that with so many wireless technologies, there should be a way to do USB over wireless. There is, but it really hasn’t caught on outside of a few small pockets. [Cameron Kaiser] wants to share why he thinks the technology never went anywhere.\n\nWireless USB makes sense. We have high-speed wireless networking. Bluetooth doesn’t handle that kind of speed, but forms a workable wireless network. In the background, of course, would be competing standards.\n\nTexas Instruments and Intel wanted to use multiband orthogonal frequency-division multiplexing (MB-OFDM) to carry data using a large number of subcarriers. Motorola (later Freescale), HP, and others were backing the competing direct sequence ultra-wideband or DS-UWB. Attempts to come up with a common system degenerated.\n\nThis led to two systems W-USB (later CF-USB) and CW-USB. CF-USB looked just like regular USB to the computer and software. It was essentially a hub that had wireless connections. CW-USB, on the other hand, had cool special features, but required changes at the driver and operating system level.\n\nCheck out the post to see a bewildering array of orphaned and incompatible products that just never caught on. As [Cameron] points out, WiFi and Bluetooth have improved to the point that these devices are now largely obsolete.\n\nOf course, you can transport USB over WiFi, and maybe that’s the best answer, today. That is, if you really hate wires."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "roydon.cerejo@gmail.com (Roydon Cerejo)",
    "title": "Samsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Which one will be the first to fold?",
    "description": "The Galaxy Z Flip 7 is not out yet but rumors are pointing to it being a significant upgrade, which means it goes up directly against the new Razr Ultra 2025.",
    "url": "https://www.androidcentral.com/phones/samsung-galaxy/samsung-galaxy-z-flip-7-vs-motorola-razr-ultra-2025",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/RohBotZnfQzj9EcAas6UNc.jpg",
    "publishedAt": "2025-05-06T20:59:22Z",
    "content": "Motorola has raised the bar for what a premium flip phone should look like with the new Razr Ultra 2025. The $1,299 price tag officially makes it the most expensive Motorola flip phone yet, and has i… [+11404 chars]",
    "full_content": "Samsung Galaxy Z Flip 7 Almost there The Samsung Galaxy Z Flip 7 will hopefully have the one big change we're all eager to see, and that's a larger outer display. The leaked render above is what the phone should look like and I'm happy to see it. You should also expect improvements like a faster processor, maybe a larger battery with quicker charging, and new software features. Pros Larger cover screen with a snappier 120Hz refresh rate (expected)\n\nIP48 water and dust-resistance\n\nImproved battery life with faster charging\n\nPowerful Snapdragon Elite for Galaxy chipset\n\nAndroid 15 out of the box with seven OS updates Cons Same old cameras (most likely)\n\nStale charging specs (if it's 25W)\n\nShould be pricey Motorola Razr Ultra 2025 Preorder at Amazon Preorder at Amazon A proper Moto flip flagship The Motorola Razr Ultra 2025 is a new addition to the series, taking top spot in the company's lineup. It boasts of a flagship Qualcomm chip, larger battery, and extremely fast charging. Both displays have highly impressive specs, you get 50MP cameras all around, and the new Moto AI feature feel genuinely useful. This might just be Samsung's biggest competition yet. Pros Flagship Snapdragon SoC\n\nAI Key button is handy\n\nIP48 rating\n\nImpressive display specs\n\nLean Android 15\n\n68W wired charging Cons Expensive\n\nNo telephoto camera\n\nOnly three promised OS upgrades\n\nMotorola has raised the bar for what a premium flip phone should look like with the new Razr Ultra 2025. The $1,299 price tag officially makes it the most expensive Motorola flip phone yet, and has its eyes set squarely on the upcoming Samsung Galaxy Z Flip 7.\n\nThe reason for introducing this third option in the Razr line was to try to capture the premium end of the market, according to Motorola. This calls for a Galaxy Z Flip 7 vs. Razr Ultra 2025 comparison since it's a choice most users in the U.S. are going to have to make once the former is formerly introduced.\n\nWe don't know exactly what the Galaxy Z Flip 7 will be like, but we've got enough leaks for a rough sketch. We might finally get a larger outer display, a slightly bigger battery, some tweaks to the design and hinge, and new software. All of this is speculative right now, but one thing's for sure: Samsung better wow us with its upcoming foldable if it hopes to take down Motorola's dominance and claim the best foldable title.\n\nFor more news and information on Samsung’s upcoming foldables, check out our Ultimate Guide.\n\nSamsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Spec differences\n\nWhy you can trust Android Central Our expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.\n\n(Image credit: Derrek Lee / Android Central)\n\nSwipe to scroll horizontally Category Samsung Galaxy Z Flip 7 (rumored/expected) Motorola Razr Ultra 2025 Folding display 6.85-inch LTPO (1-120Hz) 7-inch LTPO AMOLED, 165Hz, 2912 x 1224 resolution, 4,500 nits Cover display 4-inch AMOLED, 120Hz 4-inch LTPO AMOLED, 165Hz, 1272 x 1080, 417 ppi, Gorilla Glass Ceramic Operating System Android 16 (One UI 8), seven OS upgrades Android 15 (Hello UX), three OS upgrades Chipset Snapdragon 8 Elite for Galaxy or Exynos 2500 Snapdragon 8 Elite RAM 12GB 16GB Storage 256GB, 512GB 512GB Rear Camera 1 50MP wide 50MP wide, f/1.8, PDAF, OIS Rear Camera 2 12MP ultrawide 50MP ultrawide, f/2.0, 122˚ Front-facing Camera 10MP wide 50MP wide, f/2.0 Battery 4,300mAh 4,700mAh Charging 45W wired charging, 15W fast wireless charging 2.0, 4.5W reverse wireless charging 68W wired charging, 30W fast wireless charging 2.0, 5W reverse wireless charging Connectivity 5G, Wi-Fi 7, Bluetooth 5.4, NFC 5G, Wi-Fi 7, Bluetooth 5.4, NFC Weight - 199g Dimensions (folded) - 88.1 x 74 x 15.7 mm Dimensions (unfolded) 166.6 x 75.2 x 6.9 mm 171.5 x 74 x 7.2 mm Protection IP48, Armor Aluminum frame, Gorilla Glass Victus 2 (cover display, rear panel), PET screen protector (inner display) IP48, aluminum frame (6000 series), titanium hinge\n\nThe Samsung Galaxy Z Flip 7 is expected to start at the same price as the Z Flip 6: $1,099.99 for 256GB of storage and $1,219.99 for 512GB. Both variants come with 12GB of RAM. This would make the Flip 7 fairly expensive, just like its predecessor. Hopefully, the flurry of expected upgrades should help justify the price. One area where Samsung leads is in the length of software upgrades.\n\nThe Motorola Razr Ultra 2025 only comes in a single variant with 16GB of RAM and 512GB of storage, for $1,299. It's only a little more than Samsung's equivalent storage variant, but you get a lot more RAM. Additionally, buying the phone directly from Motorola will score you 1TB of storage, more than Samsung has ever featured on a flip phone.\n\nPreorders for the Razr begin on May 7, and the phone goes on sale on May 15. Apart from the long-term software support, the Razr Ultra 2025 has equally good or better specs than the expected Z Flip 7, making it look like a much better value.\n\nSamsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Display and design\n\n(Image credit: OnLeaks via Android Headlines)\n\nThe big upgrade we're all curious to see is if Samsung actually goes with a larger, edge-to-edge cover display on the Galaxy Z Flip 7. The recent leaks and renders all point towards it, and it should be true in all likelihood.\n\nWe hope Samsung unlocks the ability to natively run standard apps on the cover screen too, and not just widgets, which should be a great utility upgrade. The phone is also expected to have a slightly larger 6.8-inch folding display, which could make it slightly wider or taller, depending on the new aspect ratio. It will lilely feature a FHD+ resolution and 120Hz refresh rate.\n\nIf the Galaxy Z Flip 7 is anything like the render above, we're looking at a more boxier design compared to even the past generation. We fear that the Flip 7 could be less comfortable to hold than the Flip 6, but we'll have to wait and see.\n\n(Image credit: Derrek Lee / Android Central)\n\nThe Motorola Razr Ultra 2025's design and displays are in another league altogether, which is interesting when you consider how poorly Motorola lagged behind Samsung when both had just introduced their first-gen flip phones. Motorola's obsession with adding different textures to the bottom half of the phone continues as the Razr Ultra gets two unique finishes, including one with wood and another with Alcantara.\n\nThe Ultra's display specs are epic. Both screens on the Razr Ultra 2025 have a 165Hz refresh rate and are bright pOLED panels. The Super HD+ resolution of the internal display is also quite high, finding a medium between FHD+ panels on many flagships and QHD displays on premium models. The outer glass gets Corning Gorilla Glass Ceramic, which should help it survive scratches and cracks well.\n\nSamsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Cameras\n\n(Image credit: Derrek Lee / Android Central)\n\nWe're not expecting a big change when it comes to cameras on the Galaxy Z Flip 7. The cameras on the Galaxy Z Flip 6 were fine and did a decent job, and that'll probably apply to the Z Flip 7 too.\n\nWe should expect a main 50MP sensor with optical stabilization and a 12MP ultrawide camera on the outside. All the leaks so far point to it being a dual-camera setup once again, so it's unlikely that we'll have a third telephoto. The camera in the folding display will probably be the same 10MP sensor again. Real-world image quality should be better, especially if the phone gets the Snapdragon 8 Elite's new ISP and improved software tuning in One UI.\n\n(Image credit: Nick Sutrich / Android Central)\n\nMeanwhile, the Motorola Razr Ultra 2025 now comes with Pantone Validated cameras, which Motorola says should deliver better skin tones and color reproduction. The Razr Ultra also has a 50MP main camera with a similar apeture and specs. There's also a 50MP ultrawide, which in all likelihood, should be able to capture greater level of details than the Z Flip 7. Motorola uses a 50MP sensor for the selfie camera too, which again, should produce much better photos than Samsung.\n\nBoth phones might offer similar performance in daylight shots, but Motorola should have the edge in low-light and ultrawide photos. It can also shoot at 8K, while the Z Flip 7 could be limited to 4K, but we don't know for sure until the phone launches.\n\nSamsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Performance and battery life\n\n(Image credit: OnLeaks via Android Headlines)\n\nOn the performance front, the Samsung Galaxy Z Flip 7 and Motorola Razr Ultra 2025 could potentially be on equal footing, assuming they both have the Snapdragon 8 Elite. This hasn't been confirmed yet for the Galaxy but we're almost certain it would use that chip, although come rumors have indicated it may use the Exynos 2500 instead.\n\nBenchmark numbers would be up and down for both phones, with some favoring the Razr and vice versa. I don't think you'll notice any difference in real-world usage, though. Games and apps should perform similarly on both. The Razr Ultra could have an advantage for AI tasks and long-term usage thanks to the higher RAM.\n\n(Image credit: Derrek Lee / Android Central)\n\nSoftware will also play a big role in how these phones perform, and here, Samsung has Motorola beat when it comes to updates. The Galaxy Z Flip 7 will most likely get seven years of OS and security updates, just like the current flagship S series. That's a big commitment and will ensure your phone is still relevant even if you decide to sell it a few years later.\n\nSamsung had a few hiccups with the rollout of One UI 7, but it has generally been timely with new software updates. We should also see some new Galaxy AI features being introduced with the Flip 7.\n\nThe Razr Ultra will only get three OS upgrades, which is not great when you're paying above $1,000. Plus, Motorola doesn't have the best track record for issuing timely updates either, which means it's a bit of a leap of faith here. Motorola is doubling down on AI this year to better compete with Samsung.\n\nThe Razr Ultra 2025 has a dedicated button to activate the Moto AI hub, which is genuinely useful and does not feel like an afterthought. One of the unique new features is Look and Talk, which lets the phone's owner simply look at the phone in tented mode and start conversing with the AI. We'll be testing all the AI features in our full review, so don't forget to check that when it drops.\n\n(Image credit: Derrek Lee / Android Central)\n\nThe Galaxy Z Flip 7 is expected to have a slightly larger battery than last time, at 4,300mAh. This should provide a little boost and help the phone last a little longer. Plus, the new chip and software optimizations could help deliver double-digit battery gains compared to the Z Flip 6.\n\nCharging specs are expected to be the same too, at 25W, although there is a good chance we could see 45W as Samsung has begun using this for its budget A-series phones too. Wireless charging should be present as well at 15W.\n\nThe Razr Ultra 2025 has a much larger 4,700mAh battery, which should deliver vastly better battery life than the Z Flip 7 on paper, although they both could end up being similar. We're yet to test the Razr, but that battery also needs to power two incredibly bright and high-resolution displays, which could negate the advantage of having the higher capacity. We'll know for sure once we have tested both phones, but don't be surprised if both end up having similar battery life in real-world usage.\n\nSamsung Galaxy Z Flip 7 vs. Motorola Razr Ultra 2025: Which one should you buy?\n\n(Image credit: Motorola)\n\nI know it's easier to recommend the Samsung Galaxy Z Flip 7 for its potential for wider availability and longer software support, but the Motorola Razr Ultra 2025 just feels like the better product, as of now anyway.\n\nThe Z Flip 7 is not yet official, so our opinion could change based on what it ends up offering, but the Razr Ultra is a better value pick right now. It's expensive, sure, but you get some of the best specs not found anywhere on flip phones in the U.S., along with excellent carrier support. If you're not too bothered with keeping the phone for very long, then the Razr Ultra 2025 looks like a winner through and through.\n\nSamsung Galaxy Z Flip 7 Coming attraction The Galaxy Z Flip 7 should arrive in July and it should finally bring the larger outer display we've all been wanting. But it's also going to be expensive and might not match the Razr Ultra's impressive specs."
  },
  {
    "source": {
      "id": null,
      "name": "Simonwillison.net"
    },
    "author": "Simon Willison",
    "title": "Simon Willison's first blog on LLMs (2022)",
    "description": "I’ve been playing around with OpenAI’s GPT-3 language model playground for a few months now. It’s a fascinating piece of software. You can sign up here—apparently there’s no longer a …",
    "url": "https://simonwillison.net/2022/May/31/a-datasette-tutorial-written-by-gpt-3/",
    "urlToImage": null,
    "publishedAt": "2025-05-10T17:04:25Z",
    "content": "31st May 2022\r\nIve been playing around with OpenAIs GPT-3 language model playground for a few months now. Its a fascinating piece of software. You can sign up hereapparently theres no longer a waitin… [+7020 chars]",
    "full_content": "A Datasette tutorial written by GPT-3\n\nI’ve been playing around with OpenAI’s GPT-3 language model playground for a few months now. It’s a fascinating piece of software. You can sign up here—apparently there’s no longer a waiting list.\n\nI just got a particularly interesting result from it which I thought I would share.\n\nInspired by this tweet about automating documentation, the prompt I fed it was “a step by step tutorial for getting started with Datasette”. I then kept on clicking the generate button until it stopped adding additional paragraphs.\n\nSomething I’ve learned about GPT-3 is that you need to fact check everything that it produces. It’s great at writing convincing text, but there’s no guarantees that anything will actually be true!\n\nHere’s what it came up with (original here). I’ve indented its output in order to add annotations.\n\nThis is a guide for getting started with Datasette. Datasette is a tool for creating and publishing data-driven websites. It is designed to make it easy to publish structured data, such as the results of a database query, in a way that is highly visible and interactive.\n\nA really strong start. This almost captures exactly what Datasette does.\n\nOne tiny nitpick: Datasette is used to publish entire database tables, not just the results of specific queries.\n\nThis is honestly a really good attempt at an elevator pitch for the tool—something I’ve consistently found difficult to capture in my own writing.\n\nDatasette can be used to create websites that allow users to explore and visualize data, or to build applications that expose data via APIs. It can also be used as a static site generator, creating a completely static HTML website that can be deployed anywhere.\n\nAgain, mostly right. Datasette doesn’t work as a static site generator, yet—though there’s an open issue to explore options around that. And of course there’s Datasette Lite.\n\nThis guide will cover the basics of how to install and use Datasette. It will also show you how to create a simple data-driven website using Datasette. 1. Install Datasette Datasette can be installed using pip, the Python package manager. To install Datasette, simply run the following command: pip install datasette\n\nYup, that’s how you install Datasette. brew install datasette works too.\n\n2. Create a database Datasette requires a SQLite database file in order to function. This database can be created using any SQLite client, such as the sqlite3 command-line tool. Once you have created a SQLite database file, you can use Datasette to create a website that exposes the data in that database.\n\nEntirely correct.\n\n3. Run the datasette command The datasette command is used to start a Datasette server. To start a server for the SQLite database file mydatabase.db , simply run the following command: datasette mydatabase.db This will start a Datasette server on http://localhost:8001 by default. You can now view the website in your web browser.\n\nHonestly, it’s getting spooky at this point. This is exactly right—it even got the correct port number (8001). I’d love to understand the training data that helped GPT-3 reach this conclusion. Has it been trained on the entire contents of GitHub perhaps?\n\n4. Explore the data Datasette provides a number of ways to explore the data in your database. The homepage of the website lists all of the tables in your database, as well as a search box that can be used to find specific data.\n\nIt made up that search box on the homepage, though it’s a pretty great idea for a feature.\n\n(You can get something a bit like that if you install the datasette-search-all plugin.)\n\nEach table has its own page, which lists all of the columns in the table and provides a form that can be used to query the data. The results of each query are displayed in a tabular format, and can be downloaded as CSV files.\n\nAgain, spookily accurate.\n\n5. Create an API endpoint Datasette also provides a JSON API that can be used to programmatically access the data in your database. Each table in your database has its own API endpoint, which can be accessed using a URL of the form: http://localhost:8001/mydatabase.db/mytable?_size=100\n\nHere’s where things get interesting. The description here is exactly correct, but that URL isn’t quite right—it should be:\n\nhttp://localhost:8001/mydatabase/mytable.json?_size=100\n\nI’d love to know how it synthesized the incorrect URL here.\n\nThis URL will return the first 100 rows from the mytable table in JSON format. The _size parameter can be used to control the number of rows returned, and the _offset parameter can be used to skip rows (for example, _offset=100 will return rows 100-199).\n\nI am deeply amused by this: the _size parameter is described correctly, but the _offset parameter here is a total fabrication: Datasette deliberately doesn’t offer offset/limit pagination because it’s inefficient against large tables. It implements keyset pagination instead, using a ?_next= parameter.\n\nThe Datasette JSON API can be used to build data-driven applications on top of your database.\n\nGood copy—I may use this elsewhere!\n\n6. Deploy your website Once you have created a Datasette website, you can deploy it to any web hosting provider that supports Python. Datasette is designed to be lightweight and fast, so it can be easily deployed on any platform, including Heroku, Google App Engine, and Amazon Web Services.\n\nI’ve not seen Datasette deployed on Google App Engine, but it runs great on Google Cloud Run.\n\nThoughts\n\nFirstly, the amount of detail GPT-3 has accumulated about Datasette is fascinating: I really want to understand where it picked up all of this knowledge. I remember asking it about Datasette around a year ago and not getting results anything like this, so my hunch is that it’s been trained on a new corpus of data at some point in the past twelve months.\n\nI certainly don’t see this as a replacement for professional technical writers, but as a tool for trying out new ideas, beating writer’s block and generally brainstorming how documentation could work it’s already something I would continue using.\n\nA really interesting aspect of this is “prompt engineering”—iterating on prompts and figuring out what can get the best results out of GPT-3. I wrote this article partly to highlight how good the results for “a step by step tutorial for getting started with ...” could be.\n\nMarketing landing pages\n\nAs a quick bonus: I think GPT-3 really excels when it comes to marketing copy (maybe because I don’t rate myself at all highly in that department).\n\nHere’s its response to the prompt: Write a marketing landing page for Datasette Cloud\n\nDatasette Cloud is a new way to host and manage your data. It’s built on top of the Datasette open source project and offers all the same features—including instant full-text search, SQLite database downloads and JSON API access—but with added benefits like automatic backups, 24/7 uptime monitoring and support from the Datasette team. If you’re looking for an easy way to host and manage your data, Datasette Cloud is the perfect solution. Try it today and see how easy it is to get started.\n\nHonestly this does a significantly better job of describing the hosted Datasette product I’ve been building than I’ve managed myself so far.\n\nFascinating."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "James Whitbrook",
    "title": "Andor‘s Twin Ghorman Massacres Are a Perfect Way to Re-Canonize Legends",
    "description": "Star Wars has spent a long time bringing back elements of the old Expanded Universe into current continuity—but Andor's latest episodes include one of the deftest examples of it.",
    "url": "https://gizmodo.com/andor-tarkin-massacre-ghorman-eu-canon-2000598711",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/andor-season-2-cassian-ghorman-monument-tarkin-massacre.jpg",
    "publishedAt": "2025-05-06T20:30:04Z",
    "content": "Ever since it was first teased that Andor‘s second season was preparing to show the tragedy that set the stage for the formal formation of the Rebel Alliance, there’s similarly been discussion of the… [+3968 chars]",
    "full_content": "Ever since it was first teased that Andor‘s second season was preparing to show the tragedy that set the stage for the formal formation of the Rebel Alliance, there’s similarly been discussion of the fact that there are two Ghorman Massacres. The one we are about to learn much more about in this week’s batch of episodes, and the very different version of events that took place in Star Wars‘ old Expanded Universe. Would we be getting something new, or something inspired by the story that had come before? Andor simply responded: why not both?\n\nAlthough this week’s episodes are primed to ignite the simmering tensions for what will become the Ghorman Massacre—the one that sparks Mon Mothma to publicly rail against Palpatine’s authoritarianism, flee the Senate, and call for the Alliance to Restore the Republic—last week’s act of Andor season two took us to Ghorman early to explore the planet’s resistance to the Empire. We learn pretty quickly during that exploration that while tensions between the Ghor and the Empire are at an all time high at the moment (thanks to a campaign the Empire’s enacting to fulfill its secret desire to mine the world for resources it needs to build the Death Star), disdain for the regime is not just contemporary feeling on the world.\n\nThere has already been a massacre on Ghorman once. The Tarkin one.\n\nThis Tarkin massacre matches many of the details of what was the primary Ghorman Massacre in Star Wars‘ old EU: it took place relatively early on in reign of the Empire, it involved a young Tarkin slaughtering hundreds of unarmed Ghorman protestors by landing a cruiser on them, it sparked wider public blowback to the Imperial regime. It is, for all intents and purpose, the EU’s Ghorman Massacre reconstituted into current Star Wars continuity. But crucially, it is no longer the incident that takes that name. The new story doesn’t erase the EU one, it weaves it into history, and creates thematic and narrative depth by choosing to say that it was not one or the other, but both.\n\nNow, Ghorman’s history of resistance holds up a mirror to the cyclical conflict echoed throughout the wider Star Wars saga—and crucially, the Empire’s cruelty, the Tarkin Doctrine of fear crushing dissent, is given a fatal flaw. Ghorman didn’t break in the wake of this first Imperial atrocity, it remembered its past and fought regardless, and although we’re only on the cusp of learning the full details of this latest one, we know the planet’s resistance will inspire greater pushback against the Empire in the wake of it, laying the groundwork for open galactic civil war and the Empire’s fall in its wake. It’s a brilliant parallel to the first season’s lessons with Nemik, the idea that fascist control through power can be broken if only people try, and keep trying, to not bend in the face of it.\n\nAnd most importantly, it’s texture that matters more than just checking off a known name or event. Andor doesn’t nudge and point when it makes note of the Tarkin massacre; if you weren’t already familiar that this was a known thing from the EU it might as well just have been an organic piece of background information. It’s woven into the narrative in the moment, not to disrupt the current story, but further enrich it. It’s something the series has done a surprising amount of, from offhand mentions of the Rakatans to the oodles of Easter eggs in Luthen’s antiques collections: it treats Star Wars‘ “legends” as history, something to provide color and context but not to necessarily dictate the story it’s telling in the here and now.\n\nThe point of evoking the Tarkin massacre is not simply to say “here is that thing from that other time” and call it a day, but to recognize the storytelling potential of recognizing these twinned versions of this same event, and realizing it’s more interesting to have both co-exist rather than cancel out one or the other. After all, there should always be a little truth in legends."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Cheryl Eddy",
    "title": "We Could Have Had an Avengers: Endgame-Style Conjuring Universe Send-Off",
    "description": "It's a ridiculously amazing idea that, alas, won't actually be happening in The Conjuring: Last Rites.",
    "url": "https://gizmodo.com/we-could-have-had-an-avengers-endgame-style-conjuring-universe-send-off-2000598658",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/annabellecreation.jpg",
    "publishedAt": "2025-05-06T18:15:31Z",
    "content": "The Conjuring Universe is heading into its endgameSeptember’s final Conjuring film is literally subtitled Last Ritesbut it won’t be borrowing a page from Avengers: Endgame to assemble all the monster… [+2870 chars]",
    "full_content": "The Conjuring Universe is heading into its endgame—September’s final Conjuring film is literally subtitled Last Rites—but it won’t be borrowing a page from Avengers: Endgame to assemble all the monsters we’ve met in its movies since 2013. However, and amazingly, that was actually briefly considered at one point.\n\nIn a new Entertainment Weekly feature that highlights The Conjuring: Last Rites but also serves as a look back at the franchise as a whole, Last Rites director Michael Chaves—who also helmed The Curse of La Llorona, The Conjuring: The Devil Made Me Do It, and The Nun II—spoke about the brainstorming sessions that informed the fourth Conjuring film starring Vera Farmiga and Patrick Wilson as Lorraine and Ed Warren.\n\n“Even as we were developing it, we were throwing a bunch of ideas out: ‘How shamelessly big can we make it?’ ‘How epic can we make it?’ ‘Is this the culmination of all the demons coming to face them?” Chaves told EW. The magazine added that “he admits the team briefly entertained the idea of about a dozen Doctor Strange portals opening to reveal every Conjuring entity assembled together for an endgame of sorts” before deciding to go in a more emotional, personal direction.\n\nOk. We understand that Lorraine and Ed’s bond is the heart of the Conjuring series. These two have stuck together despite being routinely imperiled by supernatural horrors galore. But imagine for just a moment that series creator James Wan, an executive producer on Last Rites, had decided to bid farewell to the Conjuring with a giant monsterpalooza?\n\nThe Nun and Annabelle would obviously be leading the charge, but you could also include the beasties who were introduced throughout the series as potential spin-off characters that never came to be, most notably the Crooked Man from The Conjuring 2. While the movie was very eager to set that scenario up, as executive producer Peter Safran tells EW, a stronger contender won out in the end.\n\n“We thought the Crooked Man was basically going to be the Annabelle for Conjuring 2,” Safran told EW—but “when the audiences saw the movie, they wanted to know more about the nun. That’s what they gravitated toward.”\n\nThe Crooked Man won’t be returning for that not-to-be Endgame showdown that will forever live rent-free in horror fans’ minds, but Wan hasn’t given up completely. “I still have a movie in my head that I would hopefully love to get off the ground one day, but we’ll see,” he told EW.\n\n“I get fans that reach out to me every now and then, begging us to make a Crooked Man movie. Just as a fan, I would love to do it one day, if I can convince the studio to do so.” We’re begging you now, James Wan: mega-monster crossover movie. You have the power! Make it happen!\n\nThe Conjuring: Last Rites hits theaters September 5. Head to EW to read plot details and more about the Conjuring Universe."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "James Whitbrook and Gordon Jackson",
    "title": "Updates From Fallout Season 2, and More",
    "description": "And get a look at Rick and Morty's new opening title sequence.",
    "url": "https://gizmodo.com/fallout-season-2-release-date-update-filming-amazon-2000600023",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/MS-0509-Walton-Goggins-Fallout-Season-2.jpg",
    "publishedAt": "2025-05-09T13:00:43Z",
    "content": "The new Silent Hill movie has found distribution. Rebecca Hall’s fighting zombies in her latest film. Final Destination teases Bludworth’s secret origins in new Bloodlines footage. Plus, Spider-Man: … [+2823 chars]",
    "full_content": "The new Silent Hill movie has found distribution. Rebecca Hall’s fighting zombies in her latest film. Final Destination teases Bludworth’s secret origins in new Bloodlines footage. Plus, Spider-Man: Brand New Day brings another star of The Bear to the MCU. Spoilers now!\n\nSpider-Man: Brand New Day\n\nDeadline reports that The Bear‘s Liza Colón-Zayas has joined the cast in an undisclosed role (not that that hasn’t stopped people from immediately speculating that she could be playing Miles Morales’ mother Rio, mind).\n\nThe Dog Stars\n\nDeadline reports Benedict Wong will star alongside Jacob Elordi, Margaret Qualley, Josh Brolin and Guy Pearce in Ridley Scott’s film adaptation of Peter Heller’s The Dog Stars. Set “in a near future where an unnamed pandemic has decimated American society,” the story follows Hig (Elordi), “a civilian pilot living a lonely life on an abandoned Colorado airbase with his dog and a tough ex-marine (Brolin). The two men couldn’t be more mismatched but depend on each other to fend off roaming invaders. When a random transmission beams through the radio of his 1956 Cessna, the voice ignites a hope deep inside the pilot that a better life exists outside their tightly controlled perimeter. Risking everything, he flies past his point of no return and follows its static-broken trail.”\n\nZero Protocol\n\nAccording to Screen Daily, Rebecca Hall is attached to star in Zero Protocol, a “zombie-action” film at Imaginarium Productions. Directed by Debs Hall (Willow), the story concerns “an NYPD commissioner (Hall) who battles to manage a city-wide zombie outbreak exploding in real time, only to discover her teenage daughter is trapped in the middle of the red zone.”\n\nReturn to Silent Hill\n\nVariety also reports Cineverse has acquired the distribution rights to Christophe Gans’ Return to Silent Hill, the latest take on the classic horror game series. The story, a direct adaptation of the events of Silent Hill 2, concerns James Sunderland, broken by the end of his relationship to the mysterious Mary, as a letter from him draws him back to the titular town–only to find it transformed and filled with horrors as he begins his search for her.\n\nEvil Dead Burn\n\nMeanwhile, Evil Dead Burn is now scheduled for a July 24, 2026 theatrical release date. [Deadline]\n\nFinal Destination: Bloodlines\n\nA new Final Destination: Bloodlines featurette promises to reveal the secret origins of Tony Todd’s William Bludworth.\n\nA Useful Ghost\n\nAfter inhaling toxic dust, a man’s late wife returns from the dead to possess the family vacuum cleaner in the trailer for A Useful Ghost.\n\nFallout\n\nWalton Goggins took to Instagram to announce that Fallout‘s second season has wrapped filming.\n\nRick and Morty\n\nFinally, Adult Swim has released the new opening titles for Rick and Morty‘s eighth season."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Cheryl Eddy",
    "title": "If You Liked Cynthia Erivo’s Poker Face Appearance, You Have to Check Out The Outsider",
    "description": "Long before she was Elphaba, the Oscar nominee played an unconventional sleuth in the 2020 Stephen King-adapted HBO series.",
    "url": "https://gizmodo.com/if-you-liked-cynthia-erivos-poker-face-appearance-you-have-to-check-out-the-outsider-2000599820",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/Cynthia-Erivo-2.jpg",
    "publishedAt": "2025-05-08T21:30:30Z",
    "content": "Poker Face is back on Peacock, and its season two premiere features a gangbusters guest-star turn by Cynthia Erivoplaying multiple identical siblings caught up in the latest murder puzzle to cross pa… [+2799 chars]",
    "full_content": "Poker Face is back on Peacock, and its season two premiere features a gangbusters guest-star turn by Cynthia Erivo—playing multiple identical siblings caught up in the latest murder puzzle to cross paths with Charlie Cale (Natasha Lyonne). While fans now immediately associate Erivo with her Oscar-nominated turn as Elphaba in Wicked, one of her first big showcases came on another crime-infused TV series: HBO’s The Outsider.\n\nThe Outsider ran in early 2020, concurrent with Erivo’s first Oscar nomination (for 2019’s Harriet), but its airing on such a popular, mainstream platform meant that it was many viewers’ first time seeing her perform. That it was based on the 2018 Stephen King novel of the same name also helped draw interest, as did the rest of the cast: Jason Bateman, Ben Mendelsohn, Paddy Considine (pre-House of the Dragon), and Yul Vasquez (pre-Severance), among others. But if you watched it—and if you didn’t, now would be a fantastic time to start!—the then-emerging star Erivo left the biggest impression.\n\nErivo plays a recurring Stephen King character, Holly Gibney. Holly made her debut in 2014’s Mr. Mercedes (in the series adaptation of that tale, she was played by Succession‘s Justine Lupe), and she’s still around—she’s the central character in Never Flinch, King’s latest novel, which releases later this month.\n\nIn HBO’s The Outsider, Holly’s the co-lead with Mendelsohn’s Ralph Anderson, a Georgia cop grappling with personal demons while facing the most perplexing case of his career. When a boy is found horribly murdered, all the evidence points to a beloved local baseball coach (Bateman), who insists he’s innocent, but is gunned down before his arraignment. The viewer is privy to a strange figure with a malformed face skulking around the show’s early proceedings—and Ralph, a seasoned detective, still can’t shake the idea that the accused was somehow telling the truth.\n\nAn unusual crime calls for an unusual investigator, so that’s when Erivo’s character enters the story. Holly’s abilities—she’s highly perceptive, to the point of being extra-sensory; she also has creative quirks, like knowing lyrics to songs she’s never heard before—make her an ideal foil for Ralph, a no-nonsense guy suddenly confronted with the notion that a supernatural explanation may be the only explanation.\n\nEven beyond the outstanding performances, the 10-episode Outsider is a chilling, rewarding ride. It follows a terrifying thread to some very dark places, with atmosphere to spare and an ending that satisfies—but also makes you wish HBO would’ve signed on for more. Alas, at least we got Erivo bringing the house down in Wicked, and memorably taking over the screen in Poker Face‘s return.\n\nThe Outsider is streaming on Max. Poker Face is streaming on Peacock."
  },
  {
    "source": {
      "id": "fox-news",
      "name": "Fox News"
    },
    "author": "Kurt Knutsson, CyberGuy Report",
    "title": "1.7 billion passwords leaked on dark web and why yours is at risk",
    "description": "In response to infostealer activity increasing 500% in a year and harvesting 1.7 billion user credentials, the CyberGuy offers four ways to stay safe from infostealer malware.",
    "url": "https://www.foxnews.com/tech/1-7-billion-passwords-leaked-dark-web-why-yours-risk",
    "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/2-1.7-billion-passwords-leaked-on-dark-web-and-why-yours-could-be-among-them-copy.jpg",
    "publishedAt": "2025-05-08T14:00:24Z",
    "content": "Cybercriminals aren't just going after big targets anymore. \r\nThey're going after everyone, and they're doing it with infostealer malware. These small, sneaky programs are quietly stealing passwords,… [+7944 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Phandroid - News for Android"
    },
    "author": "Mike Viray",
    "title": "The Best Budget Smartphones You can Get in 2025!",
    "description": "Want a new smartphone that fits into moderate budgets? Check out these devices!\nThe post The Best Budget Smartphones You can Get in 2025! appeared first on Phandroid.",
    "url": "https://phandroid.com/2025/05/09/the-best-budget-smartphones-you-can-get-in-2025/",
    "urlToImage": "https://phandroid.com/wp-content/uploads/2025/05/Budget-phones-2025-scaled.jpg",
    "publishedAt": "2025-05-09T23:09:27Z",
    "content": "We’ve gotten to a point in time where premium smartphones are pretty much capable of handling a lot of our needs for day-to-day tasks, with powerful cameras, impressive software capabilities, and a m… [+7622 chars]",
    "full_content": "We’ve gotten to a point in time where premium smartphones are pretty much capable of handling a lot of our needs for day-to-day tasks, with powerful cameras, impressive software capabilities, and a more refined approach to on-the-go computing. With that said however, getting the best-ever smartphone often tends to be expensive, which is why we’ve prepared this rundown of some of the more affordable alternatives that you can get, that don’t necessarily come with crippling compromises. Let’s get started!\n\nBest Budget Phones of 2025\n\nNothing Phone 3a\n\nDisplay: 6.77-inch AMOLED, 3000 nits, 120Hz | Chipset: Qualcomm Snapdragon 7s Gen 3 | RAM: 8/12GB | Battery: 5,000mAh | Charging: 50W wired | Cameras: 50MP main, 8MP, ultrawide, 50MP telescopic lens + 32MP selfie\n\nAs far as affordable smartphones go, the Nothing Phone 3a really shines in as much different areas as possible—it’s got a large and vibrant display, an attractive mid-tier Snapdragon processor, and even a telephoto camera which is not often seen in most budget-friendly devices. Like Nothing’s other smartphones, it also comes with the signature glyph interface at the rear which sets it apart from competing handsets and adds a bit of usefulness.\n\nOn the other hand, it’s this same design which might be a dealbreaker for some folks that might prefer a more moderate-looking or minimalistic look, although if we’re being honest the Nothing Phone 3a manages to excel in the areas where it matters most, especially for budget-conscious smartphone users.\n\n✅Pros ❌Cons Large and vibrant display\n\nImpressive chipset\n\nTelephoto camera\n\nLarge battery with decent charging speeds\n\nUnique software interface Glyph interface and hardware design might not be for everyone\n\nGoogle Pixel 8a\n\nDisplay: 6.1-inch OLED, 2,000 nits, 120Hz | Chipset: Google Tensor G3 | RAM: 8GB | Battery: 4492mAh | Charging: 18W wired / 8W wireless | Cameras: 64MP main, 13MP ultrawide, + 13MP selfie\n\nWhile it’s not the latest A-series Pixel phone from Google, the Pixel 8a still gets a lot of things right thanks to relatively-capable hardware, as well as impressive camera performance and Google’s monthly security updates. It also comes with a lot of useful features such as Google’s voice typing feature, call screening, and a host of other QoL functions. It doesn’t hurt that it’s also a lot cheaper now as well.\n\nIt’s not perfect of course, and folks after a budget device that can go the distance with raw performance might be left wanting a bit more, as the Tensor G3 inside the Pixel 8a is geared more towards moderate usage and well, regular smartphone tasks. It will be able to play most games from the Google Play Store, but don’t expect an ROG phone competitor with this one.\n\n✅ Pros ❌Cons Improved display over predecessors\n\nTerrific camera performance\n\nRegular software updates for up to seven years\n\nPractical QoL features Tensor G3 chip isn’t the most powerful\n\nGets warmer than most other phones\n\nBattery endurance could be better\n\nNothing Phone 3a\n\nDisplay: 6.77-inch AMOLED, 3000 nits, 120Hz | Chipset: Qualcomm Snapdragon 7s Gen 3 | RAM: 8/12GB | Battery: 5,000mAh | Charging: 50W wired | Cameras: 50MP main, 8MP, ultrawide, 50MP telescopic lens + 32MP selfie\n\nAs far as affordable smartphones go, the Nothing Phone 3a really shines in as much different areas as possible—it’s got a large and vibrant display, an attractive mid-tier Snapdragon processor, and even a telephoto camera which is not often seen in most budget-friendly devices. Like Nothing’s other smartphones, it also comes with the signature glyph interface at the rear which sets it apart from competing handsets and adds a bit of usefulness.\n\nOn the other hand, it’s this same design which might be a dealbreaker for some folks that might prefer a more moderate-looking or minimalistic look, although if we’re being honest the Nothing Phone 3a manages to excel in the areas where it matters most, especially for budget-conscious smartphone users.\n\nSamsung Galaxy A36\n\nDisplay: 6.7-inch AMOLED, 120Hz | Chipset: Snapdragon 6 Gen 3 | RAM: 6-12GB | Battery: 5000mAh | Charging: 45W wired | Cameras: 50MP main, 8MP ultrawide, 5MP macro + 12MP selfie\n\nOne of the main highlights of the Galaxy A36 is that it brings over a more premium design and build when compared to older A3X models, with a front and back that’s both made of Gorilla Glass Victus+. It also packs a large and vibrant screen that makes it ideal for content consumption and more immersive daily usage, as well as a large battery that should easily last a day and more for moderate users.\n\nA notable downside however is the somewhat lacklustre camera performance, especially when you consider that Samsung’s more affordable A-series phones aren’t always the best when it comes to photographic capabilities. They’ll give you decent photos in general, but users expecting a more capable camera phone (for less cash) will no doubt want to stick to a Pixel handset instead. Additionally, while the Snapdragon 6 Gen 3 is a decent chipset, it’s not really ideal for intense gaming, something that potential buyers might want to keep in mind.\n\n✅Pros ❌Cons Vibrant display for content consumption\n\nLarge battery should easily last a day and then some\n\nPremium design with Gorilla Glass\n\nUp to six years of major Android upgrades Camera performance isn’t the best\n\nNot really designed for intense gaming sessions\n\nMoto Edge 60 Stylus 2025\n\nDisplay: 6.7-inch OLED | Chipset: Snapdragon 7s Gen 2 | RAM: 8GB | Battery: 5,000 mAh | Charging: 68W wired / 15W wireless | Cameras: 50MP main, 13MP ultrawide + 32MP front, 4K UHD (30fps)/FHD (60/30fps)\n\nThe Moto G Stylus (2025) is a great example that you don’t need to spend a lot of cash to get a competent stylus-equipped smartphones. Priced just slightly below 400 bucks, the phone manages to impress with a large and sharp display, a capable Snapdragon 7s Gen 2 chip, as well as a large battery with fast charging support. Of course, the phone’s main highlight is its built-in stylus, which comes in handy for note-taking and apps which require a bit more precision in terms of input.\n\nOne downside though is that it only comes with two major Android upgrades, which might be a bit of a downer especially for users who’d like to keep their phones for longer than usual, and this means that you might miss out on major features beyond Android 16 and 17. While it’s also cheaper than the Moto G Stylus 2025, it’s currently exclusive for Indian markets.\n\n✅Pros ❌Cons Great chipset\n\nStylus support\n\nLarge battery with fast charging\n\nExpandable storage Only two years of major software support\n\nYou’ll need to import one if you’re in the US\n\nHonor Magic 7 Lite\n\nDisplay: 6.78-inch AMOLED display, 120Hz, 4,000 nits | Chipset: Snapdragon 6 Gen 1 | RAM: Up to 12GB | Battery: 6,600 mAh battery| Charging: 66W wired | Cameras: 108MP main camera, 5MP ultra-wide camera + 16MP front camera\n\nHonor’s main selling point for the Magic 7 Lite was pretty simple—it’s a phone that’s designed to look good, be durable and pack a massive battery, and that’s exactly where its strengths are. It also helps that the handset looks a lot more expensive than it actually is, and you’d be forgiven for mistaking it for a mid-tier smartphone from Honor’s lineup.\n\nOn the other hand, the Magic 7 Lite does come with some quirks—there’s quite a number of pre-installed apps on the device, its overall camera performance could be better, and the Snapdragon 6 Gen 1 inside (much like the Galaxy A36 earlier) is more suited for moderate smartphone usage, with a bit of light gaming in the mix. Still, the large 6,600 mAh battery is something that’s not often seen on phones at this price, and will be ideal for users who value endurance and little need for constant charging.\n\n✅Pros ❌Cons Great-looking design\n\nMassive 6,600mAh battery with 66W charging\n\nImpressive display\n\nGenerally durable Not available globally\n\nSnapdragon 6 Gen 1 isn’t the best for gaming\n\nCamera is so-and-so\n\nNot available in the US\n\nNote: this article may contain affiliate links that help support our authors and keep the Phandroid servers running."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Sarah Perkel",
    "title": "Nvidia CEO says 'San Francisco is back' — and it's thanks to the AI gold rush",
    "description": "\"Just about everybody evacuated San Francisco,\" Nvidia CEO Jensen Huang said. \"Now it's thriving again. It's all because of AI.\"",
    "url": "https://www.businessinsider.com/nvidia-ceo-san-francisco-is-back-ai-boom-2025-5",
    "urlToImage": "https://i.insider.com/68190099c6ad288d1480089f?width=1200&format=jpeg",
    "publishedAt": "2025-05-06T09:55:01Z",
    "content": "Nvidia CEO Jensen Huang credits AI with the resurgence of San Francisco's tech scene.Patrick T. Fallon / AFP\r\n<ul><li>Nvidia CEO Jensen Huang credited AI with a resurgence of San Francisco's tech sce… [+3758 chars]",
    "full_content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nJensen Huang, the CEO of Nvidia, says the AI boom reversed the San Francisco tech exodus.\n\n\"It's because of AI that San Francisco is back,\" Huang said during an episode of the Hill & Valley Forum podcast.\n\n\"Okay, anybody who lives in San Francisco, you'll know what I'm talking about. Just about everybody evacuated San Francisco,\" he added. \"Now it's thriving again. It's all because of AI.\"\n\nWhile San Francisco was far from becoming a ghost town of any sort, as many as 89,000 households left San Francisco during the height of the pandemic in 2020, taking advantage of the rise in remote work to ship out of state entirely or settle in nearby suburbs. And families weren't alone in fleeing — some major tech firms, including HP, Palantir, and Oracle, moved their headquarters out of the city, while other industry leaders left in favor of cities like Austin and Miami.\n\nBut since the release of ChatGPT in the latter half of 2022, the growth of AI companies has breathed some life back into the city's flagging tech sector, becoming some of its biggest tenants.\n\nIn recent years, AI companies have rented out more than 1.7 million square feet of office space, The San Francisco Standard reported, citing research from real estate company JLL. According to Forbes, real estate agents have even taken to calling Mission — a district in the city where OpenAI is headquartered — \"Area AI,\" for its dense population of related firms.\n\nIn 2024, one of every three VC dollars invested went into an AI startup, according to the data firm Pitchbook. Globally, 35.7% of VC funds went to AI and machine learning startups last year, and in North America alone, AI firms raked in nearly 50% of venture capital funding.\n\nAI companies have attracted a host of people to the Bay Area looking to capitalize on what Huang describes as another \"industrial revolution.\" Despite concerns that AI-assisted coding, sometimes called \"vibe coding,\" could negatively impact the number of job openings for software engineers, many tech firms continue to hire quickly amid the AI arms race.\n\n\"In our company, just as a starting point, every single software engineer is now assisted by AI assistants,\" the Nvidia CEO said. \"And the amount of code that we check into the company is incredible as a result. Our productivity has shot up through the roof, and we're hiring more people.\"\n\nAI has enabled Nvidia to \"create more things the world desires,\" Huang added, and the company's revenue, along with its \"ability to hire,\" have increased alongside its use of the technology.\n\nSan Francisco's population numbers are responding positively to the AI boom, according to Forbes — the city is now seeing growth again after around 7% of its citizens left between 2020 and 2022. Residential real estate prices are up, too, with 57% of homes in San Francisco selling above their asking price during February of this year, according to Redfin data. That's up 50% from 2024, and represents the biggest jump among the top 50 metros in the US, surpassing even New York.\n\nAnd while interest from the AI sector may not presently be enough to completely repopulate the vast number of offices standing vacant in downtown, the sustained interest of another tech boom could make a bigger dent. If the industry keeps growing at its breakneck pace of 30% a year, the San Francisco Examiner estimated it could take up around 12 million square feet of commercial real estate by the end of the decade — or a seventh of the office buildings in San Francisco."
  }
]