[
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Larry Ramer",
    "title": "CrowdStrike Holdings, Inc. (CRWD) Reported “Unbelieveable” Quarterly Results, Well-Known Investor Says",
    "description": "Calling IT security giant CrowdStrike Holdings, Inc. (CRWD) “one of the greatest companies in tech,” well-known investor Josh Brown on CNBC said that the...",
    "url": "https://finance.yahoo.com/news/crowdstrike-holdings-inc-crwd-reported-195137868.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/nug3zJHVuq256S.xk5z3ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/d54ea840df5fda27004fb44823c73cba",
    "publishedAt": "2025-05-10T19:51:37Z",
    "content": "Calling IT security giant CrowdStrike Holdings, Inc. (CRWD) \"one of the greatest companies in tech,\" well-known investor Josh Brown on CNBC said that the firm had reported \"unbelievable\" first-quarte… [+1666 chars]",
    "full_content": "Calling IT security giant CrowdStrike Holdings, Inc. (CRWD) \"one of the greatest companies in tech,\" well-known investor Josh Brown on CNBC said that the firm had reported \"unbelievable\" first-quarter results recently.\n\nHe also noted that CrowdStrike Holdings, Inc. (CRWD), which has risen 26% in 2025, is \"one of the best performing stocks of the year.\"\n\nBrown is the CEO of Ritholtz Wealth Management.\n\nCrowdstrike CRWD stock\n\nBrown Raves About CRWD's Q1 Results\n\nCRWD's annual recurring revenue (ARR) jumped 23% in Q1 versus the same period a year earlier, Brown said. According to the investor, \"ARR is \"the only (metric) that matters (because) that's how these stocks are valued.\"\n\nThe firm's subscription revenue surged 31% year-over-year, he added.\n\nBrown Extols the Stock's Performance\n\nThe shares have made up the large amount of ground that CrowdStrike Holdings, Inc. (CRWD) had lost as a result of the IT outage that its software precipitated last summer, Brown noted. Further, the stock was 26% above its 200-day moving average as of midday yesterday, Brown noted.\n\nThe investor, who did not address the company announcement that it would lay off 5% of its workforce, noted that he would hold onto his shares of the name.\n\nWhile we acknowledge the potential of CRWD, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than CRWD but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\n\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\n\nDisclosure: None. This article is originally published at Insider Monkey."
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Thomas Claburn",
    "title": "After that 2024 Windows fiasco, CrowdStrike has a plan – jobs cuts, leaning on AI",
    "description": "CEO: Neural net tech 'flattens our hiring curve, helps us innovate'\nCrowdStrike – the Texas antivirus slinger famous for crashing millions of Windows machines last year – plans to cut five percent of its staff, or about 500 workers, in pursuit of \"greater eff…",
    "url": "https://www.theregister.com/2025/05/07/crowdstrike_trims_workforce_ai/",
    "urlToImage": "https://regmedia.co.uk/2025/05/07/shutterstock_crash.jpg",
    "publishedAt": "2025-05-07T23:28:26Z",
    "content": "CrowdStrike the Texas antivirus slinger famous for crashing millions of Windows machines last year plans to cut five percent of its staff, or about 500 workers, in pursuit of \"greater efficiencies,\" … [+3858 chars]",
    "full_content": "CrowdStrike – the Texas antivirus slinger famous for crashing millions of Windows machines last year – plans to cut five percent of its staff, or about 500 workers, in pursuit of \"greater efficiencies,\" according to CEO and co-founder George Kurtz.\n\nIn a letter to staff, included in a regulatory filing this week, the big cheese explained the change as an effort to move faster and operate more efficiently, citing the alleged transformational power of AI.\n\n\"We’re operating in a market and technology inflection point, with AI reshaping every industry, accelerating threats, and evolving customer needs,\" Kurtz wrote. \"To lead at scale, with nearly 10,000 CrowdStrikers and a clear path to $10 billion in [annual revenue], we are evolving how we operate.\"\n\nThat evolution, he explained, will be driven by AI.\n\n... with AI reshaping every industry, accelerating threats, and evolving customer needs ... We utilize AI, which could expose us to liability or adversely affect our business\n\n\"AI has always been foundational to how we operate,\" said Kurtz. \"AI flattens our hiring curve, and helps us innovate from idea to product faster. It streamlines go-to-market, improves customer outcomes, and drives efficiencies across both the front and back office. AI is a force multiplier throughout the business.\"\n\nIt is also a farce multiplier, or liability, as CrowdStrike explains in the risk disclosure boilerplate that accompanied its aforementioned 10-K regulatory filing with the SEC, America's securities watchdog.\n\n\"We utilize AI, which could expose us to liability or adversely affect our business,\" the cautionary section begins, and then outlines various scenarios in which things might go sideways.\n\n\"For example, generative AI has been known to produce a false or 'hallucinatory' interferences or output, and certain generative AI uses machine learning and predictive analytics, which may be flawed, insufficient, of poor quality, reflect unwanted forms of bias, or contain other errors or inadequacies, any of which may not be easily detectable,\" the passage says, noting that misfires of this sort could harm the biz and/or its customers.\n\nThe obligatory warning concludes by stating AI technology is developing rapidly and that it's impossible to predict all the legal, operational, or technological risks that might follow from using AI.\n\nEnterprise HR biz Workday, also keen on AI and staff cuts – on the order of 8.5 percent – mentions similar concerns in its recent 10-K risk boilerplate.\n\n\"Many of our products are powered by AI, some of which include the use of large language models and generative AI, for use cases that could potentially impact human, civil, privacy, or employment rights and dignities,\" the maker of HR and finance software said, downplaying a \"meritless\" lawsuit \"alleging that our products and services enable discrimination.\"\n\nDespite CrowdStrike's enthusiasm for AI, the threat of import tariffs and the related economic uncertainty may also have something to do with staff reduction.\n\nAnticipating weak demand from Amazon, United Parcel Service in its recent Q1 2025 earnings release cited \"changes in the global trade policy and new or increased tariffs\" as a risk factor, and announced plans to \"reduce our operational workforce by approximately 20,000 positions during 2025 and close 73 leased and owned buildings by the end of June 2025.\"\n\nDelta Air Lines class action cleared for takeoff over CrowdStrike chaos READ MORE\n\nAccording to IT consultancy Janco, companies are looking to automation in lieu of hiring.\n\nCrowdStrike's bet on AI will have to pay off fairly substantially to reach $10 billion in annual revenue. In March, the firm reported $1.06 billion in revenue for its fiscal Q4 2025, which was up 25 percent from the prior quarter. Nonetheless, the security biz lost $92.3 million, having lost $16.8 million during the prior quarter.\n\nThe biz will also incur some cost for shedding employees. In an 8-K filing, CrowdStrike said charges would range from $36 million to $53 million, about $7 million of which will be recognized in fiscal Q1 2026, with the remainder realized in fiscal Q2 2026. ®"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Ramish Cheema",
    "title": "Jim Cramer on CrowdStrike Holdings, Inc. (CRWD): ‘George Kurtz Keeps Winning in Cybersecurity’",
    "description": "We recently published a list of Jim Cramer Reveals Trump’s Potential Secret Weapon In China Trade Talks & Discusses These 10 Stocks. In this article, we are ...",
    "url": "https://finance.yahoo.com/news/jim-cramer-crowdstrike-holdings-inc-172250963.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/BuFcTYdbLMYB15RjLAR20w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/f19224defcc7729b058ac2b2e8bb6d1b",
    "publishedAt": "2025-05-07T17:22:50Z",
    "content": "We recently published a list of Jim Cramer Reveals Trumps Potential Secret Weapon In China Trade Talks &amp; Discusses These 10 Stocks. In this article, we are going to take a look at where CrowdStri… [+4292 chars]",
    "full_content": "We recently published a list of Jim Cramer Reveals Trump’s Potential Secret Weapon In China Trade Talks & Discusses These 10 Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against other stocks that Jim Cramer recently discussed.\n\nIn a recent appearance on CNBC’s Squawk on the Street, Jim Cramer discussed the impacts that tariffs have had on businesses. He shared that firms are scrambling to diversify their supply chains from China as higher costs affect business margins. Using the example of the firm known for making Monopoly and Nerf, Cramer commented:\n\n“Well I mean look everybody’s scrambling, I know that. . .[toy company’s] scrambling everywhere to be able to make it so that a nine dollar toy doesn’t cost 19. And I think that our companies are, often, not given the credit that they deserve to be able to get things to move around, pull their weight, do things overseas, David, it’s not like they’re the only ones, China, that can make this stuff. Cause the stuff is not like, it’s not like making a Grace Blackwell GB200 NVIDIA chip.”\n\nOne material that’s caught Cramer’s attention is ethane. He believes that ethane’s role in the plastics supply chain and the fact that China can’t make it can enable the material to play a key role in President Trump’s trade talks. Cramer commented:\n\n“We have to focus on this ethylene, because it’s the one thing that they’re panicked on in China. They’re not panicked on copper, they’re panicked that they’re not getting ethane, which makes ethylene, which makes plastic. Because boy do they ever make make plastic.”\n\nIn fact, Cramer went as far as to ‘advise’ the President and his team to leverage US ethane production against China:\n\n“But the building block of all that stuff is Louisiana, ethane. If the President and Navarros and these trade guys were to say, you know what guys, we saw that you wouldn’t tariff ethane, cause you need it so bad, we’re done, we’re gonna ship it to Korea. Then see what happens. That’s what they should do. That’s like, free advice there.”\n\nAs for the car industry, Cramer believes that Trump’s advisor Peter Navarro won’t be satisfied even if some car companies build their assembly plans in America. “Peter Navarro would say over and over, we need the engines made we don’t want the assembly,” he believes.\n\nOur Methodology\n\nTo make our list of the stocks that Jim Cramer talked about, we listed down the stocks he mentioned during CNBC’s Squawk on the Street aired on May 1st.\n\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here)."
  },
  {
    "source": {
      "id": null,
      "name": "Investopedia"
    },
    "author": "Andrew Kessel",
    "title": "CrowdStrike Stock Slides as Cybersecurity Firm Plans Job Cuts",
    "description": "Crowdstrike shares slid Wednesday, a day after the cybersecurity company said in a regulatory filing it plans to cut roughly 500 jobs, or 5% of its workforce...",
    "url": "https://www.investopedia.com/crowdstrike-stock-slides-as-cybersecurity-firm-plans-job-cuts-11729958",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/KKATnfsmpLSkVZ8EowQeng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/investopedia_245/289b4b04af593a1e55d49730297fc4b7",
    "publishedAt": "2025-05-07T18:30:22Z",
    "content": "Benjamin Fanjoy / Bloomberg via Getty Images\r\n<ul><li>Cybersecurity company CrowdStrike Holdings said in a regulatory filing Tuesday that it plans to cut 500 jobs, or 5% of its workforce.\r\n</li><li>C… [+1567 chars]",
    "full_content": "Key Takeaways Cybersecurity company CrowdStrike Holdings said in a regulatory filing Tuesday that it plans to cut 500 jobs, or 5% of its workforce.\n\nCrowdStrike expects to incur between $36 million and $53 million in layoff-related charges, including $7 million in its fiscal 2026 first quarter, the filing said.\n\nIn a letter to employees, CrowdStrike CEO George Kurtz said, \"AI flattens our hiring curve.\"\n\nCrowdStrike Holdings (CRWD) shares slid Wednesday, a day after the cybersecurity company said in a regulatory filing it plans to cut roughly 500 jobs, or 5% of its workforce.\n\nCrowdStrike \"continues to scale its business with focus and discipline\" toward a target of $10 billion in ending annual recurring revenue (ARR), it said Tuesday. In March, the company reported ending ARR of $4.24 billion as of Jan. 31.\n\nCrowdStrike expects to incur between $36 million and $53 million in layoff-related charges, including $7 million in its fiscal 2026 first quarter, the filing said. The company plans to report current-quarter results on June 3, with those charges excluded from its adjusted figures.\n\nThe company added it sees Q1 results \"in-line with or above\" its March guidance and affirmed its full-year outlook.\n\nAI 'Flattens Our Hiring Curve,' CEO Says\n\nIn a letter to employees, CEO George Kurtz said CrowdStrike is at a \"market and technology inflection point, with AI reshaping every industry.\"\n\n\"AI flattens our hiring curve, and helps us innovate from idea to product faster,\" Kurtz added. \"It streamlines go-to-market, improves customer outcomes, and drives efficiencies across both the front and back office.\"\n\n\n\nShares of CrowdStrike fell 5% in recent trading but are up 23% in 2025."
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Price Target on CrowdStrike (CRWD) Raised by Japanese Bank After Layoffs",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_4d573d11-a3d3-49d9-bcfe-708d6986101a",
    "urlToImage": null,
    "publishedAt": "2025-05-07T18:33:53Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "techradar",
      "name": "TechRadar"
    },
    "author": "waynewilliams@onmail.com (Wayne Williams)",
    "title": "The Gr-AI-m Reaper: Hundreds of jobs at IBM and Crowdstrike vanish as artificial intelligence makes humans more dispensable",
    "description": "CrowdStrike and IBM lay off hundreds of human workers as AI takes over critical tasks once handled by people.",
    "url": "https://www.techradar.com/pro/security/the-gr-ai-m-reaper-hundreds-of-jobs-at-ibm-and-crowdstrike-vanish-as-artificial-intelligence-makes-humans-more-dispensable",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/7YSmYZCfTNzJeivwGhrD9L.png",
    "publishedAt": "2025-05-10T17:32:00Z",
    "content": "<ul><li>AI threatens jobs across sectors from routine work to skilled professions</li><li>CrowdStrike cuts 500 jobs citing efficiency and AI-driven restructuring</li><li>IBM uses AI to streamline HR … [+2955 chars]",
    "full_content": "AI threatens jobs across sectors from routine work to skilled professions\n\nCrowdStrike cuts 500 jobs citing efficiency and AI-driven restructuring\n\nIBM uses AI to streamline HR while increasing hires in tech roles\n\nMany people worry the rise of AI and robotics could lead to job losses, as machines become increasingly capable of performing tasks faster, cheaper, and more accurately than humans, concerns have grown about the long-term impact on employment, wages, and job security.\n\nEven skilled professions, such as those in healthcare, finance, law, and technology, may not be immune. The growing capabilities of AI suggest that no sector is entirely safe from disruption.\n\nThese concerns are no longer hypothetical, they're becoming reality for some IT workers, after CrowdStrike recently announced it is cutting 500 jobs, which equates to around 5% of its workforce.\n\nRealigning the business\n\nIn a memo announcing the cuts, the security firm's CEO George Kurtz said, “CrowdStrike is defined by our mission to stop breaches, our disciplined execution, and our commitment to protecting customers.\"\n\n\"Today, our customers are facing an intensifying threat landscape and growing complexity. They trust us to help them move faster and operate more securely. To keep earning that trust, we are evolving how we operate.\"\n\nExplained the company would be \"realigning\" parts of the business \"to continue scaling with focus and discipline\" and explained that: “AI has always been foundational to how we operate. AI flattens our hiring curve, and helps us innovate from idea to product faster. It streamlines go-to-market, improves customer outcomes, and drives efficiencies across both the front and back office. AI is a force multiplier throughout the business.”\n\nCrowdStrike isn’t the only tech firm cutting jobs because of AI.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThe Wall Street Journal reports IBM has, “used artificial intelligence, and specifically AI agents, to replace the work of a couple hundred human resources workers.”\n\nHowever, as a result of these cuts, it was able to hire more programmers and sales and marketing people.\n\n“While we have done a huge amount of work inside IBM on leveraging AI and automation on certain enterprise workflows, our total employment has actually gone up, because what it does is it gives you more investment to put into other areas,” IBM CEO Arvind Krishna told the publication.\n\nSo while AI might be taking some people’s jobs, it’s resulting in an increase of opportunities in other areas.\n\nKrishna also urged the Trump administration to increase, rather than cut, federal AI R&D funding, telling TechCrunch:\n\n“We have been an extremely strong advocate - and this is both the company and me personally - on that federally funded R&D should be increased. That’s the position, which is unequivocal, and we strongly believe in that.”"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Tony Bradley, Senior Contributor, \n Tony Bradley, Senior Contributor\n https://www.forbes.com/sites/tonybradley/",
    "title": "Why Every CISO Should Be Gunning For A Seat At The Board Table",
    "description": "CrowdStrike CEO George Kurtz urges CISOs to step into boardroom roles as cyber risk becomes a top governance issue, outlining how to earn a seat at the table.",
    "url": "https://www.forbes.com/sites/tonybradley/2025/05/09/why-every-ciso-should-be-gunning-for-a-seat-at-the-board-table/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681e312021b05a3b8870d1d4/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-09T16:50:01Z",
    "content": "CrowdStrike CEO George Kurtz challenges CISOs to evolve into boardroom-ready leaders as ... More cybersecurity becomes a top governance priority.\r\ngetty\r\nCrowdStrike CEO George Kurtz walked onto the … [+5662 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Moz Farooque",
    "title": "CrowdStrike Probed Over $32M IRS Deal",
    "description": "DOJ and SEC question execs' knowledge amid potential pre-booking concerns",
    "url": "https://finance.yahoo.com/news/crowdstrike-probed-over-32m-irs-200840194.html",
    "urlToImage": "https://media.zenfs.com/en/us.finance.gurufocus/554877a846d24913f9f0c7b1c713b727",
    "publishedAt": "2025-05-09T20:08:40Z",
    "content": "Crowdstrike (NASDAQ:CRWD) dips after DOJ and SEC probe executives' roles in a $32 million Carahsoft-IRS deal.\r\nU.S. prosecutors and regulators are scrutinizing a 2023 agreement under which CrowdStrik… [+1873 chars]",
    "full_content": "Crowdstrike (NASDAQ:CRWD) dips after DOJ and SEC probe executives' roles in a $32 million Carahsoft-IRS deal.\n\nU.S. prosecutors and regulators are scrutinizing a 2023 agreement under which CrowdStrike sold cybersecurity services to the IRS via Carahsoft, despite no products ever being purchased.\n\nShares slid about 3% on Friday after Bloomberg reported that the Department of Justice and Securities and Exchange Commission are investigating what senior executives knew and whether the transaction was properly accounted for.\n\nThe 2023 dealstructured as four $8 million paymentscould have swung CrowdStrike's revenue and ARR metrics, and the company later excluded roughly $26 million from its annual recurring revenue, citing distributor-transferability issues.\n\nInvestigators have interviewed former staff about potential pre-booking or channel-stuffing practices and are reviewing responses to Sarbanes-Oxley compliance questionnaires. They've expanded their review to other federal contracts, including a $1 million-plus IRS order and multi-million-dollar deals with the Departments of Health and Human Services and Energy.\n\nCrowdStrike's spokesperson, Kevin Benacci, reiterated that we stand by the accounting of the transaction, while Carahsoft says it continues to support the deal. Regulators have also obtained internal records showing at least one employee flagged concerns about the transaction's completeness.\n\nWhy It Matters: The probes highlight legal, financial and reputational risks for cybersecurity firms when large distributor transactions skirt delivery and revenue recognition norms.\n\nCrowdStrike Probed Over $32M IRS Deal\n\nInvestors will look to CrowdStrike's Q2 earnings call for updates on legal reserves and any impact on guidance. As of May 9, 2025, CrowdStrike Holdings has a GF Value of $363.59, with the stock currently trading above fair value, signaling it is modestly overvalued. The price trend has outpaced GF Value estimates, suggesting investor enthusiasm may be running ahead of fundamentals.\n\nThis article first appeared on GuruFocus.\n\n"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "CrowdStrike workforce cuts not indication of slow down in demand, says Jefferies",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_41160c02-3573-4f43-8912-83d5eaaf8c62",
    "urlToImage": null,
    "publishedAt": "2025-05-08T15:20:13Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "South Africa’s Ramaphosa Unveils New Reforms to Stoke Growth",
    "description": "",
    "url": "https://biztoc.com/x/bbb06c13448c4e81",
    "urlToImage": "https://biztoc.com/cdn/bbb06c13448c4e81_s.webp",
    "publishedAt": "2025-05-07T15:38:24Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Apple Watch sales drop again? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are US-China trade talks impact… [+962 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "US and UK Set to Make Trade Announcements",
    "description": "",
    "url": "https://biztoc.com/x/61c55f8762de15f7",
    "urlToImage": "https://biztoc.com/cdn/61c55f8762de15f7_s.webp",
    "publishedAt": "2025-05-08T13:28:14Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;What impact will the US-UK trade deal have? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are Trump tariffs affecti… [+976 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "BOE Set to Turn Dovish as US Tariffs Risk Growth: Decision Guide",
    "description": "",
    "url": "https://biztoc.com/x/16c33caa79e905fe",
    "urlToImage": "https://biztoc.com/cdn/16c33caa79e905fe_s.webp",
    "publishedAt": "2025-05-07T23:58:47Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did the Fed hold rates amid tariff uncertainty? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-China tra… [+987 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "Reeves to Break Fiscal Rule by £57 Billion Ahead of Next Budget",
    "description": "",
    "url": "https://biztoc.com/x/40bb7fe64e8fa402",
    "urlToImage": "https://biztoc.com/cdn/40bb7fe64e8fa402_s.webp",
    "publishedAt": "2025-05-07T23:58:38Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did the Fed hold rates amid tariff uncertainty? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-China tra… [+995 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "barrons.com",
    "title": "The Fed’s Next Move Depends on Tariffs. It Could Take a While",
    "description": "",
    "url": "https://biztoc.com/x/d563bc22f146011a",
    "urlToImage": "https://biztoc.com/cdn/d563bc22f146011a_s.webp",
    "publishedAt": "2025-05-07T23:47:28Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did the Fed hold rates amid tariff uncertainty? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-China tra… [+943 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "Judge Says He May Order US to Facilitate Return of Venezuelans",
    "description": "",
    "url": "https://biztoc.com/x/96d84b4f0a0fd247",
    "urlToImage": "https://biztoc.com/cdn/96d84b4f0a0fd247_s.webp",
    "publishedAt": "2025-05-07T23:58:39Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did the Fed hold rates amid tariff uncertainty? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-China tra… [+983 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "marketwatch.com",
    "title": "E.U. threatening U.S. with €95 billion in tariffs if trade talks fail",
    "description": "",
    "url": "https://biztoc.com/x/48a8db6db913db89",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-08T12:21:20Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;What impact will the US-UK trade deal have? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are Trump tariffs affecti… [+982 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "edition.cnn.com",
    "title": "Krispy Kreme pauses its doughnut partnership with McDonald’s",
    "description": "",
    "url": "https://biztoc.com/x/0cd48c4eb05d7687",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-08T12:32:27Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;What impact will the US-UK trade deal have? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are Trump tariffs affecti… [+977 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "The Cheesecake Factory (CAKE): Deeply Misunderstood and Undervalued Restaurant Stock?",
    "description": "",
    "url": "https://biztoc.com/x/d81dffeba4ea51ab",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-07T15:38:19Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Apple Watch sales drop again? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are US-China trade talks impact… [+942 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "Canada Banks Keep Climate Pledges as Rival RBC Drops Targets",
    "description": "",
    "url": "https://biztoc.com/x/388896c334d7463d",
    "urlToImage": "https://biztoc.com/cdn/388896c334d7463d_s.webp",
    "publishedAt": "2025-05-07T15:38:37Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Apple Watch sales drop again? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are US-China trade talks impact… [+962 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Uber earnings: Stock drops despite upbeat current quarter guidance",
    "description": "",
    "url": "https://biztoc.com/x/d031ce41c6b5e954",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-07T12:17:23Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why is CrowdStrike cutting 5% of its workforce? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How are banks keeping cre… [+994 chars]",
    "full_content": ""
  }
]