[
  {
    "source": {
      "id": null,
      "name": "Quartz India"
    },
    "author": "Michael Barclay",
    "title": "Cisco enters the quantum race",
    "description": "Cisco Systems (CSCO) became the latest tech company to announce a new quantum computing chip, following similar announcements in the last six months from Google, IBM, and Microsoft. With each new development, the timeline for the technology to scale up and se…",
    "url": "https://qz.com/quantum-computing-chip-cisco-systems-1851779544",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e095aba97ec93189fa0e4ec21f2463d9.jpg",
    "publishedAt": "2025-05-07T16:20:00Z",
    "content": "In This Story\r\nCisco Systems (CSCO) became the latest tech company to announce a new quantum computing chip, following similar announcements in the last six months from Google, IBM, and Microsoft. Wi… [+2511 chars]",
    "full_content": "Cisco Systems (CSCO-0.12% ) became the latest tech company to announce a new quantum computing chip, following similar announcements in recent months from Google, IBM, and Microsoft. With each new development, the timeline for the technology to scale up and see use in real-world situations gets shorter and shorter.\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\nWhile Nvidia (NVDA-1.54% ) CEO Jensen Huang said in January that quantum computing would not be usable for at least 20 years — which sent stocks of quantum companies tumbling — Cisco and others say the revolution might begin as early as 2030.\n\nAdvertisement\n\nOne Cisco exec said that quantum is about to have its “ChatGPT moment,” at which point skeptics recognize the exponential advances and practical uses of a once-fantastical technology. Of course, skepticism remains.\n\nAdvertisement\n\nCisco’s contribution to the sector is its new entanglement source chip, revealed yesterday. Entanglement is when two particles are connected even over a vast range, via quantum teleportation. Albert Einstein called this “spooky action at a distance.” Cisco claimed its chip generates up to one million entangled photon pairs per second, at room temperature, meaning less energy use.\n\nAdvertisement\n\nThe company also said the chip is compatible with existing fiber-optic infrastructure and uses less than one megawatt of power; traditional supercomputers use upwards of 30 megawatts. Cisco’s chip “enables quantum networks to scale,” the company said in a press release.\n\nIt’s that vendor-agnostic network that the company aims to assist all companies building quantum processors: “By building this infrastructure now, Cisco is helping to accelerate the entire quantum ecosystem,” it said. “This approach mirrors Cisco’s historical strength in networking—we don’t need to pick winners because we’re building the networking fabric that will enable various quantum technologies to scale.”\n\nAdvertisement\n\nQuantum technology runs on qubits — as opposed to traditional bits in coding — and the challenge is to use more qubits, which are incredibly fragile and susceptible to interference, while reducing errors. Quantum-error correction has been the industry’s biggest challenge for the past 30 years.\n\nIBM’s (IBM+0.27% ) chips have more qubits than Google’s (GOOGL-1.57% ) but the latter claims their chips are more reliable — even while using more qubits. Microsoft (MSFT-0.92% ) announced its own quantum chip in February, using fewer qubits and again claiming it was less error-prone than competitors’.\n\nAdvertisement\n\nPotential uses of quantum technology include the development of energy alternatives, new drugs, and superior battery power.\n\nIt also raises serious cybersecurity concerns, with its ability to break through data encryption.\n\n\n\nAdvertisement\n\nCisco also announced it’s opening a quantum lab in Santa Monica, California.\n\n\n\n"
  },
  {
    "source": {
      "id": null,
      "name": "Quartz India"
    },
    "author": "Catherine Baab",
    "title": "Walmart, Cisco, Alibaba, Petrobras: Stocks to watch this week",
    "description": "Markets ended last week on a high after a turbulent stretch, with stocks rallying as investors absorbed a flurry of headlines: The Fed held rates steady, a tentative U.S.-U.K. trade deal emerged, and Alphabet’s ongoing antitrust saga took a twist as Apple’s E…",
    "url": "https://qz.com/wmt-csco-crwv-pbr-stocks-earnings-nasdaq-sp500-djia-1851779921",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/dba66f97cffd55b894c0ac4e66a487e1.jpg",
    "publishedAt": "2025-05-11T09:00:00Z",
    "content": "In This Story\r\nMarkets ended last week on a high after a turbulent stretch, with stocks rallying as investors absorbed a flurry of headlines: The Fed held rates steady, a tentative U.S.-U.K. trade de… [+3213 chars]",
    "full_content": "Markets ended last week on a high after a turbulent stretch, with stocks rallying as investors absorbed a flurry of headlines: The Fed held rates steady, a tentative U.S.-U.K. trade deal emerged, and Alphabet’s ongoing antitrust saga took a twist as Apple’s Eddy Cue testified about waning search volumes.\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\nThis week may offer a relative breather, but there’s still plenty in play. Earnings season is winding down, yet several big names are still set to report, including the planet’s largest retailer by revenue, Walmart (WMT+0.77% ).\n\nAdvertisement\n\nMeanwhile, key economic data — including April inflation and retail sales — will test whether the market’s rally has legs. A potential U.S.-China trade breakthrough also lingers in the background, though expectations are mixed.\n\nAdvertisement\n\nMonday, May 12\n\nEarnings kick off with a global slate. Mall operator Simon Property Group (SPG-0.95% ) will report alongside NRG Energy (NRG-1.19% ) and Fox Corporation (FOXA-0.75% ), owner of Fox News and more.\n\nAdvertisement\n\nOn the macro front, the U.S. Treasury’s April budget statement lands in the afternoon, offering a fiscal snapshot as deficit debates simmer.\n\nTuesday, May 13\n\nLook out for inflation data: The April Consumer Price Index drops at 8:30 a.m. ET, giving investors a key read on inflation. Earnings-wise, Oil major Petrobras (PBR-2.33% ) and Sony (SONY+0.54% ) lead alongside Sea Limited (SE-0.48% ), the Singaporean tech conglomerate, and JD.com (JD-1.32% ). Vodafone (VOD+1.77% ) is on deck too.\n\nAdvertisement\n\nWednesday, May 14\n\nIt’ll be a quieter day on the data front, but Cisco Systems (CSCO-0.12% ) reports after the bell, with expected EPS of $0.75 — slightly ahead of last year’s $0.72 — providing insights into enterprise tech demand, a closely watched signal these days. Ambev S.A. (BUD+0.91% ), the Brazilian brewer in which Inbev is a large shareholder, and CoreWeave, a rising AI infrastructure player, will also report.\n\nAdvertisement\n\nThursday, May 15\n\nBuckle up for a data deluge. At 8:30 a.m. ET, the April Producer Price Index and Retail Sales report hits, alongside regional reads from the Empire State and Philly Fed manufacturing surveys. At 9:15: Industrial Production and Capacity Utilization. At 10:00: March Business Inventories.\n\nAdvertisement\n\nOn the earnings side: Walmart leads, giving analysts a real-time snapshot of U.S. consumer health, especially among lower- and middle-income households. As the world’s largest retailer, Walmart’s results portray broad retail trends, inflation pressures, and shifts in spending behavior. Attention is likely to be extra high this week amid hopes of a U.S.-China trade deal and signs of a widening gap between lower-income Americans’ sentiment and Wall Street’s recent bullish run.\n\nExpect results from Chinese tech giant Alibaba (BABA+0.19% ), John Deere (DE-0.26% ), Applied Materials (AMAT+0.21% ), and NetEase (NTES+0.29% ) to drop too.\n\nAdvertisement\n\nFriday, May 16\n\nThe week wraps with a trio of economic reads. At 8:30 a.m. ET, April’s Import and Export Price Indexes offer a window into goods inflation, while Housing Starts and Building Permits reveal the pulse of new construction. At 10:00 a.m., the University of Michigan’s Consumer Sentiment Index offers an early read on May’s mood.\n\nAdvertisement\n\nAs usual, Earnings season ends with a whimper and not a bang, as results trickle in from a handful of overseas names. Unless geopolitical headlines break late, markets may exhale after a particularly breathless run."
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Cisco Systems, Inc. (CSCO): Among the Best Income Stocks to Invest in Now",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_18159b7e-843f-4948-a5ff-bf5917a45cb7",
    "urlToImage": null,
    "publishedAt": "2025-05-10T08:12:13Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "MakeUseOf"
    },
    "author": "Yadullah Abidi",
    "title": "If Your Router Is on This FBI List, You Need to Upgrade It Immediately",
    "description": "Say goodbye to your trusty old router.",
    "url": "https://www.makeuseof.com/router-fbi-list-upgrade-immediately/",
    "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2024/10/old-wifi-router-as-wifi-repeater.JPG",
    "publishedAt": "2025-05-08T23:57:52Z",
    "content": "Routers are critical pieces of network infrastructure that can last for decades at a time. But if they are too old, hackers might come knocking.\r\nOld Routers Are a Threat to Your Network\r\nThe FBI has… [+3061 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Is Cisco Systems, Inc. (CSCO) the Best Dow Stock?",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_75d1647e-d9f9-4a3c-9643-b4ae6238956d",
    "urlToImage": null,
    "publishedAt": "2025-05-07T18:56:46Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Internet"
    },
    "author": "info@thehackernews.com (The Hacker News)",
    "title": "Cisco Patches CVE-2025-20188 (10.0 CVSS) in IOS XE That Enables Root Exploits via JWT",
    "description": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a susceptible system.\nThe vulnerability, tracked as CVE-2025-201…",
    "url": "https://thehackernews.com/2025/05/cisco-patches-cve-2025-20188-100-cvss.html",
    "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj92cib0dDV9Fw6RYhZV2gWh_gOqnCcgTxV6qZbqJPkpHQlNPSwGBpB5zo0Ln6_3sslAfm-j04tstprfSGhf64_GDzkyMzXyrJA1NpKsVthdBBXMX1DSYJ_mykSpQWqDRcfNfF0C03OaU37Q7D-IacTEF4ds28haxJFAUfVrjaGE8OrqvQJNAj5AYlcIjaN/s728-rw-e365/ciso.jpg",
    "publishedAt": "2025-05-08T04:57:00Z",
    "content": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a su… [+1785 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Brandon Vigliarolo",
    "title": "DOGE worker's old creds found exposed in infostealer malware dumps",
    "description": "PLUS: Celsius scammer sent to slammer; Death-by-hacking victim warns you're never safe; and more\nInfosec in brief Good cybersecurity habits don't appear to qualify anyone to work at DOGE, as one Musk minion seemingly fell victim to infostealer malware.…",
    "url": "https://www.theregister.com/2025/05/12/doge_cyber_experts_creds_found/",
    "urlToImage": "https://regmedia.co.uk/2025/03/13/shutterstock_doge_warning.jpg",
    "publishedAt": "2025-05-12T04:30:11Z",
    "content": "Infosec in brief Good cybersecurity habits don't appear to qualify anyone to work at DOGE, as one Musk minion seemingly fell victim to infostealer malware.\r\nDeveloper and journalist Micah Lee reporte… [+5831 chars]",
    "full_content": "Infosec in brief Good cybersecurity habits don't appear to qualify anyone to work at DOGE, as one Musk minion seemingly fell victim to infostealer malware.\n\nDeveloper and journalist Micah Lee reported last Thursday that he found a whopping 51 data breach records and four infostealer log dumps associated with DOGE employee Kyle Schutt on data breach tracking service Have I Been Pwned (HIBP) – which is unnerving as Schutt has access to sensitive government data at the Federal Emergency Management Agency.\n\nAs Lee pointed out, 51 breach records on HIBP is a lot, but excusable because while Schutt’s info was found in records associated with a 2013 Adobe breach, the 2016 LinkedIn breach, and Gravatar’s 2020 breach, none of those incidents involved Schutt’s personal machines.\n\nWhat is attributable to a lapse of security hygiene, however, are the four infostealer logs that link to Schutt. Such logs contain usernames and passwords stolen by infostealer malware, suggesting one or more of Schutt's computers were compromised at some point.\n\nAccording to Lee, account credentials linked to Schutt were found in the 100GB Naz.API dump that contained 71 million unique email addresses and password combinations, the ALIEN TXTBASE stealer dump containing 284 million unique accounts, an un-named July 2024 dump collated from malicious Telegram channels, and another massive stealer log added to HIBP in January 2025.\n\n\"I have no way of knowing exactly when Schutt's computer was hacked, or how many times,\" Lee pointed out, adding that evidence of infostealers means he fervently hopes DOGE staff are not using personal machines to access government records.\n\nWe asked Schutt for comment at his DOGE email address, which someone leaked online not long ago, but didn't hear back.\n\nCritical vulnerabilities of the week: A Cisco perfect 10 Cisco patched a CVSS 10.0 vulnerability in the image download feature of Cisco IOS XE for WLCs last week. The flaw allows an unauthenticated remote attacker to upload arbitrary files to target systems, but only when particular settings are enabled. The vulnerability, CVE-2025-20188 is found in the out-of-band access point image download feature. If that’s not enabled, the CVE goes from 10.0 to zero. Can't install this patch now? Then just disable that feature until you can. Elsewhere: CVSS 9.8 - CVE-2024-6047: Several EoL GeoVision devices are vulnerable to OS command injection due to failing to filter user input. Check the link for affected models.\n\nCVSS 9.8 - CVE-2024-11120: More EoL GeoVision command injection vulns, and these are under active exploit. Again, check the link for affected models. \\\n\nCVSS 9.8 - CVE-2025-3248: Langflow versions prior to 1.3.0 are vulnerable to code injection via crafted HTTP requests from remote unauthenticated users.\n\nCVSS 8.8 - CVE-2025-32819: SonicWall SMA100 devices allow remote authenticated users with SSLVPN user privileges to delete files. One result of that deletion can be a reboot to factory default settings.\n\nCVSS 8.3 - CVE-2025-32820: SonicWall SMA100 devices allow remote authenticated users with SSLVPN user privileges to inject path traversal sequences that make any directory on a targeted device writable.\n\nCVSS 8.1 - CVE-2025-27363: FreeType versions 2.13.0 and below are vulnerable to an out of bounds write allowing arbitrary code execution. This is under active exploitation.\n\nDirector of hacked-to-death UK business warns eternal cyber vigilance essential\n\nPaul Abbott wants everyone to know that cybersecurity never reaches a level at which you can relax. He ought to know - the 160-year old haulage firm he led went into administration in 2023 on his watch for that very reason.\n\nPer the BBC, Kettering-based business Knights of Old was hit by a ransomware attack two years ago that corrupted internal data so much that the company was unable to meet reporting deadlines set by its lenders. That left the firm, which founded in 1865 with just a single horse and cart before growing into one of the largest privately owned logistics firms in the UK, with no option but to enter administration.\n\n\"We felt we were in a very good place in terms of our security, our protocols, the measures we'd gone to protect the business,\" Abbott told the BBC. He was wrong, and the company closed and let go of some 730 staff.\n\n\"Whatever you think you've done, seriously get it checked by experts,\" Abbott added. \"People don't think it's going to happen to them.\"\n\nLockBit pwned again\n\nThe LockBit ransomware gang is nothing if not persistent but appears unable to protect its own infrastructure as unknown attackers have apparently broken into the group and spilled a whole bunch of internal data online.\n\nAfter barely surviving an international takedown attempt, Russia-linked LockBit has soldiered on, but its online admin panel disappeared last week – replaced by a message stating \"Crime is bad\" and link to a MySQL data dump full info about the ransomware crew’s operations.\n\nIn the dump were 59,975 unique bitcoin addresses, a table listing custom builds created by affiliates, configuration tables for those builds, a list of targets on which those builds were used, public keys (but no private ones), and chat records containing 4,442 negotiation discussions between LockBit operators and ransomware victims.\n\nLockBitSupp, the crew’s suspected boss, confirmed the breach in a discussion with the threat actor who first reported the matter on X.\n\nCelsius ponzi kingpin jailed for a dozen years\n\nFollowing his guilty plea in December 2024, the CEO of collapsed crypto firm Celsius has been sentenced to 12 years in prison, ordered to pay a $50k fine, and forced to forfeit more than $48 million in misappropriated funds.\n\nAlex Mashinsky was jailed for commodities fraud and securities fraud. The US Department of Justice described his activities as \"a yearslong scheme to mislead customers\" about Celsius' proprietary token, CEL, which he and other company leaders manipulated.\n\nMashinsky made repeated false public statements about Celsius' market activity, the DoJ said, while he and other company leaders kept buying more CEL to pump its value while simultaneously selling it to others. ®"
  },
  {
    "source": {
      "id": null,
      "name": "Internet"
    },
    "author": "info@thehackernews.com (The Hacker News)",
    "title": "Initial Access Brokers Target Brazil Execs via NF-e Spam and Legit RMM Trials",
    "description": "Cybersecurity researchers are warning of a new campaign that's targeting Portuguese-speaking users in Brazil with trial versions of commercial remote monitoring and management (RMM) software since January 2025.\n\"The spam message uses the Brazilian electronic …",
    "url": "https://thehackernews.com/2025/05/initial-access-brokers-target-brazil.html",
    "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiEVYpFrzp-PUcjGm74RCwENSj_02YeupTuK2XQbUxSfjyxs3mDqfkA1Dg62nWadzPdzeWmefDkqi8WNm0W1eZzjHNrIRLu9BtZkFMLFFWUwWpPeTrOcAnOb5tPcxJLKaUgBkysP7-24eFr1U3TBJ0BHF4_0DkBDSWpjJ580fNfMFxMzHfKpJe-hl4kWLf6/s728-rw-e365/rrm.jpg",
    "publishedAt": "2025-05-09T11:40:00Z",
    "content": "Cybersecurity researchers are warning of a new campaign that's targeting Portuguese-speaking users in Brazil with trial versions of commercial remote monitoring and management (RMM) software since Ja… [+3874 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Cisco Systems, Inc. (CSCO): Among the Cheap ESG Stocks to Buy According to Hedge Funds",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_199341a1-b641-48da-94c1-688e67a37e02",
    "urlToImage": null,
    "publishedAt": "2025-05-08T13:47:50Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Simon Sharwood",
    "title": "Nutanix stops being so opinionated about where data must dwell",
    "description": "Shifts data services to containers and goes back to the future with Pure Storage tie-in\nNext Nutanix is moving beyond its hyperconverged roots by creating containerized versions of its data services and more external storage options, in ways that make it a be…",
    "url": "https://www.theregister.com/2025/05/07/nutanix_next_cloud_native_shift/",
    "urlToImage": "https://regmedia.co.uk/2025/05/07/shutterstock_cloudy_shrug.jpg",
    "publishedAt": "2025-05-07T14:15:15Z",
    "content": "Next Nutanix is moving beyond its hyperconverged roots by creating containerized versions of its data services and more external storage options, in ways that make it a better target for those migrat… [+3414 chars]",
    "full_content": "Next Nutanix is moving beyond its hyperconverged roots by creating containerized versions of its data services and more external storage options, in ways that make it a better target for those migrating away from VMware.\n\nThe hyperconverged upstart has always had a small dichotomy in its approach, in the form of an insistence that its own software-defined storage was non-negotiable even as it had no opinion about which hypervisor or other infrastructure its customers should use.\n\nThat stance softened last year when Nutanix made it possible to use Dell's PowerFlex storage boxes with its own stack.\n\nAt its Next conference in Washington DC today, Nutanix again offered its customers more storage options.\n\nOne is the chance to run its data services – replication, data recovery and snapshots – in containers, outside the Nutanix platform and on a container runtime instead of under a hypervisor on its own platform.\n\nThe shift reflects Nutanix's belief that the rise and rise of containers means data is now distributed across more applications, runtimes, and types of infrastructure. Providing data services that can run everywhere but still provide unified management for data wherever it resides therefore fits Nutanix's mission of providing a hybrid cloud management platform that can go wherever workloads run. It may also help Nutanix to do better on the edge, as the containerized data services can also run on bare metal Linux – an environment the company thinks will become prevalent in edge devices.\n\nThe containerized data services are called \"Cloud Native AOS\" and currently are only available as a preview on Amazon Web Services' EKS service. Nutanix intends to bring it to more Kubernetes implementations in the future.\n\nAnother softening of Nutanix's storage stance is expressed in a tie-up with Pure Storage that means its Cloud Infrastructure Solution will become able to use Pure's FlashArrays as external storage.\n\nRival virtualization platforms have relied on external storage for decades, a requirement that was sometimes so tricky to implement that big vendors invented \"converged infrastructure\" to pre-integrate compute, storage, and a network to bind them together.\n\nHyperconverged infrastructure came along and did the same thing – but made it cheaper and less complex by placing storage in servers instead of proprietary arrays.\n\nAnd here we are now in 2025 with Nutanix, the upstart champion of hyperconvergence, now linked to two of the main storage hardware players.\n\nOmnissa adds Nutanix support Also at Next, Omnissa - the former VMware end-user compute business spun out last year as an independent company – announced its Horizon virtual apps and desktops platform can now run under Nutanix's Acropolis hypervisor. It's hard to imagine a more striking declaration of independence by Omnissa, or a more satisfying endorsement for Nutanix.\n\nThe Pure tie-up is said to \"deliver a customer experience uniquely designed for high-demand data workloads, including AI.\"\n\nWhich is a fair enough reason to offer an option other than software-defined storage, as dedicated storage devices are built for speeds in ways that storage-centric servers may not be.\n\nThe partnership is also designed to make Nutanix a more attractive target for VMware refugees, who are often accustomed to working with external storage. Nutanix argues its licensing will work out cheaper than VMware's when users employ Pure's boxes. The company is prepared to discuss future pricing for this option, presumably because those contemplating a move away from VMware have recent experience with sudden licensing changes and are keen to avoid another round.\n\nAnother element of the tie-up brings Cisco into play, as the networking giant has teamed with Pure to add the option to run Nutanix on the jointly developed FlashStack validated designs.\n\nDoing so deepens the Nutanix-Cisco relationship, forged when Switchzilla binned its own hyperconverged play and made Nutanix its preferred partner. ®"
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Iain Thomson",
    "title": "Feds disrupt proxy-for-hire botnet, indict four alleged net miscreants",
    "description": "The FBI also issued a list of end-of-life routers you need to replace\nEarlier this week, the FBI urged folks to bin aging routers vulnerable to hijacking, citing ongoing attacks linked to TheMoon malware. In a related move, the US Department of Justice unseal…",
    "url": "https://www.theregister.com/2025/05/10/router_botnet_crashed/",
    "urlToImage": "https://regmedia.co.uk/2023/01/13/router_shutterstock.jpg",
    "publishedAt": "2025-05-10T14:02:08Z",
    "content": "Earlier this week, the FBI urged folks to bin aging routers vulnerable to hijacking, citing ongoing attacks linked to TheMoon malware. In a related move, the US Department of Justice unsealed indictm… [+3279 chars]",
    "full_content": "Earlier this week, the FBI urged folks to bin aging routers vulnerable to hijacking, citing ongoing attacks linked to TheMoon malware. In a related move, the US Department of Justice unsealed indictments against four foreign nationals accused of running a long-running proxy-for-hire network that exploited outdated routers to funnel criminal traffic.\n\nIn a FLASH bulletin [PDF] on Wednesday, the FBI warned that aging routers from Linksys, Ericsson, and Cisco, commonly found in homes and small businesses, were being actively targeted by cybercriminals.\n\nThese devices, long past their update window, were compromised and made available for sale as part of a criminal proxy network marketed through the 5socks and Anyproxy domains. The botnet provided anonymity to malicious users and enabled a range of cybercrime, including distributed denial of service (DDoS) attacks, according to federal investigators and security researchers.\n\nHere are the dusty old routers you need to watch out for:\n\nLinksys E1200, E2500, E1000, E4200, E1500, E300, E3200, E1550 and WRT320N, WRT310N, WRT610N kit\n\nThe Ericsson Cradlepoint E100 router\n\nThe Cisco Valet M10\n\nA DoJ indictment issued on Friday offered more details on how the botnets allegedly operated. The operators charged between $9.95 and $110 per month for access to what they claimed were over 7,000 residential proxies, the indictment claims. Prosecutors believe the scheme pulled in more than $46 million, with the website boasting it had been \"Working since 2004!\"\n\nNot anymore, since the domain running the attacks has been seized in what the Feds are calling Operation Moonlander.\n\nYou've been pwned- Click to enlarge\n\nA separate FBI PSA issued Wednesday described a wave of router infections using TheMoon malware, consistent with the timing of the domain seizure takedown. TheMoon, first identified in 2014, is notorious for infecting routers via open ports and vulnerable scripts. In March 2024, it compromised over 6,000 Asus routers in under 72 hours as part of a proxy-building campaign.\n\n\"TheMoon does not require a password to infect routers; it scans for open ports and sends a command to a vulnerable script,\" the FBI PSA explains. \"The malware contacts the command and control (C2) server and the C2 server responds with instructions, which may include instructing the infected machine to scan for other vulnerable routers to spread the infection and expand the network.\"\n\nThree Russian nationals - Alexey Viktorovich Chertkov, 37, Kirill Vladimirovich Morozov, 41, Aleksandr Aleksandrovich Shishkin, 36 - and a Kazakhstani associate Dmitriy Rubtsov, 38 - were named in the Friday indictment. Chertkov and Rubtsov were also charged with providing false registration information when signing up the domains used to operate the proxy services.\n\nThe indictments are a result of a combined operation between European and US law enforcement, as well as with support from Lumen's Black Lotus Labs. The operators exploited outdated routers and maintained a relatively low operational footprint - despite advertising access to thousands of proxies - to avoid detection.\n\n\"The botnet operators claim that they maintain a daily population of over 7,000 proxies. Based on Black Lotus Labs’ telemetry, we can see an average of about 1,000 weekly active proxies in over 80 countries, however we believe their true bot population is less than advertised to potential users,\" the security shop said. ®"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Sajid Shaikh",
    "title": "The Weekend: Interest rate cuts and trade deals lift the mood",
    "description": "Key moments from the last seven days, plus a glimpse at the week ahead",
    "url": "https://uk.finance.yahoo.com/news/interest-rate-cuts-trade-deals-warren-buffett-david-attenborough-100305050.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QQ8Z9y77XL9yTaIsZ.DAOQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-03/981dd690-0aeb-11f0-9cac-a40c3e84a383",
    "publishedAt": "2025-05-10T10:03:05Z",
    "content": "Behold the heatwave! The temperatures, after dipping into the teens and even lower with cloud cover to boot are rising again amid the promise of more sunshine this weekend.\r\nPast that weather report,… [+9357 chars]",
    "full_content": "Behold the heatwave! The temperatures, after dipping into the teens, and even lower with cloud cover to boot, are rising again amid the promise of more sunshine this weekend.\n\nPast that weather report, in the world of finance a lot has happened this week. Central banks took a call on interest rates, the US and China are holding their first trade talks today in Switzerland, and the UK became the first nation to seal a trade deal with the US after president Trump's tariff policy upended the global economy.\n\nThe UK also signed a trade deal with India, and mergers and acquisitions were in focus with DoorDash (DASH) agreeing to acquire Deliveroo (ROO.L) for $3.8bn (£2.9bn) and Associated British Foods (ABF.L) buying dairy technology firm National Milk Records for £48m. There were also reports of Shell (SHEL.L) preparing a takeover bid for BP (BP.L), though both declined to comment about this to Yahoo Finance.\n\nA major UK think tank warned of tax rises, saying chancellor Rachel Reeves is running out of choices and facing a reckoning before the autumn budget when the government may have to discard its self- imposed fiscal rules — thanks to reduced growth projections amid mounting global uncertainty.\n\nQuite a lot to unpack.\n\nBut before we get to that, here’s how Warren Buffett signed off at the 60th annual shareholder meeting of Berkshire Hathaway (BRK-B, BRK-A) last Sunday, signalling it would be his final appearance as chairman and CEO.\n\n“That’s the news hook for the day,” 94-year-old Buffett said, as he announced his retirement after six decades in which he transformed a struggling textile company that he took over in 1965 into a $1.12tn behemoth.\n\nIn the interim, the price of Berkshire class A shares rose from $19 to $778,173 — a staggering 4,095,546% growth. To visualise that scale of growth, imagine Berkshire as an average-sized tree in 1965. It would have grown so tall today that the top would reach the International Space Station.\n\nOn that note, here are the highlights from the last seven days, plus a glimpse at the week ahead.\n\nKey moments from last week\n\nWarren Buffett shook the investment world last week with four words: 'The time has arrived.' · Reuters / Reuters\n\nWarren Buffett to step down as Berkshire Hathaway CEO at year-end, Greg Abel to take over\n\nWarren Buffett announced at the 60th annual shareholder meeting of Berkshire Hathaway (BRK-B, BRK-A) on Saturday 3 May that he plans to hand over the reins at year-end.\n\n\"I think it's time that Greg [Abel] should become the chief executive officer of the company at year-end,\" said Buffett. \"And I want to spring that on the directors, effectively, and give that as my recommendation.\""
  },
  {
    "source": {
      "id": "techradar",
      "name": "TechRadar"
    },
    "author": "Sead Fadilpašić",
    "title": "Cisco has patched a worrying flaw which could have let attackers hijack devices",
    "description": "Another day, another hardcoded token, as Cisco moves to defend against threats.",
    "url": "https://www.techradar.com/pro/security/cisco-has-patched-a-worrying-flaw-which-could-have-let-attackers-hijack-devices",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/4vPx4qpVwRADJoMvv3gttX.jpg",
    "publishedAt": "2025-05-09T14:44:00Z",
    "content": "<ul><li>Cisco has patched a 10/10 flaw in IOS XE Software for Wireless LAN Controllers</li><li>The flaw was due to hardcoded tokens</li><li>There is no evidence of abuse in the wild (yet)</li></ul>\r\n… [+2289 chars]",
    "full_content": "Cisco has patched a 10/10 flaw in IOS XE Software for Wireless LAN Controllers\n\nThe flaw was due to hardcoded tokens\n\nThere is no evidence of abuse in the wild (yet)\n\nCisco has released a patch for a maximum-severity flaw found in its IOS XE Software for Wireless LAN Controllers which could have allowed threat actors to take over vulnerable endpoints.\n\nThe flaw is yet another case of hardcoded credentials, this time in the form of a JSON Web Token (JWT). “An attacker could exploit this vulnerability by sending crafted HTTPS requests to the AP image download interface,” it is explained in the NVD website. “A successful exploit could allow the attacker to upload files, perform path traversal, and execute arbitrary commands with root privileges.”\n\nThe vulnerability is now tracked as CVE-2025-20188, and has the maximum security score - 10/10 (critical).\n\nNo mitigations\n\nIt was also noted that the vulnerability can only be exploited on devices that have the Out-of-Band Image Download feature enabled which, on default settings, is not the case.\n\nAccording to BleepingComputer, this is a feature that allows access points to download OS images via HTTPS instead of CAPWAP, which is a somewhat more flexible and direct way of getting firmware onto access points.\n\nThe publication says that while it’s off by default, some large-scale or automated enterprise deployments have turned it on.\n\nUnfortunately, there are no mitigations for the flaw. The best way to minimize the risk of exposure is to deploy the patch. A possible workaround is to disable the Out-of-Band Image Download feature, which could work well if the enterprise isn’t actually using it.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nCisco said it hasn’t seen evidence of in-the-wild abuse just yet, but users should still be on their guard.\n\nHere is a list of vulnerable devices:\n\nCatalyst 9800-CL Wireless Controllers for Cloud\n\nCatalyst 9800 Embedded Wireless Controller for Catalyst 9300, 9400, and 9500 Series Switches\n\nCatalyst 9800 Series Wireless Controllers\n\nEmbedded Wireless Controller on Catalyst APs\n\nAnd here is a list of devices that are safe to use:\n\nCisco IOS (non-XE)\n\nCisco IOS XR\n\nCisco Meraki products\n\nCisco NX-OS\n\nCisco AireOS-based WLCs"
  },
  {
    "source": {
      "id": "techradar",
      "name": "TechRadar"
    },
    "author": "Sead Fadilpašić",
    "title": "FBI warns outdated routers are being hacked and hijacked for criminal purposes",
    "description": "Multiple Linksys and Cisco models are among those being targeted and assimilated into botnets.",
    "url": "https://www.techradar.com/pro/security/fbi-warns-outdated-routers-are-being-hacked-and-hijacked-for-criminal-purposes",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/2FFajuvJVK8i7Her8gD4aD.jpg",
    "publishedAt": "2025-05-09T13:10:00Z",
    "content": "<ul><li>FBI report warns on risk targeting outdated routers</li><li>Numerous models have known vulnerabilities and are no longer supported</li><li>FBI claims hackers are assimilating the routers into… [+2087 chars]",
    "full_content": "FBI report warns on risk targeting outdated routers\n\nNumerous models have known vulnerabilities and are no longer supported\n\nFBI claims hackers are assimilating the routers into two botnets\n\nCybercriminals are targeting old and outdated routers that are no longer supported by their vendors, the FBI has warned.\n\nThe agency noted how hackers are exploiting known unpatched vulnerabilities to deploy malware on such devices, assimilating them into botnets which are later used for attacks, or rented out as proxy services to other criminals.\n\nThese devices are being targeted to be pulled into 5Socks and Anyproxy network, two services who didn’t start off as malicious, but ended up being hijacked by criminals.\n\nChinese threat\n\n5Socks is a proxy service that offers a large pool of rotating SOCKS5 and HTTPS proxies. Its primary use case was web scraping, anonymity, and bypassing geo-restrictions.\n\nAnyproxy, on the other hand, is advertised as a lightweight, open-source HTTP/HTTPS proxy tool designed for debugging and modifying web traffic in real time. It was often used by developers and testers for intercepting and analyzing requests.\n\nThe FBI did not detail which threat actor groups were abusing the two services, but it did mention that the routers were being targeted by “Chinese actors” interested in “establishing botnets to conceal hacking into US critical infrastructures.”\n\nAs per the report, the devices currently vulnerable to compromise include a number of Linksys and Cisco models:\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nE1200\n\nE2500\n\nE1000\n\nE4200\n\nE1500\n\nE300\n\nE3200\n\nWRT320N\n\nE1550\n\nWRT610N\n\nE100\n\nM100\n\nWRT310N\n\nThe agency urged all users to unplug and replace the outdated equipment as soon as possible. If they cannot do that, then they should at least disable remote administration features and reboot affected devices to minimize the chances of getting compromised.\n\nRouters, being the gateway of all internet traffic on a network, are the first and most common target in a cyberattack.\n\nVia BleepingComputer"
  },
  {
    "source": {
      "id": null,
      "name": "Help Net Security"
    },
    "author": "Mirko Zorz",
    "title": "Cisco’s new chip wants to scale quantum computing faster",
    "description": "Cisco is making significant strides in quantum computing by focusing on quantum networking, aiming to bring practical applications closer to reality. The company recently introduced a prototype of its Quantum Network Entanglement Chip and inaugurated the Cisc…",
    "url": "https://www.helpnetsecurity.com/2025/05/08/cisco-quantum-network-entanglement-chip/",
    "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2025/01/23130950/cisco-1500-2.webp",
    "publishedAt": "2025-05-08T08:15:02Z",
    "content": "Cisco is making significant strides in quantum computing by focusing on quantum networking, aiming to bring practical applications closer to reality. The company recently introduced a prototype of it… [+1643 chars]",
    "full_content": "Cisco is making significant strides in quantum computing by focusing on quantum networking, aiming to bring practical applications closer to reality. The company recently introduced a prototype of its Quantum Network Entanglement Chip and inaugurated the Cisco Quantum Lab in Santa Monica, California.\n\nThe Quantum Network Entanglement Chip is designed to facilitate the connection of quantum processors, addressing the current limitation where most quantum processors have only hundreds of qubits, while practical applications require millions. “Even the most ambitious quantum computing roadmaps currently only target a few thousand qubits by 2030,” said Vijoy Pandey, SVP, Outshift by Cisco.\n\nBy enabling quantum networks to scale, this chip could accelerate the development of distributed quantum computing systems.\n\nCisco’s approach draws parallels to the evolution of classical computing, where networking smaller nodes led to the creation of powerful distributed systems. By applying similar principles to quantum computing, Cisco aims to overcome the scaling challenges and unlock new possibilities in fields like cryptography, materials science, and complex system modeling.\n\n“What makes our quantum networking approach powerful is our focus on both software and hardware development. By developing our own network hardware components such as the chip alongside our full software stack, we gain unique insights into how these elements work together to build complete quantum networking infrastructure,” Pandey explained\n\nWhile the Quantum Network Entanglement Chip is still in the prototype stage, its development marks a foundational step toward building functional quantum networks. Cisco’s efforts in this area highlight the potential of quantum networking to transform computing and communication technologies in the coming years."
  },
  {
    "source": {
      "id": null,
      "name": "Internet"
    },
    "author": "info@thehackernews.com (The Hacker News)",
    "title": "Play Ransomware Exploited Windows CVE-2025-29824 as Zero-Day to Breach U.S. Organization",
    "description": "Threat actors with links to the Play ransomware family exploited a recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the United States.\nThe attack, per the Symantec Threat Hunter Team, …",
    "url": "https://thehackernews.com/2025/05/play-ransomware-exploited-windows-cve.html",
    "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiy6aNvkvpfvspGBVXWiABqaZSeFgnTKq1CHZvx_1BaE_8QfpREnLmNlVHYTYdwmtljBFj939Q9sADVf3O2feZxv-_qDmKNCRW8-heIVCqSbnqffnmAa4XKTBOBgnW3u6heAfqzHgzULosSG8x-M5QIewpFBaMvx6DGC58A-EjD-DlvdTajBZkqPsvvtowt/s728-rw-e365/ransomware-malware.jpg",
    "publishedAt": "2025-05-07T10:44:00Z",
    "content": "Threat actors with links to the Play ransomware family exploited a recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the Unit… [+8782 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Walmart, Cisco, Alibaba, Petrobras: Stocks to watch this week",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_46618c73-95d1-44d6-a1bb-aea12d24f19b",
    "urlToImage": null,
    "publishedAt": "2025-05-11T09:00:00Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "What Analysts Think of Cisco Stock Ahead of Earnings",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_6330f00d-e788-4310-8aa3-6ad99cd009e9",
    "urlToImage": null,
    "publishedAt": "2025-05-11T09:00:00Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "techradar",
      "name": "TechRadar"
    },
    "author": "waynewilliams@onmail.com (Wayne Williams)",
    "title": "After AI, Nvidia wants to own a slice of that sweet trillion-dollar cybersecurity pie with its new DOCA software platfom",
    "description": "Nvidia wants to protect AI infrastructure with DOCA Argus, its new agentless security framework.",
    "url": "https://www.techradar.com/pro/after-ai-nvidia-wants-to-own-a-slice-of-that-sweet-trillion-dollar-cybersecurity-pie-with-its-new-doca-software-platfom",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/pNvZnS4EQCoYBG2inqCq5L.jpg",
    "publishedAt": "2025-05-06T17:31:00Z",
    "content": "<ul><li>Nvidia’s DOCA Argus promises real-time protection for AI compute environments</li><li>The system runs off-host to detect and respond without performance impact</li><li>Cisco and Nvidia are wo… [+2504 chars]",
    "full_content": "Nvidia’s DOCA Argus promises real-time protection for AI compute environments\n\nThe system runs off-host to detect and respond without performance impact\n\nCisco and Nvidia are working to secure scalable AI infrastructure deployments\n\nNvidia is extending its AI ambitions into cybersecurity with the launch of DOCA Argus, a new software framework aimed at protecting AI infrastructure in real time.\n\nPart of Nvidia’s DOCA software platform, Argus runs on its BlueField networking hardware to detect and respond to threats as they happen, without relying on traditional host-based security tools.\n\n“Cyber defenders need robust tools to effectively protect AI factories, which serve as the foundation for agentic reasoning,” said David Reber, chief security officer at Nvidia. “The DOCA Argus framework delivers real-time security insights to enable autonomous detection and response - equipping defenders with a data advantage through actionable intelligence.”\n\nBuilt to work with existing enterprise security setups\n\nArgus is designed to operate independently of the system it monitors, avoiding integration into the host OS.\n\nThis makes it invisible to attackers and avoids slowing down the system it protects. It works across containerized and multi-tenant environments, including deployments using Nvidia NIM microservices.\n\nNvidia says Argus uses memory forensics to detect threats up to 1,000 times faster than existing agentless solutions. Because it doesn’t run on the host, it won’t impact performance.\n\nThe system is built to work with existing enterprise security setups like SIEM, SOAR, and XDR platforms.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nCisco is working with Nvidia to create a Secure AI Factory using this architecture.\n\n“Now is the time for enterprises to be driving forward with AI, but the key to unlocking innovative use cases and enabling broad adoption is safety and security,” said Jeetu Patel, executive vice president and chief product officer at Cisco.\n\nDOCA Argus is part of Nvidia’s broader cybersecurity AI platform, which includes BlueField hardware and the Morpheus AI framework. The goal is to improve visibility and threat response across AI infrastructure.\n\nArgus is trained using Nvidia’s internal security data, with the aim of reducing false alerts and focusing only on real threats. This, the company says, will help security teams avoid alert fatigue and act faster\n\n(Image credit: Nvidia)"
  },
  {
    "source": {
      "id": null,
      "name": "Infosecurity Magazine"
    },
    "author": "Phil Muncaster",
    "title": "Talent Shortages Bite as 80% of UK Firms Hit with AI Threats",
    "description": "Half of UK firms have over 10 cyber positions unfilled, according to Cisco",
    "url": "https://www.infosecurity-magazine.com/news/talent-shortages-bite-80-uk-firms/",
    "urlToImage": "https://assets.infosecurity-magazine.com/webpage/og/8bb28e30-ae54-4095-a25e-e05f9199d69e.jpg",
    "publishedAt": "2025-05-07T09:30:00Z",
    "content": "The “cyber readiness” of UK businesses is alarmingly low, with AI-related attacks threatening to overwhelm understaffed security teams, according to a new report from Cisco.\r\nThe tech giant’s 2025 Cy… [+1934 chars]",
    "full_content": "The “cyber readiness” of UK businesses is alarmingly low, with AI-related attacks threatening to overwhelm understaffed security teams, according to a new report from Cisco.\n\nThe tech giant’s 2025 Cybersecurity Readiness Index is based on a survey of 8000 private sector security and business leaders in 30 global markets, including 300 in the UK.\n\nResponding companies’ readiness was evaluated across five areas – identity, network resilience, “machine trustworthiness,” cloud reinforcement, and “AI fortification.”\n\nDisappointingly, just 4% of global (and UK) respondents were classed as “mature” in terms of readiness – although in the UK this figure had doubled from the previous report.\n\nThis is particularly alarming in light of the large share (78%) of UK firms that experienced AI-related incidents last year. These ranged from exposure of training data to model theft, data poisoning, prompt injection and AI-enhanced social engineering.\n\nRead more on AI threats: AI Hallucinations Create “Slopsquatting” Supply Chain Threat\n\nThese risks may be compounded by the fact that over half (52%) of UK firms aren’t confident in being able to detect shadow AI in the organization. The same share (52%) of respondents claimed their employees fully understand AI-related threats.\n\nThese findings are also concerning given persistent cybersecurity skills shortages. Cisco claimed that nearly half (48%) of UK businesses have over 10 positions in their security team that remain unfilled. This is an increase from last year’s figure of 41%.\n\nTime for AI\n\nHowever, there at least is some awareness of the scale of the problem. That’s part of the reason why 92% of UK organizations are using AI to tackle cyber risk, including 81% using AI tools for threat detection, and 71% for response and recovery.\n\nOverall, 65% said they are investing in AI-driven technologies – up from 55% last year.\n\nThere’s an urgent financial need to do so with 32% of breached organizations stating they suffered financial losses exceeding $500,000. Yet only 45% of UK respondents claimed they allocate more than 10% of their IT budget to cybersecurity – down 9% annually."
  }
]