[
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Fortinet, Inc. Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a264f29d-8909-46cf-9e65-b468c3e9d4f4",
    "urlToImage": null,
    "publishedAt": "2025-05-09T11:32:49Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Trefis Team, Contributor, \n Trefis Team, Contributor\n https://www.forbes.com/sites/greatspeculations/people/trefis/",
    "title": "Should You Buy Fortinet Stock At $100?",
    "description": "Fortinet achieved a record operating margin of 34.2%, a significant improvement of 570 basis points.",
    "url": "https://www.forbes.com/sites/greatspeculations/2025/05/08/should-you-buy-fortinet-stock-at-100/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681c976a344ab26b89133042/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-08T12:02:40Z",
    "content": "CANADA - 2025/01/31: In this photo illustration, the Fortinet, Inc. logo is seen displayed on a ... More smartphone screen. (Photo Illustration by Thomas Fuller/SOPA Images/LightRocket via Getty Imag… [+6109 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Investopedia"
    },
    "author": "Michael Bromberg",
    "title": "S&P 500 Gains and Losses Today: Axon Enterprise Soars as Software Demand Drives Earnings Beat",
    "description": "The S&P 500 added 0.6% on Thursday, May 8, after the U.S. struck a trade agreement with the U.K.",
    "url": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-axon-enterprise-soars-as-software-demand-drives-earnings-beat-11731281",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jetTmTYP3PxwkZ6leCRX9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MTM-/https://media.zenfs.com/en/investopedia_245/93b5070e5cbf5eee2a2547b5c88c2f58",
    "publishedAt": "2025-05-08T21:05:11Z",
    "content": "Timothy A. Clary / AFP via Getty Images\r\n Traders work on the floor of the New York Stock Exchange (NYSE) at the opening bell on May 8.\r\n<ul><li>The S&amp;P 500 added 0.6% on Thursday, May 8, after t… [+3618 chars]",
    "full_content": "Key Takeaways The S&P 500 added 0.6% on Thursday, May 8, after the U.S. struck a trade agreement with the U.K.\n\nAxon Enterprise shares surged after the maker of law enforcement and military equipment topped quarterly estimates, citing strong software demand.\n\n\n\nOnline dating platform operator Match Group posted a decline in paying users and announced workforce reductions, and its shares tumbled.\n\n\n\nMajor U.S. equities indexes pushed higher after President Trump unveiled a new trade agreement with the U.K.\n\nIt is the first deal announced since last month's suspension of \"reciprocal\" tariffs. The agreement will keep the 10% broad tariff in place, but will give the U.K. concessions on automobile and steel industry tariffs in exchange for \"increased market access\" for U.S. agricultural, industrial, and chemical products in Britain.\n\nThe S&P 500 gained 0.6% on Thursday. The Dow industrials also closed 0.6% higher, while the tech-heavy Nasdaq jumped 1.1%.\n\nShares of Taser maker Axon Enterprise (AXON) surged 14.1%, gaining the most of any stock in the S&P 500 on Thursday. The company, which also provides body cameras and other products for military and law enforcement, posted better-than-expected sales and profits for the first quarter and boosted its full-year guidance. Axon touted strong growth for its software and services segment, highlighting robust demand for its artificial intelligence (AI) policing systems.\n\nEpam Systems (EPAM) also surpassed consensus estimates with its quarterly results, and shares of the digital engineering and cloud-based software provider jumped 12.9%. Growth in IT services revenue, AI-related demand, and strategic partnerships helped underpin the strong performance. EPAM also increased its full-year sales outlook and announced that its current chief revenue officer would take the reins as CEO later this year.\n\nEnphase Energy (ENPH) shares advanced 12.2% after the energy technology firm launched a plug-and-play solar energy system in Germany. The new product is designed for users who live in apartments or have limited roof space. It can also be used in off-grid locations such as cabins, campsites, and mobile homes. With Thursday's gains, Enphase stock staged a partial recovery from losses posted late last month after its quarterly results fell short of expectations.\n\nShares of Match Group (MTCH), operator of Tinder and other online dating services, sank 9.6%, posting the S&P 500's weakest daily performance. The company reported a year-over-year decline in paying users across its platforms, including the dating sites Hinge and OkCupid. Furthermore, Match said it would cut its workforce by 13% in an effort to cut costs as it navigates challenges related to user engagement.\n\nFortinet (FTNT) shares fell 8.4% in the wake of the cybersecurity firm's quarterly earnings release. Although its first-quarter adjusted profits came in ahead of consensus forecasts, revenue for the period missed the mark, and Fortinet issued underwhelming guidance for the current quarter and the full year. Despite the relatively cautious outlook, Fortinet maintains a strong leadership position in the global firewall market.\n\n\n\nShares of drug wholesaler and pharmaceutical solutions provider Cencora (COR) lost 6.8% on Thursday, reversing the strong gains posted by the stock in the prior session following a strong earnings report. Notwithstanding the strong quarterly performance, Cencora noted that it faces challenging growth comparisons for GLP-1 weight-loss products along with softness in clinical trial activity and its specialty logistics business."
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Is Fortinet, Inc. (FTNT) the Best Monopoly Stock to Buy Now?",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0b5679bb-663f-44de-84a5-0c1bed8b41ad",
    "urlToImage": null,
    "publishedAt": "2025-05-06T09:47:51Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "fox-news",
      "name": "Fox News"
    },
    "author": "Kurt Knutsson, CyberGuy Report",
    "title": "1.7 billion passwords leaked on dark web and why yours is at risk",
    "description": "In response to infostealer activity increasing 500% in a year and harvesting 1.7 billion user credentials, the CyberGuy offers four ways to stay safe from infostealer malware.",
    "url": "https://www.foxnews.com/tech/1-7-billion-passwords-leaked-dark-web-why-yours-risk",
    "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/2-1.7-billion-passwords-leaked-on-dark-web-and-why-yours-could-be-among-them-copy.jpg",
    "publishedAt": "2025-05-08T14:00:24Z",
    "content": "Cybercriminals aren't just going after big targets anymore. \r\nThey're going after everyone, and they're doing it with infostealer malware. These small, sneaky programs are quietly stealing passwords,… [+7944 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "nytimes.com",
    "title": "Buy American? Europe Says No Thanks, Backlash Grows",
    "description": "",
    "url": "https://biztoc.com/x/043c10d4971af8b0",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-08T18:36:48Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Bitcoin surpass $100K today? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-UK trade deal affect tar… [+898 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "barchart.com",
    "title": "Dollar Rallies and Gold Tumbles on US Trade Optimism",
    "description": "",
    "url": "https://biztoc.com/x/c4fc9b82beb5f8cf",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-08T19:38:37Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Bitcoin surpass $100K today? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-UK trade deal affect tar… [+903 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "marketwatch.com",
    "title": "One More Reason For Investors To 'Sell In May'",
    "description": "",
    "url": "https://biztoc.com/x/67e0bed16ba09875",
    "urlToImage": "https://biztoc.com/cdn/930/og.png",
    "publishedAt": "2025-05-08T18:36:42Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Bitcoin surpass $100K today? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-UK trade deal affect tar… [+942 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "barrons.com",
    "title": "Nvidia and 29 Other Stocks to Play AI",
    "description": "",
    "url": "https://biztoc.com/x/0f55fb26e90e102b",
    "urlToImage": "https://biztoc.com/cdn/0f55fb26e90e102b_s.webp",
    "publishedAt": "2025-05-08T19:38:56Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Bitcoin surpass $100K today? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-UK trade deal affect tar… [+881 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "bloomberg.com",
    "title": "Instagram Chief Says App Has Feared TikTok Threat for Years",
    "description": "",
    "url": "https://biztoc.com/x/eb9e80e40e3427db",
    "urlToImage": "https://biztoc.com/cdn/eb9e80e40e3427db_s.webp",
    "publishedAt": "2025-05-08T19:39:39Z",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did Bitcoin surpass $100K today? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will US-UK trade deal affect tar… [+924 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": "financial-post",
      "name": "Financial Post"
    },
    "author": "GlobeNewswire",
    "title": "Fortinet Expands Hybrid Mesh Firewall Portfolio with FortiGate 700G",
    "description": "New FortiGate series delivers scalable, high-performance security for the modern campus, now enhanced with FortiOS post-quantum capabilities and FortiAI-Protect for advanced threat detection and GenAI risk mitigation SUNNYVALE, Calif., May 07, 2025 (GLOBE NEW…",
    "url": "https://financialpost.com/globe-newswire/fortinet-expands-hybrid-mesh-firewall-portfolio-with-fortigate-700g",
    "urlToImage": null,
    "publishedAt": "2025-05-07T13:03:26Z",
    "content": "Fortinet Security Fabric: Powering a Unified and Scalable Cybersecurity Platform\r\nAt the core of Fortinets approach is the belief that effective cybersecurity starts with the convergence of networkin… [+3971 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Fortinet price target lowered to $115 from $135 at Scotiabank",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_32676c36-6bea-4504-8160-bdf50ad90ee4",
    "urlToImage": null,
    "publishedAt": "2025-05-09T14:32:48Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Fortinet (NASDAQ:FTNT) Given New $95.00 Price Target at Stifel Nicolaus",
    "description": "Fortinet (NASDAQ:FTNT – Free Report) had its target price decreased by Stifel Nicolaus from $115.00 to $95.00 in a research report report published on Thursday morning,Benzinga reports. Stifel Nicolaus currently has a hold rating on the software maker’s stock…",
    "url": "https://www.etfdailynews.com/2025/05/11/fortinet-nasdaqftnt-given-new-95-00-price-target-at-stifel-nicolaus/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/fortinet-inc-logo.png?v=20231228112222&w=240&h=240&zc=2",
    "publishedAt": "2025-05-11T07:24:57Z",
    "content": "Fortinet (NASDAQ:FTNT – Free Report) had its target price decreased by Stifel Nicolaus from $115.00 to $95.00 in a research report report published on Thursday morning,Benzinga reports. Stifel Nicola… [+6025 chars]",
    "full_content": "Fortinet (NASDAQ:FTNT – Free Report) had its target price decreased by Stifel Nicolaus from $115.00 to $95.00 in a research report report published on Thursday morning,Benzinga reports. Stifel Nicolaus currently has a hold rating on the software maker’s stock.\n\nSeveral other brokerages have also recently weighed in on FTNT. Rosenblatt Securities raised their price target on shares of Fortinet from $115.00 to $125.00 and gave the stock a “buy” rating in a research note on Friday, February 7th. Stephens began coverage on shares of Fortinet in a research report on Tuesday, April 1st. They issued an “equal weight” rating and a $108.00 target price for the company. Jefferies Financial Group cut their price target on shares of Fortinet from $115.00 to $105.00 and set a “hold” rating on the stock in a research report on Monday, March 31st. Scotiabank decreased their price objective on Fortinet from $135.00 to $115.00 and set a “sector outperform” rating for the company in a report on Thursday. Finally, Guggenheim reiterated a “neutral” rating on shares of Fortinet in a report on Friday, February 7th. Two equities research analysts have rated the stock with a sell rating, nineteen have given a hold rating, eleven have given a buy rating and two have given a strong buy rating to the company’s stock. Based on data from MarketBeat, Fortinet presently has an average rating of “Hold” and a consensus target price of $104.80.\n\nGet Fortinet alerts:\n\nGet Our Latest Stock Report on FTNT\n\nFortinet Stock Down 0.3 %\n\nShares of FTNT stock opened at $97.42 on Thursday. The company has a market capitalization of $74.50 billion, a price-to-earnings ratio of 43.11, a P/E/G ratio of 4.19 and a beta of 1.16. Fortinet has a 12-month low of $54.57 and a 12-month high of $114.82. The firm has a fifty day moving average of $98.26 and a 200-day moving average of $97.47. The company has a quick ratio of 1.39, a current ratio of 1.47 and a debt-to-equity ratio of 0.67.\n\nFortinet (NASDAQ:FTNT – Get Free Report) last released its quarterly earnings results on Wednesday, May 7th. The software maker reported $0.58 earnings per share (EPS) for the quarter, beating the consensus estimate of $0.53 by $0.05. The firm had revenue of $1.54 billion for the quarter, compared to the consensus estimate of $1.54 billion. Fortinet had a return on equity of 256.53% and a net margin of 29.30%. The company’s revenue for the quarter was up 13.8% on a year-over-year basis. During the same quarter last year, the business posted $0.43 EPS. As a group, equities research analysts predict that Fortinet will post 2.09 earnings per share for the current fiscal year.\n\nInsider Activity at Fortinet\n\nIn other Fortinet news, VP Michael Xie sold 326,784 shares of the stock in a transaction dated Tuesday, March 11th. The stock was sold at an average price of $98.17, for a total value of $32,080,385.28. Following the completion of the transaction, the vice president now directly owns 11,000,068 shares in the company, valued at approximately $1,079,876,675.56. This trade represents a 2.89 % decrease in their ownership of the stock. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. Also, Director William H. Neukom purchased 328 shares of Fortinet stock in a transaction dated Thursday, March 6th. The shares were purchased at an average price of $106.33 per share, for a total transaction of $34,876.24. Following the completion of the acquisition, the director now owns 300,006 shares of the company’s stock, valued at approximately $31,899,637.98. The trade was a 0.11 % increase in their position. The disclosure for this purchase can be found here. Insiders have sold a total of 738,978 shares of company stock valued at $74,135,907 in the last 90 days. 17.20% of the stock is owned by corporate insiders.\n\nHedge Funds Weigh In On Fortinet\n\nLarge investors have recently modified their holdings of the business. Manchester Capital Management LLC raised its position in Fortinet by 13.5% during the 4th quarter. Manchester Capital Management LLC now owns 843 shares of the software maker’s stock worth $80,000 after purchasing an additional 100 shares during the last quarter. Fifth Third Wealth Advisors LLC lifted its stake in shares of Fortinet by 1.6% in the fourth quarter. Fifth Third Wealth Advisors LLC now owns 6,833 shares of the software maker’s stock worth $646,000 after acquiring an additional 107 shares during the period. Hemington Wealth Management boosted its holdings in Fortinet by 16.6% in the first quarter. Hemington Wealth Management now owns 752 shares of the software maker’s stock valued at $72,000 after acquiring an additional 107 shares during the last quarter. Citizens Financial Group Inc. RI increased its position in Fortinet by 0.9% during the 1st quarter. Citizens Financial Group Inc. RI now owns 12,334 shares of the software maker’s stock valued at $1,187,000 after purchasing an additional 107 shares during the period. Finally, Eagle Capital Management LLC raised its holdings in Fortinet by 0.4% during the 1st quarter. Eagle Capital Management LLC now owns 26,285 shares of the software maker’s stock worth $2,530,000 after purchasing an additional 109 shares during the last quarter. Institutional investors own 83.71% of the company’s stock.\n\nAbout Fortinet\n\n(Get Free Report)\n\nFortinet, Inc provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products.\n\nFurther Reading\n\nReceive News & Ratings for Fortinet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fortinet and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Fortinet price target lowered to $115 from $135 at Scotiabank",
    "description": "In This Article:\nScotiabank lowered the firm’s price target on Fortinet (FTNT) to $115 from $135 and keeps an Outperform rating on the shares. The company reported a “solid” Q1 billings performance, with management stating the U.S.-China tariffs did not impac…",
    "url": "https://biztoc.com/x/26318bcdf672f444",
    "urlToImage": "https://biztoc.com/cdn/26318bcdf672f444_s.webp",
    "publishedAt": "2025-05-09T14:43:03Z",
    "content": "In This Article:Scotiabank lowered the firms price target on Fortinet (FTNT) to $115 from $135 and keeps an Outperform rating on the shares. The company reported a solid Q1 billings performance, with… [+147 chars]",
    "full_content": "In This Article:\n\nScotiabank lowered the firm’s price target on Fortinet (FTNT) to $115 from $135 and keeps an Outperform rating on the shares. The company reported a “solid” Q1 billings performance, with management stating the U.S.-China tariffs did not impact fundamentals this quarter,…\n\nThis story appeared on finance.yahoo.com , 2025-05-09 14:32:48."
  },
  {
    "source": {
      "id": null,
      "name": "SiliconANGLE News"
    },
    "author": "Duncan Riley",
    "title": "Fortinet stock slips as earnings beat is overshadowed by soft outlook",
    "description": "Shares in Fortinet Inc. dropped over 12% in late trading today after the cybersecurity company fell short of expectations with its forward guidance and reported a miss on revenue in its fiscal 2025 first quarter. For the quarter that ended on March 31, Fortin…",
    "url": "https://siliconangle.com/2025/05/07/fortinet-stock-slips-earnings-beat-overshadowed-soft-outlook/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2024/06/Fortinet.png",
    "publishedAt": "2025-05-07T23:48:00Z",
    "content": "Shares in Fortinet Inc. dropped over 12% in late trading today after the cybersecurity company fell short of expectations with its forward guidance and reported a miss on revenue in its fiscal 2025 f… [+3848 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "SiliconANGLE News"
    },
    "author": "Duncan Riley",
    "title": "Fortinet stock slips as soft outlook overshadows earnings beat",
    "description": "Shares of Fortinet Inc. dropped more than 12% in late trading today after the cybersecurity company fell short of expectations with its guidance and reported a miss on revenue in its fiscal 2025 first quarter. For the quarter ended March 31, Fortinet reported…",
    "url": "https://siliconangle.com/2025/05/07/fortinet-stock-slips-soft-outlook-overshadows-earnings-beat/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2024/06/Fortinet.png",
    "publishedAt": "2025-05-07T23:48:00Z",
    "content": "Shares of Fortinet Inc. dropped more than 12% in late trading today after the cybersecurity company fell short of expectations with its guidance and reported a miss on revenue in its fiscal 2025 firs… [+3735 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Robert W. Baird Issues Positive Forecast for Fortinet (NASDAQ:FTNT) Stock Price",
    "description": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price target hoisted by stock analysts at Robert W. Baird from $110.00 to $113.00 in a research note issued on Tuesday,Benzinga reports. The firm currently has a “neutral” rating on the software maker’s stock. …",
    "url": "https://www.etfdailynews.com/2025/05/08/robert-w-baird-issues-positive-forecast-for-fortinet-nasdaqftnt-stock-price/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/fortinet-inc-logo-1200x675.png?v=20231228112222&w=240&h=240&zc=2",
    "publishedAt": "2025-05-08T07:40:46Z",
    "content": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price target hoisted by stock analysts at Robert W. Baird from $110.00 to $113.00 in a research note issued on Tuesday,Benzinga reports. The firm curr… [+6030 chars]",
    "full_content": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price target hoisted by stock analysts at Robert W. Baird from $110.00 to $113.00 in a research note issued on Tuesday,Benzinga reports. The firm currently has a “neutral” rating on the software maker’s stock. Robert W. Baird’s target price points to a potential upside of 5.56% from the company’s current price.\n\nSeveral other brokerages also recently weighed in on FTNT. Susquehanna lifted their target price on shares of Fortinet from $90.00 to $110.00 and gave the company a “neutral” rating in a report on Monday, February 10th. Royal Bank of Canada lifted their price objective on Fortinet from $97.00 to $115.00 and gave the company a “sector perform” rating in a report on Friday, February 7th. Wells Fargo & Company raised their price target on Fortinet from $85.00 to $105.00 and gave the company an “equal weight” rating in a report on Friday, February 7th. DZ Bank lowered Fortinet from a “hold” rating to a “sell” rating and set a $95.00 price objective on the stock. in a report on Tuesday. Finally, Raymond James reissued a “market perform” rating on shares of Fortinet in a report on Tuesday, January 14th. Two investment analysts have rated the stock with a sell rating, nineteen have assigned a hold rating, eleven have given a buy rating and two have issued a strong buy rating to the company’s stock. According to MarketBeat.com, Fortinet presently has an average rating of “Hold” and a consensus price target of $107.07.\n\nGet Fortinet alerts:\n\nRead Our Latest Stock Analysis on Fortinet\n\nFortinet Stock Performance\n\nShares of FTNT stock opened at $107.04 on Tuesday. The stock’s 50-day moving average price is $98.62 and its 200 day moving average price is $97.15. The company has a quick ratio of 1.39, a current ratio of 1.47 and a debt-to-equity ratio of 0.67. The stock has a market capitalization of $81.86 billion, a PE ratio of 47.36, a price-to-earnings-growth ratio of 4.19 and a beta of 1.16. Fortinet has a 52-week low of $54.57 and a 52-week high of $114.82.\n\nFortinet (NASDAQ:FTNT – Get Free Report) last released its quarterly earnings results on Wednesday, May 7th. The software maker reported $0.58 EPS for the quarter, topping the consensus estimate of $0.53 by $0.05. Fortinet had a return on equity of 256.53% and a net margin of 29.30%. The business had revenue of $1.54 billion during the quarter, compared to analysts’ expectations of $1.54 billion. During the same quarter in the prior year, the business earned $0.43 earnings per share. The company’s quarterly revenue was up 13.8% compared to the same quarter last year. As a group, equities research analysts forecast that Fortinet will post 2.09 EPS for the current year.\n\nInsider Buying and Selling at Fortinet\n\nIn other Fortinet news, CEO Ken Xie sold 206,000 shares of the stock in a transaction that occurred on Monday, March 10th. The shares were sold at an average price of $96.93, for a total transaction of $19,967,580.00. Following the transaction, the chief executive officer now owns 51,391,879 shares of the company’s stock, valued at $4,981,414,831.47. This trade represents a 0.40 % decrease in their ownership of the stock. The transaction was disclosed in a document filed with the SEC, which is accessible through this hyperlink. Also, CFO Keith Jensen sold 23,500 shares of the business’s stock in a transaction on Wednesday, February 19th. The shares were sold at an average price of $113.56, for a total transaction of $2,668,660.00. Following the sale, the chief financial officer now directly owns 4,736 shares of the company’s stock, valued at $537,820.16. This represents a 83.23 % decrease in their ownership of the stock. The disclosure for this sale can be found here. In the last three months, insiders sold 738,978 shares of company stock worth $74,135,907. Insiders own 18.00% of the company’s stock.\n\nInstitutional Investors Weigh In On Fortinet\n\nA number of institutional investors have recently added to or reduced their stakes in FTNT. Manchester Capital Management LLC lifted its stake in shares of Fortinet by 13.5% in the 4th quarter. Manchester Capital Management LLC now owns 843 shares of the software maker’s stock valued at $80,000 after purchasing an additional 100 shares in the last quarter. Fifth Third Wealth Advisors LLC raised its holdings in Fortinet by 1.6% in the fourth quarter. Fifth Third Wealth Advisors LLC now owns 6,833 shares of the software maker’s stock valued at $646,000 after buying an additional 107 shares during the period. Eagle Capital Management LLC grew its stake in Fortinet by 0.4% during the first quarter. Eagle Capital Management LLC now owns 26,285 shares of the software maker’s stock worth $2,530,000 after buying an additional 109 shares during the period. Fielder Capital Group LLC increased its position in shares of Fortinet by 1.6% in the fourth quarter. Fielder Capital Group LLC now owns 6,904 shares of the software maker’s stock worth $652,000 after acquiring an additional 111 shares in the last quarter. Finally, ORG Partners LLC raised its stake in shares of Fortinet by 47.5% in the 1st quarter. ORG Partners LLC now owns 348 shares of the software maker’s stock valued at $34,000 after acquiring an additional 112 shares during the period. Hedge funds and other institutional investors own 83.71% of the company’s stock.\n\nAbout Fortinet\n\n(Get Free Report)\n\nFortinet, Inc provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products.\n\nRecommended Stories\n\nReceive News & Ratings for Fortinet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fortinet and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "UBS Group Cuts Fortinet (NASDAQ:FTNT) Price Target to $105.00",
    "description": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price objective decreased by stock analysts at UBS Group from $115.00 to $105.00 in a report issued on Thursday,Benzinga reports. The firm presently has a “neutral” rating on the software maker’s stock. UBS Gro…",
    "url": "https://www.etfdailynews.com/2025/05/10/ubs-group-cuts-fortinet-nasdaqftnt-price-target-to-105-00/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/fortinet-inc-logo-1200x675.png?v=20231228112222&w=240&h=240&zc=2",
    "publishedAt": "2025-05-10T07:08:45Z",
    "content": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price objective decreased by stock analysts at UBS Group from $115.00 to $105.00 in a report issued on Thursday,Benzinga reports. The firm presently h… [+5911 chars]",
    "full_content": "Fortinet (NASDAQ:FTNT – Get Free Report) had its price objective decreased by stock analysts at UBS Group from $115.00 to $105.00 in a report issued on Thursday,Benzinga reports. The firm presently has a “neutral” rating on the software maker’s stock. UBS Group’s price objective indicates a potential upside of 7.78% from the company’s previous close.\n\nA number of other research analysts have also weighed in on FTNT. Roth Capital set a $103.00 price objective on Fortinet and gave the company a “neutral” rating in a report on Tuesday, April 22nd. Jefferies Financial Group reduced their price objective on Fortinet from $115.00 to $105.00 and set a “hold” rating for the company in a research note on Monday, March 31st. StockNews.com downgraded Fortinet from a “buy” rating to a “hold” rating in a research note on Tuesday, April 1st. Guggenheim reiterated a “neutral” rating on shares of Fortinet in a research report on Friday, February 7th. Finally, Susquehanna upped their price objective on Fortinet from $90.00 to $110.00 and gave the stock a “neutral” rating in a research report on Monday, February 10th. Two investment analysts have rated the stock with a sell rating, nineteen have assigned a hold rating, eleven have issued a buy rating and two have issued a strong buy rating to the company’s stock. According to data from MarketBeat.com, the stock currently has an average rating of “Hold” and a consensus target price of $104.80.\n\nGet Fortinet alerts:\n\nRead Our Latest Stock Analysis on Fortinet\n\nFortinet Stock Down 0.3 %\n\nShares of FTNT stock opened at $97.42 on Thursday. The stock’s fifty day moving average price is $98.26 and its 200 day moving average price is $97.36. Fortinet has a 1-year low of $54.57 and a 1-year high of $114.82. The company has a market cap of $74.50 billion, a price-to-earnings ratio of 43.11, a price-to-earnings-growth ratio of 4.19 and a beta of 1.16. The company has a debt-to-equity ratio of 0.67, a current ratio of 1.47 and a quick ratio of 1.39.\n\nFortinet (NASDAQ:FTNT – Get Free Report) last posted its quarterly earnings data on Wednesday, May 7th. The software maker reported $0.58 earnings per share (EPS) for the quarter, beating the consensus estimate of $0.53 by $0.05. The firm had revenue of $1.54 billion for the quarter, compared to the consensus estimate of $1.54 billion. Fortinet had a net margin of 29.30% and a return on equity of 256.53%. The company’s revenue for the quarter was up 13.8% compared to the same quarter last year. During the same quarter in the prior year, the company posted $0.43 earnings per share. On average, research analysts expect that Fortinet will post 2.09 earnings per share for the current fiscal year.\n\nInsiders Place Their Bets\n\nIn other Fortinet news, VP Michael Xie sold 326,784 shares of the firm’s stock in a transaction on Tuesday, March 11th. The stock was sold at an average price of $98.17, for a total value of $32,080,385.28. Following the completion of the sale, the vice president now directly owns 11,000,068 shares of the company’s stock, valued at $1,079,876,675.56. This trade represents a 2.89 % decrease in their position. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink. Also, CFO Keith Jensen sold 23,500 shares of the business’s stock in a transaction dated Wednesday, February 19th. The shares were sold at an average price of $113.56, for a total transaction of $2,668,660.00. Following the transaction, the chief financial officer now directly owns 4,736 shares in the company, valued at approximately $537,820.16. The trade was a 83.23 % decrease in their position. The disclosure for this sale can be found here. Insiders have sold 738,978 shares of company stock valued at $74,135,907 in the last ninety days. 18.00% of the stock is currently owned by corporate insiders.\n\nHedge Funds Weigh In On Fortinet\n\nA number of institutional investors have recently bought and sold shares of FTNT. Vanguard Group Inc. grew its position in Fortinet by 5.2% in the first quarter. Vanguard Group Inc. now owns 71,662,404 shares of the software maker’s stock worth $6,898,223,000 after acquiring an additional 3,546,934 shares during the period. Geode Capital Management LLC grew its holdings in shares of Fortinet by 2.6% during the 4th quarter. Geode Capital Management LLC now owns 15,270,913 shares of the software maker’s stock worth $1,440,648,000 after purchasing an additional 387,901 shares during the period. Invesco Ltd. grew its holdings in shares of Fortinet by 31.3% during the 4th quarter. Invesco Ltd. now owns 8,388,693 shares of the software maker’s stock worth $792,564,000 after purchasing an additional 2,000,888 shares during the period. Norges Bank acquired a new stake in shares of Fortinet during the 4th quarter worth about $724,048,000. Finally, Arrowstreet Capital Limited Partnership lifted its position in Fortinet by 39.3% in the fourth quarter. Arrowstreet Capital Limited Partnership now owns 7,622,253 shares of the software maker’s stock valued at $720,150,000 after buying an additional 2,151,811 shares during the last quarter. 83.71% of the stock is owned by hedge funds and other institutional investors.\n\nAbout Fortinet\n\n(Get Free Report)\n\nFortinet, Inc provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products.\n\nRecommended Stories\n\nReceive News & Ratings for Fortinet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fortinet and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Cantor Fitzgerald Forecasts Increased Earnings for Fortinet",
    "description": "Fortinet, Inc. (NASDAQ:FTNT – Free Report) – Investment analysts at Cantor Fitzgerald increased their FY2025 earnings estimates for Fortinet in a report issued on Thursday, May 8th. Cantor Fitzgerald analyst J. Ruykhaver now expects that the software maker wi…",
    "url": "https://www.etfdailynews.com/2025/05/12/cantor-fitzgerald-forecasts-increased-earnings-for-fortinet/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/fortinet-inc-logo-1200x675.png?v=20231228112222&w=240&h=240&zc=2",
    "publishedAt": "2025-05-12T07:14:48Z",
    "content": "Fortinet, Inc. (NASDAQ:FTNT – Free Report) – Investment analysts at Cantor Fitzgerald increased their FY2025 earnings estimates for Fortinet in a report issued on Thursday, May 8th. Cantor Fitzgerald… [+5621 chars]",
    "full_content": "Fortinet, Inc. (NASDAQ:FTNT – Free Report) – Investment analysts at Cantor Fitzgerald increased their FY2025 earnings estimates for Fortinet in a report issued on Thursday, May 8th. Cantor Fitzgerald analyst J. Ruykhaver now expects that the software maker will earn $2.12 per share for the year, up from their prior estimate of $2.06. Cantor Fitzgerald currently has a “Neutral” rating and a $100.00 price target on the stock. The consensus estimate for Fortinet’s current full-year earnings is $2.09 per share.\n\nGet Fortinet alerts:\n\nFortinet (NASDAQ:FTNT – Get Free Report) last announced its quarterly earnings data on Wednesday, May 7th. The software maker reported $0.58 EPS for the quarter, beating analysts’ consensus estimates of $0.53 by $0.05. Fortinet had a net margin of 29.30% and a return on equity of 256.53%. The company had revenue of $1.54 billion for the quarter, compared to the consensus estimate of $1.54 billion. During the same period in the prior year, the firm posted $0.43 EPS. The company’s quarterly revenue was up 13.8% compared to the same quarter last year.\n\nSeveral other research firms have also recently weighed in on FTNT. Robert W. Baird boosted their target price on Fortinet from $110.00 to $113.00 and gave the stock a “neutral” rating in a research note on Tuesday, May 6th. BMO Capital Markets reduced their price objective on shares of Fortinet from $122.00 to $110.00 and set a “market perform” rating for the company in a research report on Thursday. Needham & Company LLC restated a “hold” rating on shares of Fortinet in a report on Friday, February 7th. The Goldman Sachs Group lifted their price target on shares of Fortinet from $114.00 to $130.00 and gave the stock a “buy” rating in a research note on Friday, February 7th. Finally, Scotiabank decreased their price objective on shares of Fortinet from $135.00 to $115.00 and set a “sector outperform” rating for the company in a research note on Thursday. Two equities research analysts have rated the stock with a sell rating, nineteen have given a hold rating, eleven have assigned a buy rating and two have given a strong buy rating to the stock. According to MarketBeat.com, Fortinet currently has an average rating of “Hold” and an average price target of $104.80.\n\nRead Our Latest Research Report on FTNT\n\nFortinet Trading Down 0.3%\n\nNASDAQ:FTNT opened at $97.42 on Monday. Fortinet has a 1 year low of $54.57 and a 1 year high of $114.82. The stock has a market cap of $74.50 billion, a P/E ratio of 43.11, a P/E/G ratio of 4.19 and a beta of 1.16. The company has a debt-to-equity ratio of 0.67, a quick ratio of 1.39 and a current ratio of 1.47. The stock has a 50-day simple moving average of $98.26 and a 200-day simple moving average of $97.59.\n\nInsider Activity\n\nIn other Fortinet news, Director William H. Neukom bought 328 shares of the business’s stock in a transaction dated Thursday, March 6th. The stock was acquired at an average cost of $106.33 per share, with a total value of $34,876.24. Following the purchase, the director now owns 300,006 shares in the company, valued at approximately $31,899,637.98. This represents a 0.11% increase in their position. The transaction was disclosed in a document filed with the SEC, which is accessible through the SEC website. Also, CFO Keith Jensen sold 23,500 shares of the firm’s stock in a transaction that occurred on Wednesday, February 19th. The shares were sold at an average price of $113.56, for a total value of $2,668,660.00. Following the completion of the sale, the chief financial officer now directly owns 4,736 shares of the company’s stock, valued at $537,820.16. This represents a 83.23% decrease in their ownership of the stock. The disclosure for this sale can be found here. Insiders have sold a total of 738,978 shares of company stock valued at $74,135,907 over the last quarter. Corporate insiders own 17.20% of the company’s stock.\n\nInstitutional Inflows and Outflows\n\nInstitutional investors and hedge funds have recently bought and sold shares of the business. SJS Investment Consulting Inc. boosted its position in shares of Fortinet by 703.1% during the 1st quarter. SJS Investment Consulting Inc. now owns 257 shares of the software maker’s stock worth $25,000 after purchasing an additional 225 shares in the last quarter. Edmond DE Rothschild Holding S.A. acquired a new stake in shares of Fortinet in the fourth quarter valued at about $27,000. Clearstead Trust LLC purchased a new stake in Fortinet during the first quarter worth about $28,000. ORG Partners LLC grew its position in Fortinet by 47.5% during the first quarter. ORG Partners LLC now owns 348 shares of the software maker’s stock worth $34,000 after buying an additional 112 shares during the period. Finally, EQ Wealth Advisors LLC acquired a new position in Fortinet during the first quarter worth about $35,000. Institutional investors and hedge funds own 83.71% of the company’s stock.\n\nAbout Fortinet\n\n(Get Free Report)\n\nFortinet, Inc provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products.\n\nFeatured Stories\n\nReceive News & Ratings for Fortinet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fortinet and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Fortinet (NASDAQ:FTNT) Shares Gap Down on Analyst Downgrade",
    "description": "Fortinet, Inc. (NASDAQ:FTNT – Get Free Report) shares gapped down prior to trading on Thursday after UBS Group lowered their price target on the stock from $115.00 to $105.00. The stock had previously closed at $106.72, but opened at $97.60. UBS Group current…",
    "url": "https://www.etfdailynews.com/2025/05/10/fortinet-nasdaqftnt-shares-gap-down-on-analyst-downgrade/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/fortinet-inc-logo-1200x675.png?v=20231228112222&w=240&h=240&zc=2",
    "publishedAt": "2025-05-10T05:32:53Z",
    "content": "Fortinet, Inc. (NASDAQ:FTNT – Get Free Report) shares gapped down prior to trading on Thursday after UBS Group lowered their price target on the stock from $115.00 to $105.00. The stock had previousl… [+5603 chars]",
    "full_content": "Fortinet, Inc. (NASDAQ:FTNT – Get Free Report) shares gapped down prior to trading on Thursday after UBS Group lowered their price target on the stock from $115.00 to $105.00. The stock had previously closed at $106.72, but opened at $97.60. UBS Group currently has a neutral rating on the stock. Fortinet shares last traded at $94.42, with a volume of 5,035,059 shares trading hands.\n\nOther analysts have also issued reports about the company. Cantor Fitzgerald lowered their price objective on Fortinet from $115.00 to $100.00 and set a “neutral” rating for the company in a research report on Thursday, April 24th. DZ Bank cut shares of Fortinet from a “hold” rating to a “sell” rating and set a $95.00 price target for the company. in a research report on Tuesday. Royal Bank of Canada cut their price objective on shares of Fortinet from $110.00 to $105.00 and set a “sector perform” rating on the stock in a report on Thursday. StockNews.com lowered shares of Fortinet from a “buy” rating to a “hold” rating in a report on Tuesday, April 1st. Finally, KeyCorp cut their price target on Fortinet from $120.00 to $115.00 and set an “overweight” rating on the stock in a research note on Thursday. Two research analysts have rated the stock with a sell rating, nineteen have assigned a hold rating, eleven have given a buy rating and two have issued a strong buy rating to the stock. According to data from MarketBeat.com, Fortinet presently has a consensus rating of “Hold” and a consensus target price of $104.80.\n\nGet Fortinet alerts:\n\nView Our Latest Research Report on FTNT\n\nInsider Activity\n\nInstitutional Trading of Fortinet\n\nIn related news, Director William H. Neukom acquired 328 shares of the company’s stock in a transaction on Thursday, March 6th. The stock was purchased at an average cost of $106.33 per share, with a total value of $34,876.24. Following the acquisition, the director now directly owns 300,006 shares of the company’s stock, valued at approximately $31,899,637.98. The trade was a 0.11 % increase in their ownership of the stock. The acquisition was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this hyperlink . Also, VP Michael Xie sold 326,784 shares of the stock in a transaction on Tuesday, March 11th. The stock was sold at an average price of $98.17, for a total value of $32,080,385.28. Following the sale, the vice president now directly owns 11,000,068 shares in the company, valued at approximately $1,079,876,675.56. This trade represents a 2.89 % decrease in their ownership of the stock. The disclosure for this sale can be found here . Over the last ninety days, insiders sold 738,978 shares of company stock worth $74,135,907. Corporate insiders own 18.00% of the company’s stock.\n\nA number of institutional investors and hedge funds have recently made changes to their positions in FTNT. CenterBook Partners LP bought a new stake in Fortinet during the first quarter worth $486,000. 1834 Investment Advisors Co. lifted its position in shares of Fortinet by 84.0% during the 1st quarter. 1834 Investment Advisors Co. now owns 11,979 shares of the software maker’s stock worth $1,153,000 after buying an additional 5,470 shares during the last quarter. Deutsche Bank AG boosted its stake in Fortinet by 5.4% in the first quarter. Deutsche Bank AG now owns 4,464,326 shares of the software maker’s stock valued at $429,736,000 after buying an additional 229,838 shares in the last quarter. Charles Schwab Investment Management Inc. grew its position in Fortinet by 4.5% in the first quarter. Charles Schwab Investment Management Inc. now owns 4,151,597 shares of the software maker’s stock valued at $399,633,000 after acquiring an additional 176,972 shares during the last quarter. Finally, ASR Vermogensbeheer N.V. acquired a new position in Fortinet during the first quarter worth about $4,903,000. Institutional investors own 83.71% of the company’s stock.\n\nFortinet Price Performance\n\nThe business’s fifty day moving average price is $98.26 and its 200 day moving average price is $97.36. The company has a debt-to-equity ratio of 0.67, a current ratio of 1.47 and a quick ratio of 1.39. The stock has a market cap of $74.50 billion, a P/E ratio of 43.11, a PEG ratio of 4.19 and a beta of 1.16.\n\nFortinet (NASDAQ:FTNT – Get Free Report) last issued its quarterly earnings data on Wednesday, May 7th. The software maker reported $0.58 EPS for the quarter, beating the consensus estimate of $0.53 by $0.05. The business had revenue of $1.54 billion during the quarter, compared to the consensus estimate of $1.54 billion. Fortinet had a net margin of 29.30% and a return on equity of 256.53%. The firm’s revenue was up 13.8% compared to the same quarter last year. During the same quarter in the prior year, the firm earned $0.43 EPS. Sell-side analysts forecast that Fortinet, Inc. will post 2.09 EPS for the current fiscal year.\n\nAbout Fortinet\n\n(Get Free Report)\n\nFortinet, Inc provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products.\n\nRecommended Stories\n\nReceive News & Ratings for Fortinet Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fortinet and related companies with MarketBeat.com's FREE daily email newsletter."
  }
]