[
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Jay Peters",
    "title": "Google will pay a $1.375 billion settlement to Texas over privacy violations",
    "description": "Google is set to pay $1.375 billion to settle claims of data privacy violations brought by Texas Attorney General Ken Paxton, according to a press release. Texas filed two lawsuits in 2022 against Google for “unlawfully tracking and collecting users’ private …",
    "url": "https://www.theverge.com/news/664663/google-texas-settlement-1-billion-data-privacy-violations",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/STK093_GOOGLE_E.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-10T00:12:04Z",
    "content": "Texas had filed two lawsuits against Google for how it handled users geolocation, incognito search, and biometric data.\r\nTexas had filed two lawsuits against Google for how it handled users geolocati… [+1044 chars]",
    "full_content": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nGoogle is set to pay $1.375 billion to settle claims of data privacy violations brought by Texas Attorney General Ken Paxton, according to a press release.\n\nTexas filed two lawsuits in 2022 against Google for “unlawfully tracking and collecting users’ private data regarding geolocation, incognito searches, and biometric data,” the release says. Before now, no single state has “attained a settlement against Google for similar data-privacy violations greater than $93 million.”\n\n“This settles a raft of old claims, many of which have already been resolved elsewhere, concerning product policies we have long since changed,” Google spokesperson José Castañeda tells The Verge. “We are pleased to put them behind us, and we will continue to build robust privacy controls into our services.”\n\nIn 2022, Google agreed to pay $391.5 million to 40 states over allegations of location tracking without user consent. Last year, Meta agreed to a $1.4 billion settlement with Texas over facial recognition and photo tags."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Lauren Feiner",
    "title": "Eddy Cue is fighting to save Apple’s $20 billion paycheck from Google",
    "description": "Microsoft's Bing or DuckDuckGo probably won't disrupt Google's dominance in search, said Apple senior vice president of services Eddy Cue - but AI services easily could. Cue was returning to a courtroom in Washington, DC where he last testified in the Justice…",
    "url": "https://www.theverge.com/policy/662974/google-search-remedies-trial-eddy-cue-apple-deal-ai",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/236780_Google_AntiTrust_Trial_Custom_Art_CVirginia__0000_4.png?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-07T21:40:34Z",
    "content": "AI will disrupt Googles search monopoly even without a breakup, the Apple exec says.\r\nAI will disrupt Googles search monopoly even without a breakup, the Apple exec says.\r\nMicrosofts Bing or DuckDuck… [+5172 chars]",
    "full_content": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nMicrosoft’s Bing or DuckDuckGo probably won’t disrupt Google’s dominance in search, said Apple senior vice president of services Eddy Cue — but AI services easily could.\n\nCue was returning to a courtroom in Washington, DC where he last testified in the Justice Department’s trial against Google’s search monopoly in September 2023. During the current remedies trial on Wednesday, Cue said that in the time since, well-funded generative AI upstarts have made such significant advancements that they could ultimately disrupt that monopoly — perhaps more effectively than the court could.\n\nCue was also, however, there to defend a significant source of Apple’s revenue: the payments Google offers for default search engine placement on Apple’s Safari browser.\n\nAfter the 2023 trial, Judge Amit Mehta found that Google illegally monopolized the online search market, in part through agreements like the Safari deal. For the last two and a half weeks, Google and the DOJ have pitched Mehta on what he should (or shouldn’t) do to fix the problem. The DOJ says Google should be forced to share valuable search data with competitors and spin off its Chrome browser, while Google (which plans to appeal the earlier ruling) wants only restrictions on the deals Mehta deemed unfairly exclusionary. And rather than barring its Apple deal altogether, it would make Google give Apple more flexibility to sign additional default search agreements across its various devices or in private browsing mode.\n\nCue argued Wednesday that rapid AI advancements mean the antitrust threat Mehta identified is shrinking. For the first time in 22 years, Cue said, Apple saw search volume decline in its Safari browser last month — a side effect of users seeking more information from AI chatbots. The DOJ, unsurprisingly, disagrees. It’s not uncommon for technological development to outpace the slow trudge of the court system, but the government says that pace isn’t fast enough to fix a persistent market issue.\n\nApple has a lot of skin in the game here — the DOJ previously revealed it rakes in $20 billion in payments from Google annually. Google’s proposed remedies could reduce it, but they would also open up Apple’s options and preserve much of its revenue flow. The DOJ’s, meanwhile, could wipe out that cash flow altogether. Cue seemed bewildered that Apple could get the short end of the stick for a punishment supposedly inflicted on Google. The idea that the court could decide Google did something wrong and then let it save money at Apple’s expense, he said, “just seems crazy to me.”\n\nGoogle could even keep its prime Safari placement without a deal in the short term, Cue said. “We don’t really have a choice today,” he testified. Even if Apple could cut a new default deal with another company, Google is still the best service available for customers, so they’d probably seek it out — and Apple wouldn’t get a cut. Cue said he’s “lost a lot of sleep” over the prospect of losing the Google deal, and warned it would impact Apple’s ability to make new products.\n\nCue also told Mehta he “can’t say I disagree” with his analysis that Apple was disincentivized from building its own search engine because of its deal with Google. But, he added, “we can’t do everything,” and since Google is really good at what it does, Apple prefers to focus on areas where it can offer unique value.\n\nThere’s “much greater potential because there are new entrants that are attacking the problem in a different way”\n\nAI could eventually change all of this, Cue testified. Apple is already exploring adding AI search options, though it recognizes they can’t yet replace traditional search engines. “To date, they’re just not good enough,” he said.\n\nCue said “good enough” could come sooner than he anticipated. He said there’s “much greater potential because there are new entrants that are attacking the problem in a different way.” Large language model (LLM) AI companies haven’t built a robust enough search index to substitute for Google yet, he said, but combining an LLM with search could let them use a smaller index effectively soon.\n\nEven though he is backing Google’s fight to keep its search deals, he seemed to acknowledge that the DOJ’s proposal to syndicate Google’s search index could get AI rivals up to speed even faster.\n\nCue cautioned the judge that tech is not like other industries, and giants often fall even without court intervention. “When I got to Silicon Valley, all of the best companies, or the most successful companies, either don’t exist today or are significantly smaller and less impactful,” Cue said, pointing to companies like HP, Sun Microsystems, and Intel. In the technology field, being an incumbent might not offer the same benefits it does in other markets. “We’re not an oil company, we’re not toothpaste. These are things that are going to last forever,” he said. “You may not need an iPhone 10 years from now.” After nearly four decades at Apple, Cue now sees AI as “a huge technological shift.”\n\nPutting himself in the judge’s shoes, Cue told Mehta, “we’re lucky, because honestly, if AI had not come about, I don’t know what you could do.” That’s because, he explained, “until there are truly competitive products, people will keep using the best one.”"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Wes Davis",
    "title": "Mexico is suing Google over how it’s labeling the Gulf of Mexico",
    "description": "Mexican President Claudia Sheinbaum announced Friday that her government is suing Google for relabeling the Gulf of Mexico as “Gulf of America” for US users, CBS News reports. The company had done so in Google Maps after President Trump ordered the name chang…",
    "url": "https://www.theverge.com/news/664796/mexico-lawsuit-google-gulf-of-mexico-america",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/gettyimages-2210931451.jpg?quality=90&strip=all&crop=0%2C11.739830849778%2C100%2C76.520338300443&w=1200",
    "publishedAt": "2025-05-11T22:26:22Z",
    "content": "Mexican President Claudia Sheinbaum says Trumps name change order only applies to parts of the Gulf under US control.\r\nMexican President Claudia Sheinbaum says Trumps name change order only applies t… [+2395 chars]",
    "full_content": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nMexican President Claudia Sheinbaum announced Friday that her government is suing Google for relabeling the Gulf of Mexico as “Gulf of America” for US users, CBS News reports. The company had done so in Google Maps after President Trump ordered the name change at the beginning of his Presidential term.\n\nThe lawsuit makes good on Sheinbaum’s February threat that Mexico would “proceed to court” if the company didn’t change the name, which it kept as Gulf of Mexico for users in Mexico, but switched to “Gulf of Mexico (Gulf of America)” in regions outside of the two countries. According to a machine-translated transcript of Sheinbaum’s Friday press briefing, she says “the only thing we want is compliance with the decree issued by the United States government,” which, she adds, “wouldn’t have the authority to name the entire Gulf, because that is an international attribution.”\n\nPresident Sheinbaum continues:\n\nWe couldn’t say anything about changing the name of a state, a mountain, or a lake. So, the part of their territory that corresponds to them can be called whatever they decide. The part that corresponds to Mexico can’t be renamed. The part that corresponds to Cuba can’t be renamed, either. So, what we’re saying is, “Google, stick to what the United States government approved.”\n\nPrior to her briefing, Mexico sent letters to Google asking it not to label its territorial waters as Gulf of America, and Sheinbaum shared a reply from Google VP of government affairs and public policy Cris Turner stating the company had no plans to change its policy. CBS News notes that the US House passed a bill on Thursday that would codify the name change.\n\nGoogle did not immediately respond to The Verge’s request for comment."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Emma Roth",
    "title": "DOJ asks court to split up Google’s ad tech empire",
    "description": "The US Department of Justice filed a plan in court to make Google divest its advertising marketplace and ad management platform, part of a proposal to address the company’s “decade-long campaign of exclusionary conduct,” which a judge has declared violates an…",
    "url": "https://www.theverge.com/news/661833/google-ad-tech-business-doj-break-up",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/STK445_ADVERTISING_STK093_GOOGLE_D.jpg?quality=90&strip=all&crop=0,0,100,100",
    "publishedAt": "2025-05-06T14:44:03Z",
    "content": "The governments proposed remedies would force Google to sell pieces of its lucrative ad business.\r\nThe governments proposed remedies would force Google to sell pieces of its lucrative ad business.\r\nT… [+4094 chars]",
    "full_content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nThe US Department of Justice filed a plan in court to make Google divest its advertising marketplace and ad management platform, part of a proposal to address the company’s “decade-long campaign of exclusionary conduct,” which a judge has declared violates antitrust law.\n\nOn Monday, the DOJ and Google both filed requests for remedying the tech giant’s legally declared ad-tech monopoly. The DOJ plan proposes having Google sell two major pieces of its business: its Ad Exchange (AdX) and its ad management platform DoubleClick for Publishers (DFP), which is now called Google Ad Manager. Google, which plans to appeal the original verdict, asks the court to require targeted changes in certain business practices while leaving the company intact.\n\nThe DOJ’s AdX sale pitch cites the court’s April ruling that AdX made it “more difficult for customers on both sides of the ad exchange market to switch to rival exchanges.” It says that Google should sell its AdX business “as soon as possible,” while implementing an interim remedy that would require the marketplace to work with other systems. It also proposes preventing Google from operating an ad exchange for 10 years.\n\nThe DOJ suggests a “phased” divestiture of Ad Manager/DFP. This divestiture addresses a ruling that Google forced customers to use a product “they would not necessarily have otherwise used” by tying DFP to AdX, while also implementing policies that customers disliked, according to the DOJ.\n\nFor the first phase, the DOJ proposes having Google create an API that would allow the platform to integrate with other ad exchanges, as well as provide an export feature that would let publishers transfer their data from DFP to another ad server. The DOJ then suggests forcing Google to release the code used to carry out final ad auctions under an open-source license, while blocking it from “hosting or recreating” the code in any of its products, including DFP, Android, and Chrome. The final phase of the DOJ’s proposal would require Google to divest the remainder of DFP to an entity separate from the one that acquires AdX.\n\nAlong with these proposals, the DOJ suggests forcing Google to share the data it obtained through DFP and says it shouldn’t use first-party data from YouTube, Gmail, Search, Chrome, and Android to gain an unfair advantage.\n\nGoogle, of course, disagrees with these proposals. In a filing outlining its proposed remedies, Google argues that it shouldn’t be forced to sell AdX or DFP because it fairly acquired these businesses without unlawful intent. Google adds that because of the services’ design, “divestiture is not as simple as selling either the AdX or DFP source code to a willing buyer.” The company claims divestiture would require the creation of new versions of AdX and DFP that work outside Google, a process it estimates would take at least five years.\n\n“In the meantime, this process would significantly harm the customers of AdX and DFP,” Google says. “During the years of rebuilding either or both of AdX and DFP, coding new versions of the tools would conscript precious resources, including the limited universe of software engineers familiar with these tools, that are currently devoted to maintaining and improving AdX and DFP.”\n\nTo resolve the court’s concerns, Google proposes barring a handful of business practices that the DOJ singled out for criticism in court. It commits to making real-time bids from AdX available to rival ad servers, as well as removing policies that prevent these bids from being shared with competitors. It also says it would deprecate unified pricing rules (UPR), which the DOJ claims it used to unfairly gain control in the ad tech market. Google would also promise not to rebuild the First Look and Last Look tools — which gave Google a leg up in ad auctions — that it discontinued in 2019.\n\nThe tech giant is under mounting pressure from the DOJ, which is currently in court asking a judge to make Google sell Chrome as part of a separate antitrust case that saw Google search ruled a monopoly. These new proposals threaten to split up Google’s sprawling empire even further."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Jess Weatherbed",
    "title": "Google’s iOS app will use AI to simplify jargon",
    "description": "Google has a new AI tool that can help iPhone users to better grasp complicated or confusing writing online. The Simplify feature, rolling out in the Google app on iOS starting today, generates a simpler, more digestible version of any highlighted text withou…",
    "url": "https://www.theverge.com/news/661695/google-simplify-ai-gemini-feature-ios-app",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/STK093_GOOGLE_B.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-06T11:43:18Z",
    "content": "The new Simplify feature makes complex online text easier to understand without losing key details.\r\nThe new Simplify feature makes complex online text easier to understand without losing key details… [+1408 chars]",
    "full_content": "Google has a new AI tool that can help iPhone users to better grasp complicated or confusing writing online. The Simplify feature, rolling out in the Google app on iOS starting today, generates a simpler, more digestible version of any highlighted text without leaving the current web page.\n\nSimplify is built on Google’s Gemini AI model, and was developed by Google Research to make technical jargon easier for anyone to understand without losing key details. For example, Simplify can break down medical terms like “emphysema” (a condition that damages the air sacs in lungs) and “fibrosis” (dense connective tissue or scarring that develops in response to damage) in reports and journals, preventing readers from needing to reference terminology on a separate web page.\n\nThe simplified version of selected text will appear in a pop-up window that can be dismissed when it’s no longer required. GIF: Google\n\nGoogle says that people found the simplified versions to be “significantly more helpful than the original complex text” in its testing, but acknowledged the study “has limitations” and that “ongoing vigilance” is required to monitor errors.\n\nThe feature can be found in the iOS Google app by highlighting any text on a website, and tapping the Simplify icon from the menu options that appear. When asked if Simplify will be made available for Android and desktop Chrome users, Google spokesperson Jennifer Kutz told The Verge that “we don’t have anything to announce yet, but we’re always looking to bring useful features to more of our products.”"
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "Mexico sues Google over 'Gulf of America' name change",
    "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
    "url": "https://www.bbc.com/news/articles/c5yk5nj7p7ko",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/f21f/live/5e43af80-2cf1-11f0-8442-c7c5689971ef.jpg",
    "publishedAt": "2025-05-09T18:10:02Z",
    "content": "Mexico is suing Google for ignoring repeated requests not to call the Gulf of Mexico the Gulf of America on Google Maps for US users, President Claudia Sheinbaum says. \r\nShe did not say where the law… [+1955 chars]",
    "full_content": "Mexico sues Google over 'Gulf of America' name change\n\n4 days ago Share Save Danai Nesta Kupemba BBC News Share Save\n\nGetty Images Mexican President Claudia Sheinbaum has asked the tech company multiple times to change the name\n\nMexico is suing Google for ignoring repeated requests not to rename the Gulf of Mexico the Gulf of America for US users on its maps service, Claudia Sheinbaum has said. The Mexican president did not say where the lawsuit had been filed. Google did not respond to the BBC's request for comment. On Thursday, the Republican-led House of Representatives voted to officially rename the Gulf for federal agencies. US President Donald Trump signed an executive order on his first day in office in January calling for the body of water to be renamed, arguing the change was justified because the US \"do most of the work there, and it's ours\".\n\nHowever, Sheinbaum's government contends that Trump's order applies only to the US portion of the continental shelf. \"All we want is for the decree issued by the US government to be complied with,\" she said, asserting that the US lacks the authority to rename the entire gulf. Sheinbaum wrote a letter to Google in January asking the firm to reconsider its decision to rename the Gulf of Mexico for US users. The following month, she threatened legal action. At the time, Google said it made the change as part of \"a longstanding practice\" of following name changes when updated by official government sources. It said the gulf - which is bordered by the US, Cuba and Mexico - would not be changed for people using the app in Mexico, and users elsewhere in the world will see the label: \"Gulf of Mexico (Gulf of America)\".\n\nThe Gulf of Mexico has been renamed the Gulf of America on Google Maps in the US"
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Dominic Preston",
    "title": "Google’s AI image-to-video generator launches on Honor’s new phones",
    "description": "Chinese phone manufacturer Honor has launched an image-to-video AI generator powered by Google, before it’s available to Gemini users. It will be available first for anyone who buys the Honor 400 or 400 Pro phones, which launch next week on May 22nd. The new …",
    "url": "https://www.theverge.com/news/664812/google-honor-ai-image-to-video-gemini",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/VID_20250512_084119.gif?quality=90&strip=all&crop=0,3.5738046339417,100,92.852390732117",
    "publishedAt": "2025-05-12T08:45:06Z",
    "content": "Honor 400 buyers will be the first to try Googles effort at creating videos from images on a phone.\r\nHonor 400 buyers will be the first to try Googles effort at creating videos from images on a phone… [+2102 chars]",
    "full_content": "Chinese phone manufacturer Honor has launched an image-to-video AI generator powered by Google, before it’s available to Gemini users. It will be available first for anyone who buys the Honor 400 or 400 Pro phones, which launch next week on May 22nd.\n\nThe new AI tool, powered by Google’s Veo 2 model, creates five-second videos based on static images, in either portrait or landscape, and takes a minute or two to generate each time. The feature is built directly into the Gallery app on the new Honor phones, and is designed to be simple: there’s no option to include a text prompt along with the image, so you’re stuck hoping that the AI does something sensible with it.\n\nPrevious Next\n\n1 / 2 A photo I took at a Feeder show.\n\nSometimes it works well. Give it a simple subject, like a clear photo of a person or pet, and it can generate quite realistic movement — albeit I’m pretty sure my cat Noodle’s tongue isn’t quite that big. Other subjects prove trickier: faced with a vintage car it made it rotate impossibly on the spot; fresh tomatoes were fondled by a ghostly hand; and it imagined a women’s soccer game with at least 27 players across three teams, with two referees to keep control of the chaos. The first time I tried it, on a self-portrait by Vincent Van Gogh, it decided that the most appropriate thing would be for a pigeon to fly out of his eye.\n\nNote: Honor’s app outputs videos in MP4, which we’ve converted to GIFs, slightly reducing the image quality of the clips.\n\nThe image-to-video feature will be available to Honor 400 owners for free for the first two months, but with a limit of 10 video generations per day. Honor’s UK marketing director Chris Langley told me that it “will eventually require some subscription” from Google, but the details of that are unknown.\n\nVideo generation using Veo 2 is already included in Google’s paid Gemini Advanced subscription, but is currently limited to text input. Image-to-video generation is listed as one of Veo 2’s features in Google Cloud, where Google charges customers 50 cents per second of output, but is available to “approved users” only.\n\nPhotography and videos by Dominic Preston / The Verge."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Wes Davis, Lauren Feiner",
    "title": "Apple’s Eddy Cue: ‘You may not need an iPhone 10 years from now’",
    "description": "Eddy Cue, Apple’s senior vice president of services, gave an ominous warning today that the iPhone could go the way of the iPod 10 years from now. And the reason, as one might guess, is artificial intelligence. Cue’s remarks came during the Google Search anti…",
    "url": "https://www.theverge.com/news/662769/apple-iphone-may-not-need-10-years",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/gettyimages-2160777605.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C74.160763781953&w=1200",
    "publishedAt": "2025-05-07T17:37:18Z",
    "content": "Cue suggests AI could make the iPhone go the way of Apples former golden goose, the iPod.\r\nCue suggests AI could make the iPhone go the way of Apples former golden goose, the iPod.\r\nEddy Cue, Apples … [+1604 chars]",
    "full_content": "Eddy Cue, Apple’s senior vice president of services, gave an ominous warning today that the iPhone could go the way of the iPod 10 years from now. And the reason, as one might guess, is artificial intelligence.\n\nCue’s remarks came during the Google Search antitrust remedies trial today while discussing how AI has the potential to reshape the tech industry and open the door to new entrants.\n\nIncumbents have a hard time ... we’re not an oil company, we’re not toothpaste — these are things that are going to last forever ... you may not need an iPhone 10 years from now.\n\nCue went on to say that the best thing Apple did was kill the iPod, a move he said was bold. “Why would you kill the golden goose,” he added.\n\nThat may seem like a silly thing for Apple to say, given that more than half of its revenue is iPhone sales. But Cue calls AI a “huge technological shift,” and suggests that such shifts can humble companies that once seemed unassailable. “When I got to Silicon Valley,” he said, “all the best companies or the most successful companies” — he mentioned HP, Sun Microsystems, and Intel — “either don’t exist today or are significantly smaller and much less impactful.”"
  },
  {
    "source": {
      "id": null,
      "name": "MacRumors"
    },
    "author": "Juli Clover",
    "title": "Google Gemini App Gets iPad Optimization",
    "description": "Google today updated its dedicated Gemini iOS app to add an iPad-friendly interface, allowing the AI assistant to take up the full real estate of an iPad display.\n\n\n\n\n\nThe Gemini app has been compatible with both the iPhone and the ‌iPad‌ since it launched, b…",
    "url": "https://www.macrumors.com/2025/05/07/google-gemini-app-gets-ipad-optimization/",
    "urlToImage": "https://images.macrumors.com/t/EjJbcRqin3N06CStdPnI70uRFfU=/1920x/article-new/2024/03/google-gemini.jpg",
    "publishedAt": "2025-05-07T21:59:45Z",
    "content": "Google today updated its dedicated Gemini iOS app to add an iPad-friendly interface, allowing the AI assistant to take up the full real estate of an iPad display.\r\nThe Gemini app has been compatible … [+1013 chars]",
    "full_content": "Google today updated its dedicated Gemini iOS app to add an iPad-friendly interface, allowing the AI assistant to take up the full real estate of an iPad display.\n\n\n\nThe Gemini app has been compatible with both the iPhone and the ‌iPad‌ since it launched, but until the latest update, using it on the ‌iPad‌ showed an iPhone-sized interface. The latest version of Gemini adds ‌iPad‌ optimization, plus it includes an option to add a Gemini Home Screen widget, and integration with Google Photos.\n\nWhat's New\n\n- Gemini now has a full-screen, optimized iPad app\n\n- Gemini can now be added as a homescreen widget\n\n- Gemini can now connect with your Google Photos library\n\n- UI improvements and bug fixes\n\nThe Gemini app for ‌iPhone‌ and ‌iPad‌ allows users to access Google Gemini AI. Gemini connects to Google apps like Search, YouTube, Gmail, and Google Maps, plus it has research capabilities, the ability to generate images, study tools, and an option for brainstorming ideas.\n\nGemini is free to use, but Gemini Advanced, a more capable version of Gemini, requires a Google One AI Premium subscription. Google One AI Premium is priced at $19.99 per month, which is competitive with similar plans from Anthropic and OpenAI."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Peter Kafka",
    "title": "Apple says AI is cutting into Google search. Google says that's not true. Who's right?",
    "description": "Apple says AI engines like ChatGPT are cutting into Google search, but Google says that's not true. Both arguments could be true.",
    "url": "https://www.businessinsider.com/apple-google-disagree-ai-cutting-into-search-2025-5",
    "urlToImage": "https://i.insider.com/681d04f53fe8d39283655703?width=1200&format=jpeg",
    "publishedAt": "2025-05-08T19:26:03Z",
    "content": "Apple says AI engines like ChatGPT are cutting into Google search.Smith Collection/Gado/Getty Images\r\n<ul><li>Google stock tumbled Wednesday after Apple executive Eddy Cue said AI rivals were cutting… [+4687 chars]",
    "full_content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nIs Google screwed?\n\nThat's the $2 trillion question the tech world is trying to understand following Wednesday's blockbuster news: A top Apple executive said search queries on the company's Safari browser were declining because people were using AI engines like ChatGPT instead.\n\nInvestors immediately acted as if Google's astonishing run at the top of the tech heap was over, and slashed the company's stock by more than 8%.\n\nBut a day later, Google's stock was climbing back up a bit, and there's a healthy debate about what Cue's statement means — as well as why he said it.\n\nSpoiler: I'm not going to solve this one today. But let's at least look at the argument.\n\nThe most obvious way to view Cue's comments was the way Wall Street did: that Google search dominance was being eroded by AI competitors.\n\nAfter all, fear of being usurped by AI is what pushed Google to fast-track its own AI efforts, even when some of those efforts created embarrassing results.\n\nBut later on Wednesday, Google put out a statement that basically said Cue was wrong, without actually saying that out loud. Instead, the company said it was continuing to see increasing searches, and \"that includes an increase in total queries coming from Apple's devices and platforms.\"\n\nSo that looks like two of the world's most powerful and valuable companies are disagreeing over basic, knowable facts.\n\nBut people who pay attention to this stuff are focusing on three key words in Google's statement: \"total,\" \"devices,\" and \"platforms.\" And the absence of another word: \"Safari.\"\n\nAnd that's leading them to translate Google's statement this way: \"Maybe Apple really is seeing fewer searches on Safari, the default web browser on iPhones. But you can use Google in other ways on iPhones — namely, via the Google app, but also via Google's own Chrome browser. And people are using those more — enough to counter any decline elsewhere.\"\n\nAssuming that this translation is accurate, that should reassure Google and its boosters a bit, though not completely: Cue said the searches on Safari were down for the first time ever, and that's not the kind of signal you can just wave away.\n\nAnd even if Safari Google searchers are really moving to things like the Google app instead, that also underlines the fact that people who used to just type something into their iPhone browser know now they can get results other ways. And there's no reason they couldn't also be searching on Google competitors like ChatGPT.\n\nA Google rep declined to comment; Apple hasn't responded to my request for comment.\n\nGoogle investors, by the way, don't seem 100% convinced by Google's statement: The stock is up 3% on Thursday, which means Google is still worth 5% less than it was Wednesday morning, when Cue started testifying in the US vs. Google antitrust trial.\n\nWhich brings us to the second question Google and Apple watchers are speculating about: Why did Cue say what he said in court, after all?\n\nI'm an Occam's razor guy, so my first take was that Cue answered the questions he was asked in court.\n\nBut there's also a 4D chess argument, put forth by folks like MoffettNathanson's analyst Michael Nathanson. It goes like this: Cue has an incentive to portray Google as a wounded animal.\n\nThat's because Google pays Apple at least $20 billion a year to make Google the default search engine on Safari (that's the reason Cue has insight into Google's search activity), and a federal judge has already declared that Google has an illegal monopoly in search.\n\nAnd one of the remedies the judge could push for would be to prevent Google from paying Apple for that valuable real estate — which would mean Apple could lose all of that high-margin revenue.\n\nSo, the theory goes, convincing the judge that Google no longer has a stranglehold on search, because of AI competition, might allow those payments to keep flowing after all.\n\nThat theory also helps explain Google's muted response on Wednesday night, where the company tried to walk the line between tooting its own horn (which bucks up investors but could damage its legal argument) and acknowledging that it has real competition (which could help Google in court but hurt it in the market).\n\nWhich brings us back to where we started: Is Google really starting to lose out to the ChatGPTs of the world, and entering a permanent decline, just like pay-TV networks a decade ago? Or is it holding its own despite the competition? Depending on where you're asking the question, Google might give you a different answer.\n\nCorrection: May 8, 2025 — An earlier version of this story misstated which company the Safari browser belongs to. It's Apple, not Google."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Jennifer Pattison Tuohy",
    "title": "Matter’s latest update brings tap-to-pair setup",
    "description": "Two new features coming to Matter are designed to make setting up smart gadgets easier. Multi-device QR codes and a tap-to-pair onboarding via NFC are new options for adding devices like smart lights, plugs, locks, and more to a Matter home network. The updat…",
    "url": "https://www.theverge.com/news/662266/matter-spec-update1-4-1-nfc-multi-device-setup",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/01/STKS495_Smart_Home_CVIRGINIA_E.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-07T11:59:19Z",
    "content": "The smart home interoperability standard looks to streamline how you add smart devices to your home.\r\nThe smart home interoperability standard looks to streamline how you add smart devices to your ho… [+4701 chars]",
    "full_content": "Two new features coming to Matter are designed to make setting up smart gadgets easier. Multi-device QR codes and a tap-to-pair onboarding via NFC are new options for adding devices like smart lights, plugs, locks, and more to a Matter home network. The updates are part of the new 1.4.1 specification for Matter announced today by the Connectivity Standards Alliance, the organization that runs the smart home interoperability standard developed by Apple, Amazon, Google, Samsung, and others in the industry.\n\nWith multi-device QR codes, a multi-pack of devices – such as four lightbulbs or a two-pack of plugs – can now use a single QR code. When that’s scanned into a Matter-compatible app, such as Amazon Alexa or Apple Home, it will set up all four bulbs at once, rather than you having to go through the setup four times and scan each code individually, which is the current process.\n\nNFC onboarding brings the option to skip the QR code and just tap or bring your phone near to a device to pair it to a Matter platform. This should speed up the process as well as make it easier to set up devices that have codes in awkward spots, such as lightbulbs, which have to be powered on to be paired. Trying to scan a code on a bulb when it’s already in the fixture can be tricky, not to mention painful to the eyes (speaking from experience).\n\nNFC set-up isn’t new; Apple has offered it as a way of adding HomeKit accessories for a while, and smart lighting manufacturer Nanoleaf also has it as an option on its devices. But it’s not widely used. Hopefully, the addition to the Matter spec will bring more adoption.\n\nA third update with 1.4.1 allows you to accept any terms and conditions a manufacturer requires directly from the smart home controller app you’re using to set up the device — such as Google or Apple’s Home app. Currently, if T&Cs are required, you’ll be kicked into the manufacturer app.\n\nCalled Enhanced Setup Flow, this appears to be designed to meet regulatory requirements such as Europe’s GDPR, but it could be a step towards adding more manufacturer information in smart home controller apps, meaning less need to use third-party apps.\n\nWe won’t see security cameras, smart speakers, or any new major features come to Matter until late 2025 at the earliest\n\nThe release of the Matter 1.4.1 spec and SDK means developers can now implement these features in their devices. However, it will still be a while before you see them on the gadgets you buy for your smart home, and it could be even longer before the smart home platform you use supports them.\n\nAnything that makes setting up a Matter device smoother is a welcome update. To date, the process has been very hit or miss for me, and I’m not alone. While things have definitely improved, easy setup is one of the core ideas behind the standard. It’s been over two years since Matter launched, and I would have hoped this would be solved already.\n\nThese updates are very minor for a new spec release, which is why it has the 1.4.1 designation — the first dot dot release for Matter. The CSA confirmed this is its official spring release, labeling it Matter’s first “minor release,” and saying that they are still on a bi-annual release cadence following the 1.4 update in November 2024. This means we won’t see security cameras, smart speakers, or any other new device types or major features come to Matter until late 2025, at the earliest.\n\nWhile that’s disappointing for those of us watching Matter closely, it does jive with the CSA’s statement from earlier this year that 2025 is going to be a year of focusing on reliability and performance."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "vishnu.skar@gmail.com (Vishnu Sarangapurkar)",
    "title": "Walmart's leaked Onn 4K Plus offers affordable Google TV Streaming",
    "description": "A now-deleted Walmart listing revealed the upcoming Onn 4K Plus streaming device, powered by Google TV and priced under $30.",
    "url": "https://www.androidcentral.com/streaming-tv/android-tv/walmarts-leaked-onn-4k-plus-offers-affordable-google-tv-streaming",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/aHASxsWjWXmzpsZDNK4nYU.jpg",
    "publishedAt": "2025-05-10T13:06:45Z",
    "content": "What you need to know\r\n<ul><li>The Onn 4K Plus is an upcoming Google TV-powered streaming device priced under $30, as revealed by a leaked Walmart listing.</li><li>The key features of the device incl… [+2351 chars]",
    "full_content": "What you need to know\n\nThe Onn 4K Plus is an upcoming Google TV-powered streaming device priced under $30, as revealed by a leaked Walmart listing.\n\nThe key features of the device include a quad-core processor, 2GB of RAM, 16GB of storage, Wi-Fi 6, Dolby Vision Atmos, Google Assistant, Google Cast, and smart home control capabilities.\n\nThis affordable device appears to be a viable replacement for the discontinued Chromecast with Google TV (4K), potentially undercutting competitors.\n\nWalmart has some decent replacements for Google’s Chromecasts with its set of Onn streaming devices. Now, a new listing (now removed) revealed a supposedly upcoming streaming device dubbed Onn 4K Plus.\n\nThe pulled-out listing (spotted by 9to5Google) showcases the upcoming Onn 4K Plus streaming device, which features Google TV and has an attractive price retailing just under $30. The publication further notes that the same streaming device was leaked through some photos early last month, as it was accidentally posted on a review site.\n\nImage 1 of 2 (Image credit: Walmart/ via 9to5Google) (Image credit: Walmart/ via 9to5Google)\n\nHowever, the new Walmart listing reveals the device in full, including pricing, and more of what to expect. The Onn 4K Plus features a quad-core processor, 2GB of RAM, and 16GB of storage. It further provides Wi-Fi 6 support. Additionally, the streaming device supports Google Assistant, Google Cast, Dolby Vision Atmos certification, and HDMI.\n\nUsers will be able to perform smart home control tasks like handling lights and thermostats connected to the same network, as it appears the new Google Home panel is a highlighted feature.\n\nAn affordable 4K streaming device\n\nSince it's Google TV, one can find dedicated buttons on the remote to trigger Google Assistant and Free TV, as well as launch buttons for streaming services like YouTube, Netflix, Disney Plus, and Paramount Plus.\n\nThe new Onn 4K Plus joins the other two 4K streaming devices the company already provides — the Onn 4K streaming (2023) and 4K Pro streaming (2024). With the Chromecast with Google TV (4K) discontinuing last year, it appears the upcoming Onn 4K Plus should be a viable option to consider, given the affordable price it seems to be coming in.\n\nIn comparison, the Roku Streaming Stick Plus is also currently retailing at $39.99. Now we just need to wait for the device to actually launch."
  },
  {
    "source": {
      "id": null,
      "name": "MacRumors"
    },
    "author": "Juli Clover",
    "title": "Google Using AI to Combat Scams in Chrome",
    "description": "Google today shared details on some of the new ways that it is incorporating artificial intelligence into its search products in order to combat online scams.\n\n\n\n\n\nIn Chrome for the desktop, the Enhanced Protection mode for safer browsing now incorporates Gem…",
    "url": "https://www.macrumors.com/2025/05/08/google-using-ai-to-combat-scams-in-chrome/",
    "urlToImage": "https://images.macrumors.com/t/kKde5DupoYItKCh_vHDh8x0ZMBU=/2500x/article-new/2022/06/Chrome-Feature-22.jpg",
    "publishedAt": "2025-05-08T19:45:31Z",
    "content": "Google today shared details on some of the new ways that it is incorporating artificial intelligence into its search products in order to combat online scams.\r\nIn Chrome for the desktop, the Enhanced… [+835 chars]",
    "full_content": "Google today shared details on some of the new ways that it is incorporating artificial intelligence into its search products in order to combat online scams.\n\n\n\nIn Chrome for the desktop, the Enhanced Protection mode for safer browsing now incorporates Gemini Nano, an on-device large language model. Gemini Nano is able to provide instant insight to users about websites that might be risky, even if it's a scam that hasn't been seen before.\n\nGoogle says that Gemini Nano is able to distill the varied, complex nature of websites, making it quicker for Google to adapt to new scam tactics. Specifically, Gemini Nano is used to protect users from remote tech support scams, but Google plans to expand it to more types of scams in the future.\n\nGoogle is using AI to cut down on specific scams in Chrome for Android. Google delivers AI-powered warnings for spammy or misleading notifications, prompting users to unsubscribe. This isn't a feature available on the desktop or iOS devices as of yet, but Google could expand it in the future."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "vishnu.skar@gmail.com (Vishnu Sarangapurkar)",
    "title": "Google Maps for iOS simplifies saving locations from screenshots",
    "description": "The new feature is utilizing Gemini, and the app can recognize places in your photos and create a dedicated list within the 'You' tab.",
    "url": "https://www.androidcentral.com/apps-software/google-maps/google-maps-for-ios-simplifies-saving-locations-from-screenshots",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/ERpQEgeCnpxkoeG283bSR6.jpg",
    "publishedAt": "2025-05-08T17:59:18Z",
    "content": "What you need to know\r\n<ul><li>Google Maps on iOS now lets you save locations directly from screenshots using Gemini.</li><li>A new \"Screenshots\" list can be seen in the 'You' tab on Google Maps, pro… [+2476 chars]",
    "full_content": "What you need to know\n\nGoogle Maps on iOS now lets you save locations directly from screenshots using Gemini.\n\nA new \"Screenshots\" list can be seen in the 'You' tab on Google Maps, prompting users to review and save recognized locations.\n\nThe new feature eliminates the need to manually search for locations seen in screenshots on social media or the web.\n\nGoogle Maps for iOS is getting quite an interesting feature that lets you save locations from screenshots.\n\nImagine you are that kind of person who often checks for new places either on the web or on social media — like a reel that shows some beautiful location. While you immediately screenshot it, Google Maps can now make a list of such screenshots in the app and help you save that location with the help of Gemini.\n\nIt is supposedly a new functionality, which is rolling out to Google Maps for iOS devices (via 9to5Google). Previously, users who saved the aforementioned screenshots would go into their phone's gallery to see the location and again open up the Maps location and check for the location to get an idea.\n\nThe new Maps feature, however, would save you from these steps and instead users would need to check for the 'You' tab in the Google Maps app wherein users will see a new Screenshots list with a badge indicating \"Try it out.\"\n\n(Image credit: Google)\n\nUsing the new Screenshots feature on Google Maps\n\nGoogle shares a how-to post explaining how to use the feature. Tapping \"Try it out\" will open up a video showcasing how the feature works, and users can simultaneously check the feature as well.\n\nFirstly, users will have to allow Google Maps to access their photos, following which whenever a user takes a screenshot of the location info, they can directly head to the Google Maps app wherein it recognizes a place and \"a message will pop up telling you that it has places ready for you to review.\"\n\nUsers can then tap \"review\" if they want to save the image to their screenshots list or not, which is found on the \"You\" section of the Google Maps app. Consumers can also add older screenshots to the same list if they want to.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\n(Image credit: Derrek Lee / Android Central)\n\nWith the help of Gemini, users will be able to see the saved directly on their Google Maps or can look from the aforementioned list whenever required.\n\nAs 9to5 notes, the feature is currently rolling out to iOS devices, and Android handsets are likely to get it soon. Google previously highlighted this feature earlier this year in March, as part of its AI updates to get users ready for the summer. There were other updates mentioned, as well, like the ability for users to receive \"trip ideas\" for distinct regions and places in AI Overviews."
  },
  {
    "source": {
      "id": null,
      "name": "MacRumors"
    },
    "author": "Tim Hardwick",
    "title": "Google Disputes Apple VP's Claim of Safari Search Traffic Decline",
    "description": "Google has issued a rare public statement seemingly contradicting Apple senior VP Eddy Cue's courtroom testimony that Safari browser searches declined for the first time in April 2025.\n\n\n\n\n\nCue's comments, made during the ongoing U.S. Justice Department antit…",
    "url": "https://www.macrumors.com/2025/05/08/google-disputes-safari-search-traffic-decline/",
    "urlToImage": "https://images.macrumors.com/t/F4F4I3mtoYMc4_O_LbW1_JUfGPc=/2500x/article-new/2022/02/Google-Logo-Feature-Slack.jpg",
    "publishedAt": "2025-05-08T08:38:39Z",
    "content": "Google has issued a rare public statement seemingly contradicting Apple senior VP Eddy Cue's courtroom testimony that Safari browser searches declined for the first time in April 2025.\r\nCue's comment… [+1299 chars]",
    "full_content": "Google has issued a rare public statement seemingly contradicting Apple senior VP Eddy Cue's courtroom testimony that Safari browser searches declined for the first time in April 2025.\n\n\n\nCue's comments, made during the ongoing U.S. Justice Department antitrust lawsuit against Google, triggered a 7.51% drop in Google's stock price on Wednesday.\n\nIn a post to its blog The Keyword, under the title \"Here's our statement on this morning's press reports about Search traffic,\" Google said:\n\n\n\nWe continue to see overall query growth in Search. That includes an increase in total queries coming from Apple's devices and platforms. More generally, as we enhance Search with new features, people are seeing that Google Search is more useful for more of their queries — and they're accessing it for new things and in new ways, whether from browsers or the Google app, using their voice or Google Lens. We're excited to continue this innovation and look forward to sharing more at Google I/O.\n\nThe dispute centers around the $20 billion agreement making Google the default search engine on Apple devices. While testifying, Cue attributed the alleged search decline to users switching to AI services like ChatGPT, Perplexity, and Claude.\n\nCue added that he believes AI services will eventually replace conventional search engines like Google. As a result, Apple will need to add them as options in Safari in the future. Cue said the company had already held discussions with Perplexity about browser integration."
  },
  {
    "source": {
      "id": null,
      "name": "CNET"
    },
    "author": "Tiffany Connors",
    "title": "Google Accidentally Leaks Android's Upcoming Material 3 Expressive Design Language",
    "description": "The tech giant removed the blog post, which revealed goals to make the interface less 'boring.'",
    "url": "https://www.cnet.com/tech/google-accidentally-leaks-androids-upcoming-material-3-expressive-design-language/",
    "urlToImage": "https://www.cnet.com/a/img/resize/058a8e97752750627f779f1c8aa29f7d293ee0ee/hub/2024/12/23/f0cec6eb-efca-4a0a-9408-7e1aefe5de89/google-story.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2025-05-06T13:57:01Z",
    "content": "Ahead of its planned announcement this month, Google apparently accidentally published a blog post on Tuesday with details about the thinking behind the development of Material 3 Expressive, its open… [+1012 chars]",
    "full_content": "Ahead of its planned announcement this month, Google apparently accidentally published a blog post on Tuesday with details about the thinking behind the development of Material 3 Expressive, its open-source design system.\n\nThe post shared research behind the design of the interface, as first reported by 9to5Google, which shared the now-deleted post saved in the Wayback Machine. The thought process behind the company's \"expressive design\" involved making the user interface easier to use and less \"boring,\" according to the post.\n\n\"The fundamental parts of expressive design are the use of color, shape, size, motion and containment,\" the post said. \"These design aspects are also fundamental to what makes a product more usable by drawing attention to what matters in the interface: Making key actions stand out, and grouping like elements together.\"\n\nThe post noted that the elements researched included:\n\nProgress indicators: Which ones made the waiting time feel faster?\n\nButtons: How big can they get to improve tap time without overwhelming the screen?\n\nFloating toolbars: How can they be noticeable and usable?\n\nGoogle did not immediately respond to a request for comment."
  }
]