[
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Tom Warren",
    "title": "How Microsoft shrunk its Surface devices",
    "description": "Microsoft has brought me inside the Surface hardware lab from time to time over the years, showing me how its engineers test the hinges and fabrics that go into its products. They're usually typical engineering demonstrations, but last month I was invited to …",
    "url": "https://www.theverge.com/notepad-microsoft-newsletter/661617/microsoft-surface-hardware-engineering-labs-tour-notepad",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/DSC00834.jpg?quality=90&strip=all&crop=0%2C10.806933475316%2C100%2C78.386133049368&w=1200",
    "publishedAt": "2025-05-07T14:12:44Z",
    "content": "Inside the hardware engineering of the new Surface Pro and Laptop.\r\nInside the hardware engineering of the new Surface Pro and Laptop.\r\nMicrosoft has brought me inside the Surface hardware lab from t… [+7872 chars]",
    "full_content": "is a senior editor and author of Notepad , who has been covering all things Microsoft, PC, and tech for over 20 years.\n\nMicrosoft has brought me inside the Surface hardware lab from time to time over the years, showing me how its engineers test the hinges and fabrics that go into its products. They’re usually typical engineering demonstrations, but last month I was invited to Microsoft’s headquarters in Redmond, Washington, to see how the company built its two new smaller Surface Pro and Surface Laptop devices. And this time around, I was pleasantly surprised to be shown how Microsoft uses magnets, robots, drop tests, and smoke to perfect its laptop and tablet designs.\n\nThe first stop on the tour led me inside Microsoft’s advanced prototype center, where Surface engineers are constantly creating prototypes to refine the fit and finish on a new product like the Surface Pro 12-inch. One of the new challenges for this device was getting the Surface Pen to attach to the rear of the tablet — and stay there.\n\nMicrosoft stress tests its Surface Slim Pen on a Surface Pro 12-inch. Image: Vjeran Pavic / The Verge\n\nMicrosoft wanted the stylus to attach with one hand but still be tough enough to stay in place when you slide it into a backpack. Engineers designed different magnet combinations, then tested their effectiveness with machines that record the force and distance needed to remove the pen. The team then tweaked their tests and designs to make sure there was a consistent feel on every single Surface Pro.\n\nThis same testing is used for the hinge design and magnetic keyboard. Microsoft has created a variety of tests to measure pass and fail rates on prototypes of keyboards to make sure they can attach at multiple angles. That’s particularly important on a smaller keyboard, and it’s something I’m going to be testing myself when I review the Surface Pro 12-inch.\n\nMicrosoft has also been obsessing over performance and battery life on its Qualcomm-powered Surface Laptop devices over the past year, touting them as MacBook Air killers. While the new Surface Pro has moved to a fanless design, Microsoft is sticking with a fan on the new 13-inch Surface Laptop to help cool the chips inside and provide competitive performance. As there’s a fan inside, Microsoft has had to simulate airflow through the cooling system to ensure its prototypes are hitting their targets without throttling too soon.\n\nThe smoke test lets Surface engineers see how airflow is working on a Surface Laptop 13-inch. Image: Vjeran Pavic / The Verge\n\nSurface engineers use smoke to do this, much like how a number of PC gaming YouTubers demonstrate the airflow of modern case designs in the same way. Smoke gets pumped through the intake vents and outputs through the rear to show where the airflow might be getting blocked by a part of the device and not performing as optimally as possible. Airflow is even more important on a smaller device, where the thermals are more constrained.\n\nOnce Microsoft’s engineers are happy with the level of cooling, the fan prototype then gets tested inside a thermal chamber. The temperature is set to 35 degrees Celsius, around 95 Fahrenheit, to see how well the fan and cooling performs at this kind of heat. Microsoft measures areas like the palm rest part of a laptop to ensure they’re staying within the thermal limits and that the device is still comfortable to use. Engineers also look at hot spots with FLIR thermal imaging cameras to ensure the laptop isn’t overheating anywhere.\n\nPrecision thermal and Surface Pen tests are interesting, but they’re not as much fun as good old-fashioned real-world violence. Microsoft showed me how it experiments with its Surface devices by dropping them and smashing them up. I haven’t seen a drop test on a Surface lab tour since the early days of Microsoft’s tablets, so I was pleased to see the company was brave enough to attempt one again.\n\nA drop chamber is designed to validate Microsoft’s simulation data against the reality of dropping a device on concrete flooring. The drop chamber was key to developing Microsoft’s removable battery packs on its latest Surface devices, for example, to ensure any drops wouldn’t puncture the batteries.\n\nMicrosoft says that dropping its Surface Pro 12-inch from a height of two meters onto a hardwood floor does not cause any significant damage, but when it demonstrated the same test on a concrete floor it dented in front of my eyes. It was still functional, but part of the chassis had buckled under the pressure of the concrete. A few years ago I accidentally dropped a Surface Pro review unit in a similar way and the screen cracked, so hopefully these drop tests mean the latest model is even sturdier than before.\n\nWhen Microsoft isn’t busy dropping Surface prototypes, engineers also zap its tablets and laptops with electrical discharges. This ensures you don’t have any weird experiences with electrostatic discharges that could lead to software crashing or even a USB port failing. Microsoft tests above regulatory limits to make sure that extreme scenarios won’t kill its hardware. The company also has a special radio frequency chamber to test frequency interference in a sealed room.\n\nMy favorite part of the Surface labs tour was seeing Microsoft’s robots in action. The company has robots set up to tap the screens of its Surface prototypes 8,000 times to ensure the whole touch panel works every time and no touches are misregistered or inaccurate. The robot can even change the tool used to tap a screen to simulate different finger shapes.\n\nA robot creates a sketch of Microsoft’s 50th anniversary logo on a Surface Pro tablet. Image: Vjeran Pavic / The Verge\n\nOne room where I was led was full of robots, small and large. In the corner a larger robot was busy swiping away on a Surface screen to test that gestures work correctly. A few steps away another one made me smile while using the Surface Pen to draw. As it was Microsoft’s 50th anniversary, a robot arm was drawing a doodle to celebrate the company’s milestone. Smaller robots in the same room were testing palm rejection and tilting with the pen. If the robots ever do rise up, I wouldn’t want to be working in this room, that’s for sure.\n\nAfter admiring the robots, Microsoft led me into one of the quietest places on Earth: an anechoic chamber, which used to hold the world record for the world’s quietest place. The room is suspended and isolated from the room it’s inside of, which is also isolated away from the noise of Microsoft’s Surface buildings. Microsoft uses this room for audio testing, and it left me feeling like my ears were blocked up.\n\nI stood inside the anechoic chamber to hear how audio plays on Microsoft’s range of Surface Laptops, which have no visible speakers. Instead, audio is pumped out through the keyboard, something that’s unusual for a laptop. The audio team has had to tweak the design of the keyboard on the new 13-inch Surface Laptop so it doesn’t rattle or resonate when it’s pushing sound out the tiny gaps between the keys and the chassis. Microsoft could have just added regular speakers to its Surface laptops, but the team decided to engineer something clever to make extra space for the row of function keys.\n\nThat kind of attention to detail really sums up everything about Microsoft’s approach to hardware design with Surface. Over the past decade Microsoft has pushed the boundaries of what to expect from PC design, particularly with products like the Surface Book or Surface Studio.\n\nThese latest Surface devices may have only shrunk in size, but Microsoft’s lab tour demonstrated that there’s still a lot of engineering required to make them smaller. I really hope Microsoft’s meticulous approach to developing this new pair of Surface devices is a sign that the company is still committed to pushing the boundaries of hardware innovation — something Surface has become known for — to bring us more interesting and category-defining designs in the future.\n\nI’m always keen to hear from readers, so please drop a comment here, or you can reach me at notepad@theverge.com if you want to discuss anything else. If you’ve heard about any of Microsoft’s secret projects, you can reach me via email at notepad@theverge.com or speak to me confidentially on the Signal messaging app, where I’m tomwarren.01. I’m also tomwarren on Telegram, if you’d prefer to chat there.\n\n\n\nThanks for subscribing to Notepad."
  },
  {
    "source": {
      "id": "wired",
      "name": "Wired"
    },
    "author": "Justin Pot",
    "title": "Do You Really Have to Stop Using Windows 10?",
    "description": "Microsoft will stop supporting the operating system later this year. If you’re still running Windows 10, here are your options.",
    "url": "https://www.wired.com/story/do-you-really-have-to-stop-using-windows-10/",
    "urlToImage": "https://media.wired.com/photos/681cd21fc603f12b08e4fb28/191:100/w_1280,c_limit/windows-10-byebye-gear-1237969700.jpg",
    "publishedAt": "2025-05-09T11:30:00Z",
    "content": "The end is nighat least, it is for Windows 10. Microsoft will stop supporting the decade-old operating system on October 14, 2025.\r\nThere's one hiccup, though: Even though Windows 11 is a free update… [+3281 chars]",
    "full_content": "The end is nigh—at least, it is for Windows 10. Microsoft will stop supporting the decade-old operating system on October 14, 2025.\n\nThere's one hiccup, though: Even though Windows 11 is a free update, more people still use Windows 10 than Windows 11, according to statcounter.com, a site that tracks operating system usage worldwide.\n\nPlenty of people, it seems, either don't want to upgrade to Windows 11 or are using devices that aren't supported. This means millions of people could be using an operating system that’s no longer receiving security updates.\n\nIf you're one of them, it makes sense to learn what happens to your computer in October—and what you should do about it. Here's a summary of what's happening with Windows 10 and four options you have to replace it.\n\nWindows 10 Will Keep Working (But It Will Be Less Secure)\n\nNothing in particular is going to happen on October 14, the day updates stop. Your computer will keep working the way it has, and you're unlikely to run into issues. That doesn't mean it's a great idea to keep using Windows 10, though.\n\nThat's because the system will no longer receive security updates or patches from Microsoft. This won't matter much until a new Windows exploit is discovered. After that, though, your device will have vulnerabilities that will never be patched. At that point, you will be at increased risk of attacks like ransomware, where a virus encrypts all of your files and scammers demand a payment in order to decrypt them. Continuing to use Windows 10 long-term dramatically increases the odds of these and other attacks.\n\nThere are other potential annoyances. Third-party developers, meaning the companies that make the software you use and the games you play, tend to stop providing updates for operating systems that are no longer officially supported. So, if a game adds new features in an update, you might not be able to install it. The same goes for the software you rely on to do your work: Over time, the latest versions of your desktop apps won't run on Windows 10, meaning you'll miss out on features. There's also a security angle. In addition to no longer receiving security updates for your operating system, you'll also eventually stop getting security updates for the tools you use.\n\nNone of this will happen right away on October 14. But you can expect to start hearing about software makers dropping support for Windows 10 later this year. It's a good idea, then, to be prepared.\n\nMicrosoft has two official recommendations: updating your computer to Windows 11, which is free provided your computer supports it. The other recommendation is to buy a new device, presumably one already running Windows 11. Those aren't your only choices, though. You could replace Windows with another operating system entirely, like ChromeOS or Linux. Let's talk through all four options.\n\nOption 1: Try to Install Windows 11\n\nThe simplest thing, for most people, is to upgrade to Windows 11. Yes, this is annoying if you prefer Windows 10, but the good news is that Windows 11 is free, and the irritating AI features are easy to turn off.\n\nFind out whether your computer supports Windows 11 by opening Settings. Head to Settings > Privacy and Security > Windows Update. If your computer is compatible you should see an Upgrade to Windows 11 option. From there, you can click it to start the update procedure. Note that it's generally a good idea to back up your computer before upgrading your operating system."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Andrew Webster",
    "title": "Xbox is selling a lot of games on PlayStation",
    "description": "More than a year after Microsoft announced plans to start releasing games on rival platforms, the publisher seems to have hit its stride on PlayStation. Sony released its monthly most-downloaded charts for PS5 games, and for April, the top three titles in bot…",
    "url": "https://www.theverge.com/news/661814/xbox-best-selling-games-ps5-oblivion-minecraft",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/ss_84171997a07f3429636b518ae4246a7ab5e07d6e.jpg?quality=90&strip=all&crop=0,0,100,100",
    "publishedAt": "2025-05-06T15:05:59Z",
    "content": "Microsofts multiplatform game strategy is really kicking into gear with the likes of Oblivion, Forza, and Gears all hitting the PS5.\r\nMicrosofts multiplatform game strategy is really kicking into gea… [+3127 chars]",
    "full_content": "This comes as Xbox just announced another multiplatform remaster with the original Gears of War, and ahead of the launch of Doom: The Dark Ages next week. What started as a trickle of Xbox games on the PS5 has turned into a flood.\n\nThis, of course, is a great thing for players, with major game releases available on more platforms. But it’s also part of a slow and steady shift for the platform holders, which once heavily relied on exclusives as a means to move hardware. That’s still largely the case for Nintendo — don’t expect to see Mario Kart World anywhere but the Switch 2 — but Microsoft and Sony have been steadily pushing in another direction.\n\nWhile Sony has yet to release a first-party game on a rival console, it has made the PC a major part of its current strategy, with notable releases like Spider-Man 2 and soon The Last of Us Part II launching on PC after their PlayStation debuts. Part of the goal, according to Sony, is to use these PC games to eventually lure players back to their console.\n\nMicrosoft’s strategy has similarly been gradual, but more expansive. It started with four smaller titles, including Grounded and Hi-Fi Rush, last February, and covered both the PS5 and Nintendo Switch. And at the time Xbox chief Phil Spencer told The Verge that “I don’t want to create a false expectation on those other platforms that this is somehow the first four to get over the dam and then the dam’s going to open and that everything else is coming, that’s not the plan today. I also don’t want to mislead customers on those other platforms.”\n\nWell, the dam seems to have burst. Major Xbox releases like Age of Empires and Indiana Jones have made their way to the PS5, while upcoming games like Doom, Gears, and The Outer Worlds 2 are also launching on Sony’s console. Not every first-party Xbox game has been announced for the PS5 — Avowed and South of Midnight are still Xbox exclusives, for now, as is Starfield — but many of the heavy hitters have, including the likes of Gears, which has long been heavily associated with the Xbox brand.\n\nIt seems pretty clear that Microsoft is still in something of an experimentation phase, seeing how different kinds of games perform on different platforms. And as selling increasingly expensive hardware becomes less of a focus for the publisher, the success of those games will be key. Last year, when this initiative was still getting started, Spencer said that the long-term goal was “a future where every screen is an Xbox.” Based on the current sales charts, it seems that now includes a PlayStation."
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "Bill Gates plans to give away most of his fortune by 2045",
    "description": "The Microsoft founder says he plans to accelerate his charitable giving - and accused Elon Musk and Doge of 'killing children'.",
    "url": "https://www.bbc.com/news/articles/cx2e87lzqkdo",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6e7f/live/7624e040-2c1c-11f0-b26b-ab62c890638b.jpg",
    "publishedAt": "2025-05-08T15:48:08Z",
    "content": "Microsoft founder Bill Gates said he intends to give away 99% of his vast fortune over the next 20 years.\r\nGates said he would accelerate his giving via his foundation, with plans to end its operatio… [+3474 chars]",
    "full_content": "Bill Gates plans to give away most of his fortune by 2045\n\nWatch: Bill Gates \"disappointed\" in US foreign aid cuts, he tells BBC Newshour\n\nMr Gates, 69, said his eponymous foundation has already given $100bn (£75bn) towards health and development projects, and that he expects it will spend another $200bn, depending on markets and inflation, over the next two decades.\n\n\"People will say a lot of things about me when I die, but I am determined that 'he died rich' will not be one of them,\" he wrote in a blog post on Thursday.\n\nGates said he would accelerate his giving via his foundation, with plans to end its operations in 2045.\n\nMicrosoft founder Bill Gates said he intends to give away 99% of his vast fortune over the next 20 years.\n\nIn his blog post, Mr Gates cited a 1889 essay by tycoon Andrew Carnegie called The Gospel of Wealth, which argues that wealthy people have a duty to return their fortunes to society.\n\nMr Gates quoted Mr Carnegie, who wrote: \"The man who dies thus rich dies disgraced.\"\n\nHis latest pledge represents an acceleration in charitable giving. Initially, he and his ex-wife Melinda had planned for the Gates Foundation to continue working for several decades after their deaths.\n\nWhen asked about this shift, Mr Gates told the BBC's Newshour on Thursday that there will be other wealthy people in 20 years who can better tackle future challenges.\n\n\"It's really about the urgency,\" he said. \"We can spend a lot more if we're not trying to be perpetual, and I know that the spending will be in line with my values.\"\n\nGiving away 99% of his fortune could still leave Mr Gates a billionaire – according to Bloomberg, the Microsoft founder is the fifth-richest person in the world.\n\nIn the blog post, he shared a timeline of his wealth that showed his current net worth at $108bn and a large hand-drawn arrow going down to close to zero in 2045.\n\nMr Gates also said the foundation would draw from its endowment to give away $200bn.\n\nAlong with Paul Allen, Mr Gates founded Microsoft in 1975, and the company became a dominant force in computer software and other tech industries. Mr Gates has gradually stepped back from the company this century, resigning as chief executive in 2000 and as chairman in 2014.\n\nHe said he has been inspired to give away money by investor Warren Buffett and other philanthropists, however critics of his foundation say Mr Gates uses its charitable status to avoid tax and that it has undue influence over the global health system.\n\nIn his blog post, he outlined three main goals for his foundation: eliminating preventable diseases which kill mothers and children; eliminating infectious diseases including malaria and measles; and eliminating poverty for hundreds of millions of people.\n\nMr Gates criticised the US, UK and France for cutting their foreign aid budgets.\n\n\"It's unclear whether the world's richest countries will continue to stand up for its poorest people,\" he wrote. \"But the one thing we can guarantee is that, in all of our work, the Gates Foundation will support efforts to help people and countries pull themselves out of poverty.\"\n\nHe was more pointed in the interview with Newshour, where he was asked about comments he had made accusing tech billionaire Elon Musk of killing children through cuts to US aid made by Department of Government Efficiency, or Doge.\n\n\"These cuts will kill not just children, but millions of children,\" Mr Gates replied.\n\n\"You wouldn't have expected the world's richest person to do it.\"\n\nIn his interview with the BBC's Newshour, Mr Gates raised the issue of cancelled grants to a hospital in Gaza Province, Mozambique, which Donald Trump erroneously claimed was funding condoms \"for Hamas\" in the Gaza Strip. Mr Musk later acknowledged the claim was wrong and said \"we will make mistakes\", however the cost-cutting continued.\n\n\"I'm disappointed that [Musk] made abrupt cuts and characterised them in a way that was unfair, including saying that, money was being spent in Gaza when in fact, it was money to prevent mothers from infecting their babies with HIV,\" Mr Gates said.\n\n\"I mean, this is serious stuff,\" he continued.\n\nThe BBC has contacted Mr Musk for comment.\n\nThe Gates Foundation is a donor to BBC Media Action, the BBC's charitable arm which is separate from the Corporation's news operations."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Kyle Barr",
    "title": "Microsoft’s New Purple Surface Pro 12 Is Light Enough to Actually Use as a Tablet",
    "description": "The tablet's screen is slightly smaller, but the whole device is also lighter than ever before.",
    "url": "https://gizmodo.com/microsofts-new-purple-surface-pro-12-is-light-enough-to-actually-use-as-a-tablet-2000598245",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/Surface-Pro-12-inch-Violet-Hero-1.jpg",
    "publishedAt": "2025-05-06T05:42:51Z",
    "content": "A gadgets price for its size matters now more than ever. It seems more companiesincluding Microsoftare starting to identify with the need for more capable laptops at prices people can actually afford… [+4404 chars]",
    "full_content": "A gadget’s price for its size matters now more than ever. It seems more companies—including Microsoft—are starting to identify with the need for more capable laptops at prices people can actually afford. The Windows maker just dropped details on its new 12-inch Surface Pro and thinner 13-inch Surface Laptop that seem to fit the bill, at least on paper. With prices starting at under $1,000 (not including the Surface Pro’s Flex Keyboard), Microsoft’s own brand of computers could hit the sweet spot in the Venn diagram on looks, price, and performance.\n\nSee Surface Pro at Amazon\n\nSee Surface Pro at Best Buy\n\nThe 2025 Surface family includes two very familiar devices. The $900 Surface Laptop with its 13-inch touchscreen (1,920 x 1,280) has a traditional clamshell design, while the $800 Surface Pro 12 is Microsoft’s headline-grabbing Windows tablet that converts into a laptop-like device thanks to a detachable keyboard. The new Surface Pro is $200 cheaper than last year’s $1,000 11th-gen Surface Pro, but—and here comes the eye roll—you still have to buy a keyboard separately. The screen is also smaller at 12 inches (2,196 x 1,464) compared to the 13-inch display on last year’s tablet. The more compact tablet does have a perk: it weighs 1.5 pounds compared to the Pro 11’s two pounds.\n\nBoth the new Surface Pro and Surface Laptop 13 run on the Snapdragon X Plus chip, Qualcomm’s eight-core, ARM-based CPU variant introduced in the middle of 2024. Last year’s Surface Pro renditions, alongside the 2024 Surface Laptop, included up to the Snapdragon X Elite chip, which is still Qualcomm’s most powerful ARM-based processor. Otherwise, both the new Surface Pro and Surface Laptop come packed with 16GB of RAM and 256GB of storage at base.\n\nMicrosoft says this CPU is supposed to offer a better starting price point and an upgrade path for those on earlier devices like the 2022 Surface Laptop. According to the company, the Snapdragon X Plus chip in the new Surface Laptop is 30% faster than the Intel Core i5-1235U in the 2022 Surface Laptop. Microsoft further claims this CPU can beat the M3 MacBook Air in some benchmarks, but it stopped short of making the same claims about the $1,000 MacBook Air M4. It’s more evidence these big tech firms are willing to start competing on pricing that more people can entertain.\n\nThe new Surface Pro and Surface Laptop aren’t launching with any x86-based Intel chips, though they could arrive later, like with last year’s Surface Pro, which received an Intel Lunar Lake version earlier this year. Either way, Microsoft is sticking with Qualcomm’s ARM chips that offer better battery life on average, though you’ll eventually hit a wall with software compatibility, especially with games or even aging drivers.\n\nThe 12-inch Surface Pro will look very familiar if you’ve used any older version of the hybrid tablet-laptop design. It still includes a built-in kickstand that opens up to sit almost flat on a surface. Other than the shrunken size, the big change this go-around is that the Slim Pen no longer slots into the keyboard (again, sold separately). Instead, the Surface Pro tablet includes an indent in the back for you to slot the stylus. It makes sense, especially for creators who want to use the Surface as a Windows tablet more than a pint-sized PC.\n\nHowever, you may need to find some dry earth to dig a shallow grave to bury your hoard of Surface Connect power cables. The other big change is the loss of the age-old Surface Connect port. Now, the Surface Pro relies only on USB-C with support for 45W fast charging. The Surface Pro’s battery should last around 12 hours based on Microsoft’s tests with active web browsing. The Surface Laptop should get closer to 16 hours before requiring a charge.\n\nJust like last year’s Surface Pro, the new model paints a pretty picture. The brilliantly blue sapphire color of the 2024 Surface Pro is replaced with a violet color that seems spot-on for spring. Both new Surface Pro and Surface Laptop devices also come in platinum or “ocean” colors. The latter is a blue-ish silver that reminds me way too much of Apple’s “Sky Blue” on the MacBook Air M4.\n\nThe changes made to the Surface lineup are minimal, but there are some modifications that make sense. If you loathe the idea of losing Surface Connect, Microsoft confirmed it will continue selling last year’s Surface models, at least for the near future. The next big question is whether these prices will hold with the overriding threat of Trump tariffs. Microsoft reps told us that “tariffs are a moving target for us” and declined to say more about whether we could see Surface price hikes in the near future.\n\nSee Surface Pro at Amazon\n\nSee Surface Pro at Best Buy"
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "techkritiko@gmail.com (Jay Bonggolto)",
    "title": "Microsoft taps ex-Meta marketing boss to boost Copilot AI",
    "description": "A former Meta and Time Warner executive has snagged the role of global creative director for Microsoft AI.",
    "url": "https://www.androidcentral.com/apps-software/microsoft-taps-ex-meta-marketing-boss-to-boost-copilot-ai",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/RA7a5hVxnEoXf4ApdhjP3Y.jpg",
    "publishedAt": "2025-05-10T14:59:43Z",
    "content": "What you need to know\r\n<ul><li>Microsoft has brought in marketing heavyweight Mark D’Arcy (ex-Meta, ex-Time Warner) to its Copilot team.</li><li>D’Arcy reports directly to Mustafa Suleyman, who’s bet… [+2368 chars]",
    "full_content": "What you need to know\n\nMicrosoft has brought in marketing heavyweight Mark D’Arcy (ex-Meta, ex-Time Warner) to its Copilot team.\n\nD’Arcy reports directly to Mustafa Suleyman, who’s betting big on building smarter AI.\n\nMicrosoft is betting D’Arcy can help flip the script and give Copilot a voice that clicks with everyday users.\n\nMicrosoft’s AI department has roped in Mark D’Arcy, a seasoned marketing executive who cut his teeth at Meta and Time Warner, to help shape the future of Copilot AI, The Information reports.\n\nThe move signals Microsoft’s push to make Copilot not just smart, but also the kind of AI assistant you’d actually want to shoot the breeze with.\n\nD’Arcy has spent a decade at Meta helping big brands create eye-catching campaigns across Facebook, Instagram, and WhatsApp. Before that, he was the chief creative officer at Time Warner.\n\nFrom ads to AI\n\nNow he is rolling up his sleeves at Microsoft, reporting directly to Mustafa Suleyman, who is in charge of the company’s consumer AI division.\n\nSuleyman has been vocal about crafting an AI that’s more empathetic than your average cold, calculating bot. Microsoft’s Copilot might not be as famous as ChatGPT (yet), but the software giant has been making moves. You can find it built into Windows, Bing, and Edge, and Microsoft even dropped a Super Bowl ad last year to get it on people’s radar.\n\nStill, Copilot’s market share is sitting under 5%, while OpenAI’s ChatGPT is dominating with over 80%, based on Similarweb's data, as noted by The Information.\n\nThat’s where D’Arcy comes in. His mission is to make Copilot more relatable.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\n(Image credit: Jay Bonggolto / Android Central)\n\nD’Arcy is stepping in to get Microsoft’s engineers, designers, and ad folks rowing in the same direction. At the top of his list is giving Copilot the marketing juice it needs to really take off.\n\nLast month, Microsoft rolled out some fresh upgrades to Copilot, including a new feature that remembers key stuff from your past chats.\n\nD’Arcy hasn’t said much publicly, but behind the scenes, he’s expected to work closely with designers and engineers to help Copilot find its voice. It’s a big bet, but with all the tech giants racing to win the AI race, Microsoft is clearly hoping that giving Copilot some heart and style will help it stand out in the crowd."
  },
  {
    "source": {
      "id": null,
      "name": "Slashdot.org"
    },
    "author": "msmash",
    "title": "Microsoft Unveils AI-Powered Overhaul for Windows 11",
    "description": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs, introducing features that leverage neural processing units across the operating system. The update centers on AI-powered helpers across core Windows apps, with an intellig…",
    "url": "https://tech.slashdot.org/story/25/05/06/185254/microsoft-unveils-ai-powered-overhaul-for-windows-11",
    "urlToImage": "https://a.fsdn.com/sd/topics/windows_64.png",
    "publishedAt": "2025-05-06T18:05:00Z",
    "content": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs, introducing features that leverage neural processing units across the operating system. The update centers on A… [+1063 chars]",
    "full_content": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs , introducing features that leverage neural processing units across the operating system. The update centers on AI-powered helpers across core Windows apps, with an intelligent agent in Settings that can locate and adjust options via natural voice commands. Key additions include expanded Click To Do functionality, allowing users to draft Word content based on screen context, engage Reading Coach, or send details directly to Excel tables.The Photos app gains a relight feature with support for three customizable light sources, while Paint adds object selection and text-to-sticker generation. Snipping Tool will automatically detect and crop prominent screen content, adding text extraction and color picking capabilities. System-level enhancements include an updated Start menu with phone companion integration, AI-powered actions in File Explorer for content summarization, and text generation in Notepad with new formatting options.Most features will debut first on Windows Insider builds for Snapdragon-powered Copilot+ PCs before expanding to systems with AMD or Intel chips. Several tools, including Ask Copilot and Reading Coach, are already available to Insiders."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Eugene Kim,Hugh Langley",
    "title": "Big Tech's new playbook: Trim the fat; pay the stars",
    "description": "Tech giants like Amazon, Google, and Microsoft prioritize performance, giving top performers better incentives, while scrutinizing underachievers.",
    "url": "https://www.businessinsider.com/tech-giants-overhaul-pay-rewarding-stars-scrutinizing-underachievers-2025-5",
    "urlToImage": "https://i.insider.com/681bad4ac6ad288d14804c99?width=1200&format=jpeg",
    "publishedAt": "2025-05-08T09:00:02Z",
    "content": "Getty Images; Tyler Le/BI\r\n<ul><li>Tech firms like Amazon, Google, and Microsoft are doubling down on performance-based rewards.</li><li>Top performers are better incentivized, while underachievers f… [+6154 chars]",
    "full_content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBig Tech is rewriting the rules this year: Top talent gets big rewards, while underperformers face the heat.\n\nThe latest to follow suit is Amazon, which recently overhauled its compensation model to reward long-running top performers with larger payouts. Four years at the highest performance rank now pays off big with 110% of the pay band, which exceeds the previous 100% cap. But employees who achieve the top rank for the first time take a hit, with total comp cut to 70% of the pay range, down from last year's 80%.\n\nThe move is part of a broader tech trend of using performance reviews and compensation to better incentivize high achievers and eliminate underperformers and their drag on the balance book. Big Tech firms, including Google, Microsoft, and Meta, have made similar changes, all in pursuit of leaner, top-tier teams.\n\nThese companies handed out lavish perks, pampering, and sky-high salaries to stay competitive. A pandemic-era hiring spree exacerbated a tech tradition of hoarding top talent and only added to the ranks. Now, a shift makes one thing clear: It's no longer about head count — it's about talent.\n\nThe changes go hand in hand with sweeping pivots across tech to replace perks and pampering with performance and efficiency. Big Tech still rewards workers handsomely, but the era of resting and vesting at the giants may be well and truly over.\n\n\"The industry overall has made big efforts to do more with less,\" Brian Nguyen, a product manager at the salary data platform Levels.fyi, told Business Insider. \"This has allowed them to scale back costs while pushing for higher-quality work with fewer employees and rewards for only the top-tier performers.\"\n\nGoogle declined to comment, and Microsoft did not respond to a request for comment.\n\nA Meta spokesperson reiterated what the company previously shared with BI about its low-performer cuts: \"Employees at Meta have always been held accountable to a goal-based culture of high performance.\"\n\nThe new approach \"creates a steadier compensation progression for employees as they develop within their roles,\" an Amazon spokesperson said, adding the company offers \"multiple channels\" for employees to raise concerns about pay.\n\n'Appropriate distinction'\n\nAmazon managers this year received a list of potential pay-related questions and suggested answers, according to internal talking points obtained by BI. If asked about pay cuts, managers are encouraged to focus on employees getting raises for improved performance.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\n\"Employees moving to a higher OV level will generally receive an increase,\" one talking point said, referring to Amazon's performance rating called overall value. \"This ensures an appropriate distinction between newer and consistently high-performing employees at each OV level.\"\n\nAt Google, a larger share of employees can now earn top performance ratings, which lead to bigger bonuses and equity. Managers have also been given the authority to hand out more discretionary rewards to employees who are excelling.\n\nBut with a fixed budget, those gains come at the cost of lower-ranked employees, reinforcing the company's focus on high performance and raising the stakes for those falling behind.\n\n\"High performance is more important than ever to achieve the goals we've set, and so we're making some changes to further reward top contributors,\" John Casey, Google's vice president of global compensation and benefits, told staff in a memo last week.\n\nMicrosoft, meanwhile, has rolled out policies aimed at enhancing performance management and addressing what the company calls \"low performers.\" Managers also received \"more transparency and clarity\" in the rewards process, an internal note seen by BI said. The change came after the company laid off 2,000 employees deemed to be underperforming earlier this year.\n\nMeta has ramped up what it calls performance-based cuts, aiming to shed about 5% of its lowest-rated staff. An internal memo revealed plans to make these layoffs annual under a \"non-regrettable attrition\" policy. Adding to the sting, some ex-employees — even high performers — have landed on internal block lists, barring them from being rehired.\n\nLower pay for new hires\n\nWhile these companies are weighing an employee's performance rating history more heavily, some are also reducing new-hire offers.\n\nIn 2022, Amazon regularly offered over $300,000 a year to newly hired midlevel software engineers, according to data from Levels.fyi. Nowadays, more offers land around $270,000 a year, with recruiters being especially strict about needing \"extra approvals\" for anything higher, said Levels.fyi's Nguyen. Other companies, like Meta and Apple, are taking a similar approach, he added.\n\nSwitching jobs no longer helps either.\n\nThe Atlanta Fed's Wage Growth Tracker shows that median pay increases for job switchers dropped to 4.2% in February, down sharply from 7.3% in early 2023.\n\nTech professionals, in particular, are feeling the heat with lower pay offers and significant pay cuts, BI previously reported, as reduced competition has weakened employees' bargaining power.\n\nNot everyone is sold that the shift to crack down on underperformance is here to stay. Peter Capelli, a management professor at the University of Pennsylvania, told BI that many companies follow these trends simply because \"others are doing them,\" cycling through similar changes every decade or so.\n\n\"These are just fads,\" Capelli said.\n\nStill, the changes haven't gone unnoticed. At one Amazon office, some employees quietly voiced their frustration on an elevator whiteboard, a photo of which was shared with BI.\n\n\"No raise, no RSUs — thanks!\" the whiteboard read, referring to the lack of employee stock awards. \"Do more with less.\""
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Bryan Metzger",
    "title": "Bill Gates calls DOGE 'geographically illiterate,' says Elon Musk is 'involved in the deaths of the world's poorest children'",
    "description": "The two men have long had a rivalry, and this isn't the first time the Microsoft cofounder has criticized Musk.",
    "url": "https://www.businessinsider.com/bill-gates-doge-geographically-illiterate-musk-usaid-cuts-deaths-2025-5",
    "urlToImage": "https://i.insider.com/681caf75c6ad288d14805b8d?width=1200&format=jpeg",
    "publishedAt": "2025-05-08T14:21:00Z",
    "content": "\"The world's richest man has been involved in the deaths of the world's poorest children,\" said Bill Gates.Bay Ismoyo and Brendan Smialowski/AFP via Getty Images\r\n<ul><li>In a new interview, Bill Gat… [+2362 chars]",
    "full_content": "\"The world's richest man has been involved in the deaths of the world's poorest children,\" Bill Gates said.\n\n\"The world's richest man has been involved in the deaths of the world's poorest children,\" Bill Gates said. Bay Ismoyo; Brendan Smialowski/AFP/ Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBill Gates sharply criticized Elon Musk in an interview with The New York Times published on Thursday, calling out the Tesla cofounder's role in cutting foreign aid as part of his Department of Government Efficiency initiative.\n\nThe Microsoft cofounder said that cuts made to foreign aid, particular programs administered by the now-shuttered US Agency for International Development, were \"stunning.\"\n\n\"He's the one who cut the USAID budget. He put it in the wood chipper, because he didn't go to a party that weekend,\" Gates told the Times of Musk. \"The world's richest man has been involved in the deaths of the world's poorest children.\"\n\nGates also referred to an instance early in President Donald Trump's term in which administration officials said that the US had been sending condoms to Gaza via foreign aid. In reality, the US had been providing contraceptives to a province in the African country of Mozambique.\n\n\"They cut the money to Gaza Province in Mozambique. That is really for drugs, so mothers don't give their babies HIV,\" Gates said. \"But the people doing the cutting are so geographically illiterate, they think it's Gaza and condoms. Will they go meet those babies who got HIV because that money was cut? Probably not.\"\n\nGates made the remarks as he discussed his plans to give away the remainder of his wealth over the next 20 years before closing his foundation in 2045.\n\nThe Gates Foundation has invested heavily in public health initiatives around the world, often focusing on childhood diseases.\n\nThis isn't the first time Gates has been critical of Musk — or vice versa.\n\nGates has argued that Musk has destabilized the politics of foreign countries through his support for right-wing causes in the United Kingdom and Germany. He's also said that while he believes Tesla is having a positive environmental impact, he wishes Musk were more outspoken about the climate crisis.\n\nMusk, in turn, has said that Gates has a \"limited\" understanding of artificial intelligence.\n\nMusk, DOGE, Tesla, and the White House did not respond to requests for comment from Business Insider."
  },
  {
    "source": {
      "id": null,
      "name": "Slashdot.org"
    },
    "author": "msmash",
    "title": "Microsoft Effectively Raises High-End Surface Prices By Discontinuing Base Models",
    "description": "An anonymous reader shares a report: When Microsoft announced new Surface devices earlier this week, we noted that there wasn't a lot of daylight between the starting prices of the new but lower-end devices ($799 for the 12-inch Surface Pro, $899 for the 13-i…",
    "url": "https://slashdot.org/story/25/05/08/1842240/microsoft-effectively-raises-high-end-surface-prices-by-discontinuing-base-models",
    "urlToImage": "https://a.fsdn.com/sd/topics/microsoft_64100.png",
    "publishedAt": "2025-05-08T18:42:00Z",
    "content": "When Microsoft announced new Surface devices earlier this week, we noted that there wasn't a lot of daylight between the starting prices of the new but lower-end devices ($799 for the 12-inch Surface… [+1129 chars]",
    "full_content": "It has just been discovered that research causes cancer in rats."
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Alice Park",
    "title": "Bill Gates Will Close Gates Foundation by 2045, Give Fortune to Global Health",
    "description": "The Microsoft founder will double the amount of money he gives away and close the Gates Foundation earlier than planned.",
    "url": "https://time.com/7283920/bill-gates-foundation-global-health/",
    "urlToImage": "https://api.time.com/wp-content/uploads/2025/05/bill-gates.jpg?quality=85&w=1024&h=628&crop=1",
    "publishedAt": "2025-05-08T17:27:15Z",
    "content": "So far, 2025 has been a terrible year for global health. The Trump Administration is slashing funding to a number of international programs; closing down USAID, the governments major aid development … [+9055 chars]",
    "full_content": "So far, 2025 has been a terrible year for global health. The Trump Administration is slashing funding to a number of international programs; closing down USAID, the government’s major aid development arm; and withdrawing U.S. membership from the World Health Organization. But a glimmer of hope arrived on May 8, when Bill Gates, chair of the Gates Foundation, announced that he will be infusing the struggling field with most of his fortune—$200 billion, which he built after creating Microsoft—to be spent by 2045. He also plans to close down the foundation at that time.\n\nAdvertisement Advertisement\n\nSince Gates and his former wife, Melinda French Gates, created the foundation 25 years ago, the organization has contributed more than $100 billion to global causes, primarily in health. The Gates Foundation helped to create two important international health organizations: GAVI, which provides the world’s children with lifesaving vaccines, and the Global Fund, which focuses on distributing treatments for HIV, TB, and malaria. Gates’ just-announced timeline represents an acceleration of foundation’s timetable. When it was created, the board agreed to sunset the organization about 20 years after the Gates’ deaths. Gates, who turns 70 this year, spoke with TIME about why he decided to speed up his plans. When did you start thinking about closing the foundation earlier than you previously planned? Over the last two years, I’ve been talking with [Gates Foundation CEO] Mark Suzman and the foundation board about this. And we decided to double down to get some infectious diseases either dramatically reduced or eradicated, which is exciting.\n\nIt is ironic that the announcement ended up being at a time where the funding for global health is in incredible crisis because of a lot of cuts being made and some that are being discussed. This was not a response to that. But perhaps my commitment to give all of it away will remind people how important and how effective these dollars are, and the basic value of reducing childhood deaths. So it was late last year that I really put it to the board and talked about doubling down. It was also late last year, in December, that you had a three-hour dinner with now-President Trump, and you’ve said you were “impressed” with his questions about polio and HIV. That discussion wasn’t part of your consideration to accelerate your timeline? In the two discussions I had with President Trump since he was elected—on Dec 27. and Feb. 5—he was quite supportive of our work in HIV and polio. It’s Congress who will set the budget going forward, and historically, PEPFAR, which was created by President Bush [to provide HIV treatments] and GAVI had bipartisan support, and less than 1% of the U.S. budget goes to these things. Some of that funding has been cut off right now, in fact in a pretty abrupt way. We need to get Congress to weigh in.\n\nRead More: The 100 Most Influential People in Health I am hopeful that we can get a lot of that funding restored, but we do have challenges in a lot of rich countries where budgets are very tight, and they are under pressure to increase defense budgets. Over the next four years, we are likely to see an increase in childhood deaths for the first time since the turn of the century, and I am very dedicated to changing things to help us get back to making progress. We need rich world governments to restore some of this funding; we need more engagement by philanthropies to help out. And incredible innovations mean whatever money we have can be used even more effectively. Over [the next] 20-year period, I am actually quite optimistic, although we are in an awful emergency right now. Given the U.S. withdrawal from the WHO, could the Gates Foundation play a bigger role in working with the WHO to fill in some of the funding gap?\n\nThe WHO is a key partner for us. In fact [WHO director general] Tedros [Ghebreyesus] was in Singapore with me on Tuesday, and we were talking about the reorganization he is going through and decisions he has made. WHO plays a big role in polio and most of the things we do in global health. Strangely, now that U.S. cut so much, the Gates Foundation is now the largest single donor to WHO. I don’t think in the long run that’s the way it should be. A big part of that is the work we do in polio, but we fund a dozen things at WHO. But I think eventually the U.S. will state whatever it wants to see changed and resume as a member, because in so many areas, WHO is critical, including whenever we have a potential pandemic. You know, we funded a lot of the improvement pandemic preparedness of the WHO based on lessons that came out of the COVID vaccine effort. I don’t think the U.S. will go back in right away, but we’ll be somebody to help broker a dialogue that eventually gets the U.S. back there, which think is valuable to the world and U.S.\n\nHow concerned are you by the current situation in global health, with the U.S. making such big cuts in its contributions? I would have guessed because the U.S. does have problems with the deficit, we might see a 15%-20% cut. I would have said, okay, we need to make sure we minimize the impact that has. I think it’s ideal at this point that we get back to that. There are some proposals to Congress from the executive branch which would represent an almost 80% cut. That would be tragic. We are going to see deaths from children go up, and they have been going down at a record rate since 2000, from 10 million to under 5 million. We are going to see it go the wrong way, and that means millions of extra deaths. Some of the cut-offs have been quite abrupt. Read More: Medicaid Expansions Saved Tens of Thousands of Lives, Study Finds We will get a real gauge of this global health emergency in June in Brussels, for the five-year replenishment of GAVI: that entity we started in 2000 together with rich world governments to buy vaccines for the world’s poorest children. The metric will be—can we raise as much as we raised five years ago, or will we be substantially below that? I have to tell you, right now, it looks pretty grim. Including getting the U.S. to buy these very inexpensive vaccines. These are $1 vaccines, and the majority of the reason we had reductions in deaths from around 10 million to five million is because of vaccines. To not be able to buy $1 vaccines when we are talking [about something] that is well under 1% of the U.S. budget, I think that’s tragic. We will try to make the case, try keep the U.S. in HIV medicines, where they have been very generous, starting with President Bush. The Global Fund replenishment will come in the fall, and right now, it all looks like it could be a disaster.\n\nMore studies are showing that making an impact on health requires addressing non-medical factors as well, and the Gates Foundation has supported programs in education and nutrition. How important will these be over the next 20 years? If you look at the breakdown of the foundation spending, which is just over $100 billion over the last 25 years, by far the biggest is in global health, with 35% creating new, low-cost tools and 35% helping to get those tools delivered. Next up is education, which is about 15%. That’s always been something where because I got such a great education here in the U.S., I felt like we should try to make that available to every student. We have done a lot with charter schools, curriculums, and scholarships. Now, we are using AI to improve curricula. We are able to get graduation levels up. Agriculture is 8% of what we have done. The opportunity to make seeds more productive, and crops more nutritious either by improving seeds or doing food fortification by adding some micronutrients in later—that’s super important work. Particularly in Africa where with population growth and climate change, the only way to help the poorest there—the majority of whom are farmers—is by improving their seeds and access to fertilizer.\n\nOne of the most amazing programs we’ve done is taking chickens in Africa and used cross-breeding with highly productive chickens from Europe and the U.S. to get a lot more eggs. Now we have over 200 million chickens that have been delivered to women in Africa that both help nutritionally, and help them economically. It’s a very exciting area. The agriculture work has as high impact as our health work.\n\nHow well has the foundation addressed the goals and vision you set out when you created it 25 years ago?\n\nThe progress in health is way beyond what I would have expected. Tens of millions of lives have been saved because of our work and through our partnerships—over 100 million lives. It’s not just us. There has been a movement, and we have been a central part of that.\n\nIn areas like education, we have done great things—graduation rates have gone up but not nearly as miraculous. I slightly expected us have more impact in education and I had no idea we we’d be able to have such incredible results in our health work. So we’re learning all the time. We’ve got a pipeline of innovation that is far, far stronger than ever before. And we have AI that’s going to supercharge that—both the discovery piece and the delivery piece. So I have pretty high expectations for the next 20 years, despite the funding emergency that we’re in ."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Andrew Liszewski",
    "title": "Razer’s Clio is a $230 surround sound head cushion",
    "description": "Razer has announced three new products today, including an alternative to wireless headphones called the Clio that’s designed to attach to your gaming chair and double as a head cushion. Powered by a 5,400mAh battery that Razer says is good for up to 14 hours…",
    "url": "https://www.theverge.com/news/663830/razer-clio-thx-cushion-gaming-surround-joro-keyboard-basilisk-mobile-mouse",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/razer1.jpg?quality=90&strip=all&crop=0%2C10.717271201674%2C100%2C78.565457596651&w=1200",
    "publishedAt": "2025-05-08T20:22:09Z",
    "content": "The headphone alternative supports THX Spatial Audio and offers up to 14 hours of battery life.\r\nThe headphone alternative supports THX Spatial Audio and offers up to 14 hours of battery life.\r\nRazer… [+3179 chars]",
    "full_content": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nRazer has announced three new products today, including an alternative to wireless headphones called the Clio that’s designed to attach to your gaming chair and double as a head cushion.\n\nPowered by a 5,400mAh battery that Razer says is good for up to 14 hours of use, the Clio uses adjustable straps to attach to “most high-back gaming and office chairs” so that it’s positioned directly behind your head. Inside each of the cushion’s angled wings is a near-field speaker that uses a 43-millimeter driver paired with a passive radiator that work together to deliver “crisp, clear trebles and deep, punchy bass you can hear and feel.”\n\nAdjustable straps secure the Clio to most high-back office or gaming chairs. Image: Razer\n\nThe Clio speaker wirelessly connects to Bluetooth-compatible devices like smartphones, tablets, and handheld consoles, but is also compatible with Razer’s HyperSpeed Wireless protocol for a low-latency connection to a gaming PC. Support for THX Spatial Audio creates a more immersive listening experience when using the Clio on its own, but it can be paired with additional desktop speakers and used as a dedicated rear channel as part of a larger 7.1 surround sound setup.\n\nThe Razer Clio wireless speaker is available for preorder now through Razer’s online store for $229.99 with shipping expected to begin on May 16th, 2025.\n\nRazer also announced a new lightweight Basilisk Mobile mouse and Joro wireless gaming keyboard, which it says were created to pair with portable gaming gear “without compromising on performance.”\n\nThe Razer Basilisk Mobile mouse includes a four-way tilting scroll wheel and up to 150 hours of battery life. Image: Razer\n\nThe Razer Basilisk Mobile mouse weighs in at 76 grams and “boasts a compact, ergonomic design” designed to slip into pockets or squeeze into a laptop sleeve along with a computer. It supports wired, Bluetooth, or a low-latency Razer HyperSpeed Wireless connection to PCs with up to 105 hours of battery life with the latter, or up to 150 hours with Bluetooth.\n\nThe mouse includes a four-way tilting scroll wheel with two scrolling modes: free-spin for more speed or tactile cycling for more precision. There’s a Razer Focus X optical sensor with up to 18,000dpi of sensitivity on the underside, while the mouse’s primary buttons use Razer’s Gen-3 optical switches boasting a 90 million click lifecycle.\n\nThe Razer Joro wireless keyboard uses a compact 75 percent layout and offers up to 1,800 hours of battery life. Image: Razer\n\nThe Razer Joro ultra-portable wireless gaming keyboard uses a compact 75 percent layout and measures in at 16.5-millimeters thick and 374 grams in weight. As with most Razer products, it features RGB lighting that can be animated with various effects while still offering an impressive battery life of up to 1,800 hours when using its power saving mode.\n\nThe Joro connects to devices with a USB-C cable or over Bluetooth and is not only compatible with both Windows and Apple devices including iPadOS and iOS, it also features secondary keys with macOS labels and a dedicated Microsoft Copilot Key. Laser-etched ABS keycaps help ensure longevity, and in addition to the keyboard being customizable, it can also store up to five different profiles locally, and switch between them as needed."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "Nicholas Sutrich",
    "title": "Mojang's big Minecraft VR mistake",
    "description": "Mojang ended official support for Minecraft VR this week, leaving Bedrock players with no way to properly play the game with a headset.",
    "url": "https://www.androidcentral.com/gaming/vr-games/mojangs-big-minecraft-vr-mistake",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/6WWcZax75X3MmCcrLnsFab.jpg",
    "publishedAt": "2025-05-08T16:00:00Z",
    "content": "This week, Mojang officially cut VR support from the Bedrock version of Minecraft on PCs. Mojang originally launched VR support for Minecraft Bedrock on the Samsung Gear VR back in April 2016, portin… [+5948 chars]",
    "full_content": "This week, Mojang officially cut VR support from the Bedrock version of Minecraft on PCs. Mojang originally launched VR support for Minecraft Bedrock on the Samsung Gear VR back in April 2016, porting the experience over to the PC version that August. PSVR support was added in 2020, but things went downhill from there.\n\nAC thVRsday In his weekly column, Android Central Senior Content Producer Nick Sutrich delves into all things VR, from new hardware to new games, upcoming technologies, and so much more.\n\nWhile there was a way to play the old Gear VR version on the Oculus Go and the original Oculus Quest, the Oculus Quest 2 ended support for these older games, making it impossible to play. As Mojang slowly pulled the plug on Minecraft VR as an officially supported concept, modders took up the mantle the company failed to uphold.\n\nVivecraft is by far the most successful Minecraft VR mod. It adds VR support to Minecraft Java, including made-for-VR mechanics that Mojang never bothered to add to the Bedrock version. QuestCraft, a port of Vivecraft made to run natively on Meta Quest headsets, debuted in February 2022 and was a gem until the v71 Meta Quest update broke the game in December 2024.\n\nThe only official reason Mojang has given for ending VR support is a cop-out, at best. \"Our ability to support VR/MR devices has come to an end,\" says Mojang's Jay Wells in an October 2024 update changelog, making it sound like Mojang doesn't have enough funds or resources to get the job done. But nothing could be further from the truth, and the rest of the politics of Meta and Microsoft's recent work further muddle an already confounding decision.\n\nToday's best Meta Quest 3 and Meta Quest 3S deals $299 View $499.99 View $529 View Show more\n\nLet's so some quick math\n\n(Image credit: Android Central)\n\nSince Microsoft seems allergic to giving official player counts for anything these days, I have to estimate things based on other factors. We know that Minecraft sold more than 300 million copies as of October 2023, and statistics firms like DemandSage estimate that Minecraft sees over 55 million daily active players. Only games like Fortnite can match those numbers, again according to statistics groups.\n\nMojang employs over 600 people, and recent successes like the Minecraft Movie further add to the hundreds of millions of dollars Minecraft makes for Microsoft every year.\n\nSo, how in the world can a studio that's this massive, with this much funding and annual revenue, confidently proclaim that its \"ability to support VR/MR devices has come to an end?\" None of it makes any sense, and no one seems to know why.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nQuestCraft, the only native Quest port of Minecraft, is run by four individuals in their spare time. Surely Mojang could match this effort.\n\nThe best answer I could gather is that the number of VR players would be \"a drop in the bucket\" compared to the number of Minecraft players worldwide. That may be true, but it wouldn't take very many staff members to properly support a Minecraft VR on the world's most popular VR platform, Meta Quest. QuestCraft, the only native Quest port of Minecraft, is run by four individuals in their spare time. Surely Mojang could match this effort.\n\nThe Meta Quest's demographics have been shifting younger and younger over the years, with free-to-play content ruling the roost for revenue and player count on the platform every month. Unironically, this exact demographic is the one that would put the most time into Minecraft if it were officially launched as a Meta Quest game.\n\nBack in 2020, then Oculus CTO John Carmack famously got Minecraft running on the Quest \"with full positional tracking,\" something Mojang already had working just fine on the PC side of things. For some untold reason, this version of the game was never officially picked up by Mojang.\n\nWe added Every Horror Mod to Minecraft VR - YouTube Watch On\n\nAll of this becomes more confusing when you consider Meta and Microsoft's other VR partnerships over the past year. You can play Xbox Game Pass games on Quest, Windows 11 has an official linking app so you can use your PC on a Quest, and even Microsoft Office has official Meta Quest apps. Oh, and don't forget that we're still due for the Xbox-branded Meta Quest headset that was announced last April.\n\nMeta claims to have attempted to work with Microsoft on getting an official port even as recently as August 2024, but, strangely, hasn't seemed to be able to make any progress.\n\nIf I were being overly optimistic, I'd say that Mojang killed the PC VR version of Minecraft Bedrock in favor of launching a native Quest version later this year. I'd probably lose money if I bet on that, but there's a very real expectation that these third-party Meta Horizon OS-powered headsets should be launching later this year to compete with the official release of Android XR, and this would tie in perfectly with those announcements.\n\nEveryone loses when Mojang decides that Minecraft players don't want VR support, and it's ridiculous that Microsoft and Mojang don't see that.\n\nNo matter the reason, Mojang is leaving money on the table by not supporting a native Meta Quest Minecraft VR. The official QuestCraft Discord server has 80,000 users with dozens of new ones joining every day. That's for a mod of a game that requires you to sign up for a developer account and then sideload it onto your Quest just to play. Oh, plus, you need to own Minecraft Java, not Bedrock, for it to work.\n\nImagine, then, how many more players would be on Minecraft VR if there were an official Bedrock version of the game? It's not hard to expect that number to be in the hundreds of thousands or even over a million active players, as the most popular Quest games have.\n\nThat's players buying stuff on the Marketplace, people subscribing to Realms so they can more easily play with friends on their own time, and players making even more content for their YouTube channels. Everyone loses when Mojang decides that Minecraft players don't want VR support, and it's ridiculous that Microsoft and Mojang don't see that."
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Ethan Gach",
    "title": "Xbox-Branded PC Gaming Handheld Leaks And Looks Exactly Like The Asus Rog Ally 2",
    "description": "A rumored Xbox PC gaming handheld has leaked thanks to the Federal Communications Commission (FCC). No, not the device being developed in-house that Microsoft Gaming CEO Phil Spencer previously mentioned was still years away. I’m talking about Project Keenan,…",
    "url": "https://kotaku.com/xbox-asus-rog-ally-2-project-keenan-pc-gaming-handheld-1851779523",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f10c0b8e21edebc2f09c2fe1ddb8fe83.png",
    "publishedAt": "2025-05-07T15:10:00Z",
    "content": "A rumored Xbox PC gaming handheld has leaked thanks to the Federal Communications Commission (FCC). No, not the device being developed in-house that Microsoft Gaming CEO Phil Spencer previously menti… [+2726 chars]",
    "full_content": "A rumored Xbox PC gaming handheld has leaked thanks to the Federal Communications Commission (FCC). No, not the device being developed in-house that Microsoft Gaming CEO Phil Spencer previously mentioned was still years away. I’m talking about Project Keenan, the spirit of an Xbox handheld trapped inside the shell of an Asus Rog Ally that’s due out later this year. And that’s exactly how it looks based on the new leaks.\n\n\n\nWhy People Are Rushing To Sell Their Xbox Series X To GameStop Right Now CC Share Subtitles Off\n\nEnglish view video Why People Are Rushing To Sell Their Xbox Series X To GameStop Right Now\n\nWhy People Are Rushing To Sell Their Xbox Series X To GameStop Right Now CC Share Subtitles Off\n\nEnglish Why People Are Rushing To Sell Their Xbox Series X To GameStop Right Now\n\nPhotos of the devices, which were taken by the FCC, surfaced online via Videocardz. One showed a white Asus gaming handheld that is presumably the Ally Rog 2, and the other showed a black version with a dedicated Xbox button that is presumably the Xbox-branded alternative. Rumors of the device were previously reported by Windows Central and The Verge as being part of Project Keenan, a new initiative within Microsoft to try to more seamlessly blend its Xbox user experience with its Windows gaming OS.\n\n\n\nAdvertisement\n\nWhat’s notable about the apparent Asus Rog Ally 2 is that its handles are more like controller paddles than the first model, which had a much more angular and boxy grip. It looked cool stylistically but may have not been the most ergonomic. But the only real external difference between the two new models appears to be the color and the Xbox icon insignia on the menu button. There don’t seem to be any other flourishes in the body of the device to give it an Xbox vibe. That’s a bummer.\n\nAdvertisement\n\nAdvertisement\n\nBut the real draw of Project Keenan, if it works out, will be what’s going on at the software level. Prior reports, as well as some vague comments from Microsoft VP of Next Generation Jason Ronald, suggest the device will offer an Xbox level interface on top of the Windows OS running in the background, to potentially make for a much more familiar user-friendly experience outside of gaming. Think Xbox dashboard vs. an icon-based layout designed for mouse and keyboard.\n\nIn that way, Project Keenan sounds like a logical attempt to reconcile the two halves of Microsoft gaming and form a bridge to an eventual PC gaming handheld that functions like a console in your hands: i.e. a Nintendo Switch that can still play all the newest games. Sony is reportedly chasing something similar with a rumored handheld fans hope might be able to play PS5 games. Valve’s Steam Deck, while not a sales juggernaut, is clearly one of the catalysts behind this new hardware shift, and it also has a major head start.\n\nAdvertisement\n\nOf course, all of this will be a bit moot in the U.S. if Trump’s trade war with China continues. Microsoft just raised the price of the Xbox Series X by $100 because of tariffs. The same happening to the next fleet of Asus Rog Ally handhelds, Xbox-branded or otherwise, would instantly torpedo their prospects. The entire handheld gaming revolution could be cut short, at least in the U.S. We’ll probably learn more about Microsoft’s Xbox Rog Ally 2 at its big Summer Game Fest-adjacent showcase in June.\n\n."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "David Nield",
    "title": "Your email inbox isn’t just an annoyance—it’s a privacy risk",
    "description": "We understandably avoid our overflowing our email inbox, in favor of getting on with something else more fun, but there are very good privacy reasons to want to tackle this pile of digital detritus—and there are powerful tools to help.Delete old accounts, pro…",
    "url": "https://gizmodo.com/your-email-inbox-isnt-just-an-annoyance-its-a-privacy-risk-2000598016",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/Mailbox-1-1.jpg",
    "publishedAt": "2025-05-08T12:39:58Z",
    "content": "For most of us, taking a long, hard look at our inbox isn’t fun: Typically, the digital clutter and spam email is piled high, while anything useful and informative often gets lost in the deluge. Gett… [+7492 chars]",
    "full_content": "For most of us, taking a long, hard look at our inbox isn’t fun: Typically, the digital clutter and spam email is piled high, while anything useful and informative often gets lost in the deluge. Getting to inbox zero seems like an impossible task, so we close down our email apps again, only to find the situation is even worse the next time they’re opened.\n\nWe understandably avoid our overflowing inboxes, in favor of getting on with something else far more fun, but there are very good privacy reasons to want to tackle this pile of digital detritus—and there are powerful tools to help, as well (more on this shortly).\n\nCheck out at Yorba\n\nThink about the emails attached to old accounts that you leave neglected but open—each account is a way for bad actors to get at you and your data. Maybe the account uses a simple password that’s easy to guess, or the app involved has been taken over by an organization with shady intentions, or the service itself has long since gone out of business and some enterprising hackers have grabbed its unguarded databases.\n\nWith all of these scenarios and more, you’re at risk. Once a hacker gets into one of your accounts, it’s easier to move on to the others, whether that’s because of a trusted connection you’ve established, or because there are key pieces of information (payment details, postal addresses) inside the exposed account.\n\nIf you’re not properly sorting through your inbox and closing down these accounts, then you might well be missing warnings that hackers breached your security. Ideally, you want to be shuttering digital accounts as soon as you’re done with them—then there’s nothing for anyone else to access.\n\nYou’ve got another reason to stay on top of your inbox: subscription fees. Almost anything digital now comes with a subscription attached, from music streamers to online publications to AI bots, and if you’re not keeping a close eye on your inbox (and your bank account), then you might end up paying a substantial amount each month for software and services you’re not actually using.\n\nWe promised tools to help further up though, and you’re not alone in attempting to clean up your digital footprint.\n\nEnter Yorba, an online tool for people who want an easier way to manage their accounts, subscriptions, and inbox. It’s like a spring cleaning service for your email and your wider digital life, not only cutting down on the volume of messages for a clean inbox, but also tidying up what those messages are linked to.\n\nWith a simple dashboard that helps you organize your online life, Yorba makes it easy to cancel subscriptions, delete old accounts, and stop getting unwanted emails so you can avoid surprise charges and feel in control of your digital footprint. It works across the US, Canada, and the EU, so millions of people can use it.\n\nYou can try all of this out for free, including weekly insight reports and smart suggestions about what needs cleaning up. With a Premium account, yours for $72 a year, you get more active monitoring tools and easier subscription canceling (and Yorba is thankfully ad-free too).\n\nNot convinced yet? Yorba has some heavyweight backing too. This company is part of the Santander X 100 global community for its innovative proposal. This international community includes the most outstanding companies of Santander X, Banco Santander’s global entrepreneurship initiative, which supports SMEs, startups, scaleups and entrepreneurial projects with training programmes, online courses, benefits and discounts, exclusive events, challenges and prizes, a community of experts and a personalised financial offer.\n\nHow to use Yorba\n\nMuch of what Yorba offers is free to access: You might find you never need the advanced features that cost money, but you can definitely try out most of what’s available and decide how useful it is before parting with your cash. You can sign up with your Google account, your Microsoft account, or with an email address and password.\n\nYorba nicely automates the setup process. Point it towards your inbox, and it’ll scan through vast swathes of email faster than you could ever hope to, picking out mailing lists you’re subscribed to, digital accounts you’re still connected to, ongoing subscriptions that remain active, and data breaches where your email address is mentioned.\n\nWith Google and Microsoft email accounts, Yorba is able to dig deeper, helping you to find old accounts and track subscriptions that you may or may not still need. The main dashboard screen does a great job of giving you a better idea about your digital footprint. It’s a bit like looking at the screen time stats for your phone: Perhaps you haven’t realized quite how bad the problem has got, but Yorba will tell you.\n\nCheck out at Yorba\n\nWhen it comes to mailing lists, for example, they’re split up into categories like technology, shopping, and causes. You can see how often you open up newsletters, how many mailing list messages you’re getting every month, and then either unsubscribe from emails or keep on the list with a click.\n\nFor the data breaches, you get a similar level of detail. You can see which email addresses were exposed and when, and get quick links to delete your account or update your login credentials and passwords.\n\nWhen it comes to your logins and how to delete account information, Yorba makes this straightforward as well. Each login also comes with a privacy grade, and you can see what arer the risks of your information being misused and or sold by the company. For any account you want to get rid of, there’s a Delete Account button that opens detailed instructions and direct delation links .\n\nThe subscriptions tracking feature is something you have to pay for, but you’re likely to save a lot of money if you make use of it. Based on the tool’s analysis of your inbox, you can see how much is going out, and to which companies, and in which order. Anything you’re not using can be spotted pretty quickly.\n\nIf you’ve never undertaken this kind of inbox cleanup before, it can be quite eye-opening just how much stuff you’ve actually signed up to—everything from digital publications to job listing sites to music newsletters, in my case. But even if Yorba uncovers lots to tackle, its interface never feels overwhelming.\n\nIn fact, the service does a fine job of aggregating information across multiple inboxes so you can work through the tidying up process methodically. You don’t have to tackle it all at once either: Yorba always keeps track of your progress, so you can chip away at it slowly.\n\nSomething else I liked from using the service was the way you can set yourself goals, almost like using a fitness or meditation app. You get to see how many actions you’ve taken on your inbox and how far you’ve gone in reducing the clutter and protecting your privacy—which then motivates you to do more.\n\nThere’s a decent level of customization here as well, so you can tailor Yorba in terms of what you’re aiming for and what you want to be notified about. You’ve got nothing to lose by letting the service quickly scan through your email and see what needs fixing—and Yorba won’t be as daunted as you might be by the inbox chaos.\n\nCheck out at Yorba\n\nIn a digital world where your inbox can quietly become a serious privacy liability, Yorba offers a smart, accessible way to regain control, cut through the noise, and protect what matters most-your personal data!"
  }
]