[
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Jim Cramer on NVIDIA (NVDA): Bears ‘Getting Gored By The Bulls’",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e5dc85db-6d25-48ca-8378-bf588ae466d9",
    "urlToImage": null,
    "publishedAt": "2025-05-09T18:42:59Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Antonio G. Di Benedetto",
    "title": "Lenovo’s flagship gaming laptop has a 2D / 3D screen and carbon fiber lid",
    "description": "Lenovo is announcing a new 10th-generation Legion 9i gaming laptop coming soon to China and scheduled for the fall in North America. The 18-inch behemoth is packed with top-end specs, including the option for a 4K-capable 2D / 3D screen, Nvidia RTX 5090 GPU, …",
    "url": "https://www.theverge.com/news/663084/lenovo-legion-9i-18-rtx-5090-2d-3d-gaming-laptop-announcement-specs",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/07_Lenovo_Legion_9i_Eclipse_Black_Hero_Rear_white.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
    "publishedAt": "2025-05-08T09:38:37Z",
    "content": "The new Legion 9i doesnt have a price yet, but considering the specs and fancy lid, its likely to be high.\r\nThe new Legion 9i doesnt have a price yet, but considering the specs and fancy lid, its lik… [+2560 chars]",
    "full_content": "is a reviewer covering laptops and the occasional gadget. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021.\n\nLenovo is announcing a new 10th-generation Legion 9i gaming laptop coming soon to China and scheduled for the fall in North America. The 18-inch behemoth is packed with top-end specs, including the option for a 4K-capable 2D / 3D screen, Nvidia RTX 5090 GPU, Intel Core Ultra 9 275HX CPU, up to 192GB of RAM, and 8TB of SSD storage.\n\nHow much will an over-the-top configuration like that cost? Nobody can say, as Lenovo isn’t talking pricing at all yet — not even the starting price for the base model with a 4K, non-3D screen. But when the time comes you won’t have to rely solely on Lenovo to build the configuration to your liking, as the four RAM slots and four SSD slots are user-accessible.\n\nThe Legion 9i has plenty of RGB lighting, including colorful per-key illumination and a front-facing light bar. Image: Lenovo\n\nThe optional 2D / 3D LCD can display 3840 x 2400 resolution at up to 240Hz in 2D mode or 1920 x 1200 in 3D mode. The screen also has a dual mode akin to the Razer Blade 18, allowing up to an ultrafast 440Hz when displaying 2D content in 1920 x 1080. Viewing 3D content on the Legion 9i’s screen doesn’t require glasses, as it uses eye-tracking and a lenticular lens array to appear 3D to the naked eye. Lenovo says the Legion 9i is designed for game developers, visual artists, and 3D professionals as well as spendy gamers. In addition to displaying 3D content and renders, Lenovo says its software supports 30 games playable in 3D, including Cyberpunk 2077, Black Myth: Wukong, Forza Horizon 5, Genshin Impact, and God of War Ragnarök.\n\nAs you’d expect from a desktop replacement-class laptop, the Legion 9i has a bunch of ports, including two Thunderbolt 5 ports, four USB 3.2 Gen 2 (three Type-A and one Type-C), an ethernet port, HDMI 2.1, and even a full-size SD card slot. For connectivity, it’s got Wi-Fi 7 and Bluetooth 5.4 support. If you go for the 2D screen the 5-megapixel webcam has an f/2 aperture, though the 3D screen option comes with a faster f/1.6 lens — and both webcams feature a kill switch on the side of the laptop for privacy.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n1 / 6 If only the whole laptop could be decked out in this carbon fiber. Image: Lenovo\n\nThe laptop itself has a pretty unique look thanks to its carbon fiber lid. Lenovo says each Legion 9i’s lid is made from eight layers of carbon fiber, making it “lighter and stronger than aluminum.” But any weight savings aside, the coolest aspect of this carbon fiber creation is the visible pattern on the lid — which Lenovo says is slightly different and one-of-a-kind on each unit.\n\nWe may not know how much the Legion 9i costs just yet, but that lid instantly makes it one of the most interesting jumbo-sized gaming laptops in my book. At least, as far as ones not adorned with dragons go."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Sarah Perkel",
    "title": "Nvidia CEO says 'San Francisco is back' — and it's thanks to the AI gold rush",
    "description": "\"Just about everybody evacuated San Francisco,\" Nvidia CEO Jensen Huang said. \"Now it's thriving again. It's all because of AI.\"",
    "url": "https://www.businessinsider.com/nvidia-ceo-san-francisco-is-back-ai-boom-2025-5",
    "urlToImage": "https://i.insider.com/68190099c6ad288d1480089f?width=1200&format=jpeg",
    "publishedAt": "2025-05-06T09:55:01Z",
    "content": "Nvidia CEO Jensen Huang credits AI with the resurgence of San Francisco's tech scene.Patrick T. Fallon / AFP\r\n<ul><li>Nvidia CEO Jensen Huang credited AI with a resurgence of San Francisco's tech sce… [+3758 chars]",
    "full_content": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nJensen Huang, the CEO of Nvidia, says the AI boom reversed the San Francisco tech exodus.\n\n\"It's because of AI that San Francisco is back,\" Huang said during an episode of the Hill & Valley Forum podcast.\n\n\"Okay, anybody who lives in San Francisco, you'll know what I'm talking about. Just about everybody evacuated San Francisco,\" he added. \"Now it's thriving again. It's all because of AI.\"\n\nWhile San Francisco was far from becoming a ghost town of any sort, as many as 89,000 households left San Francisco during the height of the pandemic in 2020, taking advantage of the rise in remote work to ship out of state entirely or settle in nearby suburbs. And families weren't alone in fleeing — some major tech firms, including HP, Palantir, and Oracle, moved their headquarters out of the city, while other industry leaders left in favor of cities like Austin and Miami.\n\nBut since the release of ChatGPT in the latter half of 2022, the growth of AI companies has breathed some life back into the city's flagging tech sector, becoming some of its biggest tenants.\n\nIn recent years, AI companies have rented out more than 1.7 million square feet of office space, The San Francisco Standard reported, citing research from real estate company JLL. According to Forbes, real estate agents have even taken to calling Mission — a district in the city where OpenAI is headquartered — \"Area AI,\" for its dense population of related firms.\n\nIn 2024, one of every three VC dollars invested went into an AI startup, according to the data firm Pitchbook. Globally, 35.7% of VC funds went to AI and machine learning startups last year, and in North America alone, AI firms raked in nearly 50% of venture capital funding.\n\nAI companies have attracted a host of people to the Bay Area looking to capitalize on what Huang describes as another \"industrial revolution.\" Despite concerns that AI-assisted coding, sometimes called \"vibe coding,\" could negatively impact the number of job openings for software engineers, many tech firms continue to hire quickly amid the AI arms race.\n\n\"In our company, just as a starting point, every single software engineer is now assisted by AI assistants,\" the Nvidia CEO said. \"And the amount of code that we check into the company is incredible as a result. Our productivity has shot up through the roof, and we're hiring more people.\"\n\nAI has enabled Nvidia to \"create more things the world desires,\" Huang added, and the company's revenue, along with its \"ability to hire,\" have increased alongside its use of the technology.\n\nSan Francisco's population numbers are responding positively to the AI boom, according to Forbes — the city is now seeing growth again after around 7% of its citizens left between 2020 and 2022. Residential real estate prices are up, too, with 57% of homes in San Francisco selling above their asking price during February of this year, according to Redfin data. That's up 50% from 2024, and represents the biggest jump among the top 50 metros in the US, surpassing even New York.\n\nAnd while interest from the AI sector may not presently be enough to completely repopulate the vast number of offices standing vacant in downtown, the sustained interest of another tech boom could make a bigger dent. If the industry keeps growing at its breakneck pace of 30% a year, the San Francisco Examiner estimated it could take up around 12 million square feet of commercial real estate by the end of the decade — or a seventh of the office buildings in San Francisco."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Emma Cosgrove",
    "title": "A guide to Nvidia's competitors: AMD, Qualcomm, Broadcom, startups, and more are vying to compete in the AI chip market",
    "description": "Despite Nvidia's AI semiconductor dominance, competitors are innovating to challenge its lead. Read about AMD, Qualcomm, Broadcom, Amazon, and more.",
    "url": "https://www.businessinsider.com/nvidia-competitors",
    "urlToImage": "https://i.insider.com/681509b2c6ad288d147fe203?width=1200&format=jpeg",
    "publishedAt": "2025-05-11T08:57:02Z",
    "content": "Nvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition.I-Hwa Cheng/AFP/Getty Images\r\n<ul><li>Nvidia dominates the AI semiconductor market.</… [+5915 chars]",
    "full_content": "Nvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition.\n\nNvidia CEO Jensen Huang and his team got an early foothold in the AI chip market — but now, they have competition. I-Hwa Cheng/AFP/Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nNvidia is undoubtably dominant in the AI semiconductor space. Estimates fluctuate, but the company has more than 80% market share by some estimates when it comes to the chips that reside inside data centers and make products like ChatGPT and Claude possible.\n\nThat enviable dominance goes back almost two decades, when researchers began to realize that the same kind of intensive computing that made complex, visually stunning video games and graphics possible, could enable other types of computing too.\n\nThe company started building its famous software stack, named Compute Unified Device Architecture or CUDA, 16 years before the launch of ChatGPT. For much of that time, it lost money. But CEO Jensen Huang and a team of true believers saw the potential for graphics processing units to enable artificial intelligence. And today, Nvidia and its products are responsible for most of the artificial intelligence at work in the world.\n\nThanks to the prescience of Nvidia's leadership, the company had a big head start when it came to AI computing, but challengers are running fast to catch up. Some were competitors in the gaming or traditional semiconductor spaces, and others have started up from scratch.\n\nAMD\n\nAMD, led by CEO Lisa Su, lags behind Nvidia but remains its most serious competitor. I-Hwa Cheng/AFP via Getty Images\n\nAMD is Nvidia's top competitor in the market for AI computing in the data center. Helmed by its formidable CEO Lisa Su, AMD launched its own GPU, called the MI300, for the data center in 2024, more than a full year after Nvidia's second generation of data center GPUs started shipping.\n\nThough experts and analysts have touted the chip's specifications and potential based on its design and architecture, the company's software is still somewhat behind that of Nvidia, making these chips somewhat harder to program and use to their full potential.\n\nAnalysts predict that the company has under 15% market share. But AMD executives insist that they are committed to bringing its software up to par and that future expectations for the evolution of the accelerated computing market will benefit the company — specifically, the spread of AI into so-called edge devices like phones and laptops.\n\nQualcomm, Broadcom, and custom chips\n\nAlso challenging Nvidia are application-specific integrated circuits or ASICs. These custom-designed chips are less versatile than GPUs, but they can be designed for specific AI computing workloads at a much lower cost, which have made them a popular option for hyperscalers.\n\nThough multipurpose chips like Nvidia's and AMD's graphics processing units are likely to maintain the largest share of the AI-chip market in the long term, custom chips are growing fast. Morgan Stanley analysts expected the market for ASICs to double in size in 2025.\n\nCompanies that specialize in ASICs include Broadcom and Marvell, along with the Asia-based players Alchip Technologies and MediaTek.\n\nMarvell is in part responsible for Amazon's Trainium chips while Broadcom builds Google's tensor processing units, among others. OpenAI, Apple, Microsoft, Meta, and TikTok parent company ByteDance have all entered the race for a competitive ASIC as well.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nAmazon and Google\n\nWhile also being prominent customers of Nvidia, the major cloud providers like Amazon Web Services and Google Cloud Platform, often called hyperscalers, have also made efforts to design their own chips, often with the help of semiconductor companies.\n\nAmazon's Trainium chips and Google's TPUs are the most scaled of these efforts and offer a cheaper alternative to Nvidia chips, mostly for the companies' internal AI workloads. However, the companies have shown some progress in getting customers and partners to use their chips as well. Anthropic has committed to running some workloads on Amazon's chips, and Apple has done the same with Google's.\n\nIntel\n\nIntel and its Gaudi line of AI chips has struggled to compete with Nvidia and AMD. Mandel Ngan/AFP via Getty Images\n\nOnce the great American name in chip-making, Intel has fallen far behind its competitors in the age of AI. But, the firm does have a line of AI chips called Gaudi that some reports have said can stand up to Nvidia's in some respects.\n\nIntel installed a new CEO, semiconductor veteran Lip-Bu Tan, in the first quarter of 2025 and one of his first actions was to flatten the organization so that the AI chip operations reports directly to him.\n\nHuawei\n\nThough Nvidia's American hopeful challengers are many, China's Huawei is perhaps the most concerning competitor of all for Nvidia and all those concerned with continued US supremacy in AI.\n\nHuang himself has called Huawei the \"single most formidable\" tech company in China. Reports that Huawei's AI chip innovation is catching up are increasing in frequency. New restrictions from the Biden and Trump administrations on shipping even lower-power GPUs to China have further incentivized the company to catch up and serve the Chinese markets for AI. Analysts say further restrictions being considered by the Trump administration are now unlikely to hamper China's AI progress.\n\nStartups\n\nAlso challenging Nvidia are a host of startups offering new chip designs and business models to the AI computing market.\n\nThese firms are starting out at a disadvantage, as they don't have the full-sized sales and distribution machines decades of chip sales in other types of tech bring. But several are holding their own by finding use cases, customers, and distribution methods that are attractive to customers based on faster processing speeds or lower cost. These new AI players include Cerebras, Etched, Groq, Positron AI, Sambanova Systems, and Tenstorrent, among others."
  },
  {
    "source": {
      "id": null,
      "name": "Slashdot.org"
    },
    "author": "msmash",
    "title": "Nvidia CEO: 'You Won't Lose Your Job To AI, But To Someone Who Uses It'",
    "description": "Nvidia founder and CEO Jensen Huang has served up another blunt take on the job market as AI permeates society. From a report: \"You will not lose your job to AI, but will lose it to someone who uses it,\" Huang said at the Milken Institute Conference. Added Hu…",
    "url": "https://slashdot.org/story/25/05/09/0815221/nvidia-ceo-you-wont-lose-your-job-to-ai-but-to-someone-who-uses-it",
    "urlToImage": "https://a.fsdn.com/sd/topics/ai_64.png",
    "publishedAt": "2025-05-09T14:40:00Z",
    "content": "You can use something like Copilot to fill out interfaces, refactor large projects, or generate a mocking class. But if you don't know the project, then the AI assistant won't be much help. Copilot d… [+313 chars]",
    "full_content": "Nvidia founder and CEO Jensen Huang has served up another blunt take on the job market as AI permeates society. From a report:"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Ben Bergman",
    "title": "Nvidia-backed Israeli AI startup AI21 is raising a $300 million funding round",
    "description": "AI21, an Israeli startup building its own large language models (LLMs), is raising a $300 million funding round, according to a source.",
    "url": "https://www.businessinsider.com/llm-startup-ai21-is-raising-a-300-million-funding-round-2025-5",
    "urlToImage": "https://i.insider.com/681d09fac6ad288d14806e1d?width=1200&format=jpeg",
    "publishedAt": "2025-05-09T09:00:02Z",
    "content": "AI21's founders from left to right: Ori Goshen, Amnon Shashua and Yoav Shoham.Roei Shor\r\n<ul><li>AI21 is raising a $300 million Series D funding round to build its own LLMs.</li><li>AI21 aims to redu… [+1904 chars]",
    "full_content": "lighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAI21 Labs, an Israeli startup building its own large language models, is raising a $300 million Series D funding round, a person with knowledge of the deal said.\n\nThe valuation could not be learned. The company last raised $208 million at a $1.4 billion valuation in 2023. This round would bring the company's total funding to $636 million.\n\nAI21 was founded in 2017 by the entrepreneurs and AI researchers Amnon Shashua (the founder and CEO of Mobileye), Yoav Shoham (a professor emeritus at Stanford University and a former principal scientist at Google), and Ori Goshen (a serial entrepreneur and the founder of CrowdX).\n\nWhile many AI startups rely on LLMs built by companies like Anthropic or OpenAI, AI21 is building its LLMs from the ground up.\n\nIts goal is to make generative AI more dependable for companies by reducing hallucinations, which are when LLMs present false information as fact.\n\nIn March, AI21 launched an AI orchestration system called Maestro, which it says can reduce hallucinations by 50% and boost reasoning model accuracy to over 95%.\n\nExisting investors in AI21 include Google, Nvidia, Intel Capital, Walden Catalyst, Pitango, SCB 10X, B2venture, Samsung Next, Comcast Ventures, and Ahren Innovation Capital. Customers include Fnac, Capgemini, and the website builder Wix.\n\nAbout $7 billion in investment went to AI-related startups last month, representing 30% of venture funding worldwide, according to Crunchbase data.\n\nIsraeli tech companies have raised more than $12 billion in 2024, up 31% from 2023, Startup Nation Central says. The Israeli cybersecurity company Wiz was just acquired by Google for $32 billion, the search giant's largest-ever acquisition."
  },
  {
    "source": {
      "id": null,
      "name": "Quartz India"
    },
    "author": "Ben Kesslen",
    "title": "Nvidia CEO Jensen Huang says San Francisco is so back — thanks to AI",
    "description": "Nvidia (NVDA) CEO Jensen Huang said AI has revived a dying San Francisco that many thought wouldn’t recover from the pandemic.Read more...",
    "url": "https://qz.com/nvidia-ceo-jensen-huang-san-francisco-ai-1851779366",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/9a9538960657ac3cb612199d3bee232c.jpg",
    "publishedAt": "2025-05-06T16:45:00Z",
    "content": "In This Story\r\nNvidia (NVDA) CEO Jensen Huang said AI has revived a dying San Francisco that many thought wouldnt recover from the pandemic.\r\nIts because of AI that San Francisco is back, Huang said … [+1137 chars]",
    "full_content": "Nvidia (NVDA-1.54% ) CEO Jensen Huang said AI has revived a dying San Francisco that many thought wouldn’t recover from the pandemic.\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\n“It’s because of AI that San Francisco is back,” Huang said while speaking to Jacob Helberg, Trump’s undersecretary for Economic Growth, Energy, and the Environment, at The Hill & Valley Forum.\n\nAdvertisement\n\n“Anybody who lives in San Francisco, you’ll know what I’m talking about. Just about everybody evacuated San Francisco,” he said, “Now it’s thriving again. It’s all because of AI.”\n\nNVIDIA CEO Jensen Huang | Rebuilding Industrial Power: AI Factories & the Return of US Manufacturing\n\nA 2024 article from The San Francisco Standard called AI companies San Francisco’s “most desired tenants.” It cited a JLL (JLL-1.68% ) report that found AI companies leased north of 1.7 million square feet of office space since 2022, when ChatGPT was released.\n\nAdvertisement\n\nChris Pham, senior analyst at JLL, predicted a continued AI boom in the city, likening it to the invention of electricity, instead of just another new industry.\n\nAdvertisement\n\nIn his remarks with Helberg, Huang acknowledged that as AI progresses, “new jobs will be created, some jobs will be lost, and every job will be changed.”\n\nAdvertisement\n\n“It’s not AI that’s going to take your job. It’s not AI that’s going to destroy your company,” he said, encouraging widespread adoption of the technology. “It’s the company and the person who uses AI that’s going to take your job. And so that’s something to internalize.”"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Sarah Perkel",
    "title": "Nvidia vice president says GPUs are the 'currency' of AI researchers",
    "description": "Jonathan Cohen, VP of Applied Research at the company, said sacrifices are made for new priorities, both technical and personal.",
    "url": "https://www.businessinsider.com/nvidia-researchers-training-artificial-intelligence-2025-5",
    "urlToImage": "https://i.insider.com/681e39de3fe8d3928365727e?width=1200&format=jpeg",
    "publishedAt": "2025-05-10T08:01:01Z",
    "content": "Some of Nvidia's researchers donated their compute to help facilitate a swift rollout of the company's Llama Nemotron models.Justin Sullivan/Getty Images\r\n<ul><li>Nvidia's Llama Nemotron models were … [+2614 chars]",
    "full_content": "Some of Nvidia's researchers donated their compute to help facilitate a swift rollout of the company's Llama Nemotron models.\n\nSome of Nvidia's researchers donated their compute to help facilitate a swift rollout of the company's Llama Nemotron models. Justin Sullivan/Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nIn the world of AI research, the speed of development is limited in large part by available computing resources, according to Jonathan Cohen, Vice President of Applied Research at Nvidia.\n\n\"These days, the currency in any AI researcher is how many GPUs they get access to, and that's no less true at Nvidia than at any other company,\" Cohen said in an interview on Nvidia Developer.\n\nCohen led the team responsible for developing Nvidia's Llama Nemotron family of models. Released in March of this year, they represent the company's entry into the world of \"reasoning\" AI systems.\n\nThe speed at which the models came together was remarkable, Cohen said, taking \"no more than one to two months.\" He partially credits the efficiency of their development to other workers being willing to sacrifice their processing power.\n\n\"So, there were a lot of researchers who very selflessly agreed to give up their compute so that we could get these Llama Nemotron models trained as quickly as we did,\" he said.\n\nCohen also attributed the speed of development to Nvidia's company-wide culture of prioritizing major projects, regardless of current team goals.\n\n\"How do you have a team to do a thing you've never done before? Part of the corporate culture is — we call them a 'swarm' — where you identify, 'This is something that's important,'\" he said. \"And everyone, every manager who has people who might be able to contribute, thinks about, 'Is this new thing more important than the current thing everyone on my team is doing?'\"\n\nIf the manager can spare anybody, they'll \"contribute\" their direct reports to the new priority.\n\n\"Llama Nemotron ended up being a very cross-discipline, cross-team effort,\" Cohen added. \"We had people from across the whole company working together without any formal organizational structure.\"\n\nLlama Nemotron required a series of sacrifices, Cohen said, both in terms of computing power and personnel — but people were able to set aside self-interests for the benefit of the whole.\n\n\"It was really great to see, great leadership,\" he said. \"There were a lot of sacrifices that people made, a lot of very egoless decisions that brought it together, which is just awesome.\"\n\nNvidia did not respond to a request for comment by Business Insider immediately prior to publication."
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Antonio G. Di Benedetto",
    "title": "Here’s Alienware’s fresh take on entry-level gaming laptops",
    "description": "Alienware is introducing a pair of new, more affordable gaming laptops: the Aurora 16 and 16X, starting at $1,149 and $1,949, respectively. Unlike the flagship Area-51 laptops announced back at CES, the Auroras are meant to be a little more versatile, portabl…",
    "url": "https://www.theverge.com/news/662857/alienware-aurora-16-16x-gaming-laptop-nvidia-rtx-price-specs",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/aw-16-aurora-ac16250-gaming-laptop-awproheadset-awpromouse-front-1.png?quality=90&strip=all&crop=0%2C10.750087716126%2C100%2C78.499824567748&w=1200",
    "publishedAt": "2025-05-07T22:09:18Z",
    "content": "The Aurora 16 and 16X have up to RTX 5070 GPUs, but start with an RTX 3050 and just 8GB of RAM.\r\nThe Aurora 16 and 16X have up to RTX 5070 GPUs, but start with an RTX 3050 and just 8GB of RAM.\r\nAlien… [+3023 chars]",
    "full_content": "is a reviewer covering laptops and the occasional gadget. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021.\n\nAlienware is introducing a pair of new, more affordable gaming laptops: the Aurora 16 and 16X, starting at $1,149 and $1,949, respectively. Unlike the flagship Area-51 laptops announced back at CES, the Auroras are meant to be a little more versatile, portable, and comfortable for general laptop use. They replace the older Alienware M, X, and cheaper Dell G lines — which will be slowly phased out as part of Dell’s streamlining of its products.\n\nSome configurations of the Aurora 16 and 16X are launching today in North America, with additional models arriving later.\n\nThe duo of indigo-colored 16-inch laptops are lighter, smaller, and cheaper than the 16- and 18-inch Area-51 models. They’re still pretty hefty at around 5.5 to 5.86 pounds, but much lighter compared to the 7.6 to 10 pounds of the Area-51. And the new models even have a stealth mode button that switches the RGB lighting to a simpler white light and tones down the fans. The Auroras get their name from one of Alienware’s desktop lines, but they’re meant to be taken places, as the 16 and 16X were designed to fit in a backpack thanks to a lack of thermal shelf (the big butt behind the hinge many gaming laptops have). Instead, the Auroras have a protruding bump beneath their chassis where their fans pull in air.\n\nThe Aurora pair look slightly low-key for gaming laptops, aside from their Alien head logos and full number pads. Image: Dell\n\nSpec-wise, both laptops have 16-inch displays, but the Aurora 16 has a 300-nit 120Hz 2560 x 1600 IPS panel, while the 16X has the same resolution but gets up to 500 nits and 240Hz refresh rate. The Auroras have two USB-A, two USB-C, HDMI 2.1, Ethernet, a 3.5mm combo audio jack, a proprietary power plug, and Wi-Fi 7. Each has its ports on the left and rear, freeing up the right side for unhindered mouse movements while gaming. One of the USB-C ports on the 16X gets faster Thunderbolt 4 and DisplayPort 2.1 instead of just USB 3.2 Gen 2.\n\nBoth laptops can be outfitted with up to an Nvidia RTX 5070 GPU, but the Aurora 16 is the entry-level option — with a base configuration in North America equipped with a last-gen RTX 4050. In some countries, such as Brazil and India, the base Aurora 16 comes with a two-generations-old RTX 3050. The pricier Aurora 16X starts with a newer and more powerful RTX 5060.\n\n\n\nThe Aurora 16 is also a step behind on CPUs. Its Intel “Raptor Lake Refresh” chips are based on architecture from 2022, while the 16X has the latest Intel “Arrow Lake” configurations up to the Core Ultra 9 275HX.\n\nImage: Dell Image: Dell Image: Dell Image: Dell\n\nDell-owned Alienware is angling these new models at gamers on a budget or those who can only justify one device for both play and work (or school). I just can’t help finding it funny that, between Alienware and its parent company Dell, it’s actually Alienware with the clearer and more pleasant-sounding naming scheme. Somehow, the try-hard gaming brand with an alien head logo understands that names are better than a mishmash of Plus, Premium, Pro, and Max."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Kyle Barr",
    "title": "A New GTA VI Trailer Is Here, but We Still Don’t Know if the Game Is Coming to Switch 2",
    "description": "Grand Theft Auto VI is going to be on PS5 and Xbox on May 26, though Switch 2 wasn't mentioned at all.",
    "url": "https://gizmodo.com/a-new-gta-vi-trailer-is-here-but-we-still-dont-know-if-the-game-is-coming-to-switch-2-2000598647",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/GTA-VI-Real_Dimez_02.0ea0477d.jpg",
    "publishedAt": "2025-05-06T17:30:57Z",
    "content": "Grand Theft Auto VIwont arrive in 2025, but as a consolation prize, Rockstar Games dropped a video featuring a few snippets of gameplay for whats still one of the most anticipated games set to arrive… [+4651 chars]",
    "full_content": "Grand Theft Auto VI won’t arrive in 2025, but as a consolation prize, Rockstar Games dropped a video featuring a few snippets of gameplay for what’s still one of the most anticipated games set to arrive next year. That slice-of-life trailer cements just how little we know about Rockstar’s ultra-hyped open world. The big question on everyone’s mind: will GTA VI ever launch on Nintendo Switch 2, and if there are plans, will it arrive on the May 26, 2026 release date, or sometime after?\n\nRockstar’s new page for GTA VI offers a few scant details about the game’s story and its expansive cast of criminal characters. Players will terrorize Vice City and the surrounding state of Leonida Keys as Jason Duval, a military vet working for drug dealers. His partner in crime, Lucia Caminos, is an ex-con who wants to make her dreams of a good life a reality by any means necessary. At the top of the page, Rockstar says the upcoming open-world game will be available on PlayStation 5 and Xbox Series X and Series S at launch. It makes no mention of PC or Switch 2 availability.\n\nRockstar normally takes a full year before it publishes its games to other platforms, like it did for Grand Theft Auto V and Red Dead Redemption 2 on PC (these ports are reportedly more complicated than they seem). Still, the company has worked with Nintendo to launch past titles like the first Red Dead Redemption on the original Switch (though not the recent remastered version). Judging by analyst expectations and its massive wave of preorders, the Switch 2 is set to be the biggest console release of the past several years. The video game industry is relying on GTA VI to be a similarly landmark release. Publishers also hope GTA publisher Take-Two Interactive and Rockstar will sell the game for $100, setting a new price ceiling for game prices beyond today’s burgeoning $80 AAA game standard.\n\nOne industry analyst who spoke to Gizmodo mentioned Nintendo may not appreciate the press of the ultra-violent Grand Theft Auto series finally coming to its largely family-friendly platform. Still, Take-Two has every reason to want GTA VI on Switch 2, and Strauss Zelnick, the company’s CEO, said as much during a recent earnings call. Zelnick hedged his bets, telling investors that Nintendo’s consoles aren’t just geared for younger players. He cited games like Civilization VII being on the Switch 2 as an example of the handheld’s aging demographic. He added that his company “actually would fully expect to support Switch [2].”\n\nZelnick recently had to assuage shareholders’ disappointment at the GTA VI delay. A Switch 2 announcement would do a lot to help in that regard, though we’ve not heard anything official. “We’ve had—obviously—a long-standing relationship with Nintendo,” Zelnick said during his February earnings report. “We’ve supported the platform when it made sense for the individual release.”\n\nThere’s also the matter of whether or not the Switch 2 is up to snuff to run GTA VI. The console’s Nvidia-made chipset is speculated to have performance roughly between a PlayStation 4 and PS4 Pro. That being said, the Switch 2 is powerful enough to play Cyberpunk 2077, though only at 1080p when docked and hooked up to a TV. CD Projekt Red worked directly with Nintendo on the port, and developers recently said on a Nintendo Creator’s Voice video the port may be “the most cyberpunk way” of playing the game thanks to the addition of mouse and motion controls on the new Joy-Cons 2. CD Projekt Red VP of business development Jan Rosner told The Game Business that it makes sense for Cyberpunk 2077 to be on Switch 2 since “Nintendo’s audience is growing and broadening.”\n\nCyberpunk 2077 will fit on a 64GB game card, though that’s not the norm. Many other large, third-party games will be loaded on game-key cards, which are essentially a download code for players to get the title on Nintendo’s eShop. GTA VI will likely be a massive title, and it could easily eat up a huge chunk of the system’s 256GB built-in storage. Cyberpunk 2077 will be a slightly different experience than on PC, especially considering the difference in the size of the game, though Rosner stressed that coming back to Night City will still be as engrossing and violent as before.\n\nEven if CD Projekt Red had an easy time porting to Switch 2, there are other technical aspects to consider. Rockstar’s games run on the Rockstar Advanced Game Engine, though we don’t know how much stress it might put on both modern consoles, especially when playing at 4K. The only upscaling tech the game will have access to is the still-limited, AMD-based PSSR on PlayStation 5 Pro, so Rockstar would be better off making GTA VI accessible with the Nvidia-made upscaling on the Switch 2. There’s still plenty of time for Rockstar to finally let us hold up drugstores on Nintendo’s family-friendly console."
  },
  {
    "source": {
      "id": null,
      "name": "Quartz India"
    },
    "author": "Niamh Rowe",
    "title": "Here’s why Trump killing the ‘AI diffusion rule’ is a win for chipmakers",
    "description": "The U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips — a policy that had posed challenges for major semiconductor companies like Nvidia (NVDA) and AMD (AMD).Read more...",
    "url": "https://qz.com/nvidia-amd-trump-biden-ai-chips-china-rule-1851779738",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e3e734dd7188b8f9d8051d40af3ea7e5.jpg",
    "publishedAt": "2025-05-08T16:25:00Z",
    "content": "In This Story\r\nThe U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips a policy that had posed challenges for ma… [+1977 chars]",
    "full_content": "The U.S. government plans to withdraw a rule introduced under the Biden administration that had aimed to restrict exports of advanced AI chips — a policy that had posed challenges for major semiconductor companies like Nvidia (NVDA-1.54% ) and AMD (AMD+0.47% ).\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\n“The Biden AI rule is overly complex, overly bureaucratic and would stymie American innovation,” a spokeswoman from the Commerce Department said in a statement. The Trump administration intends to issue a revised version of the rule, which was set to come into effect on May 15. This process could take months to finalize, sources told Axios.\n\nAdvertisement\n\nThe regulation in question — titled the Framework for Artificial Intelligence Diffusion — would have limited exports of AI chips to over 100 countries. These restrictions aimed to prevent countries from bypassing U.S. export controls, particularly in relation to China.\n\nAdvertisement\n\nChipmakers had criticized the rules, however. They argued it would give an advantage to Chinese competitors, such as Huawei, as they develop and sell their own AI hardware, foregoing an opportunity to ensure that much of the world would rely on American technology. The rule would have affected Nvidia’s ability to sell its high-demand graphics processing units, or GPUs, in markets such as India, Mexico, Singapore, and Switzerland.\n\nAdvertisement\n\nThe shift could reflect a relaxing stance toward regulating AI, offering a momentary boon for chipmakers. Since Bloomberg first reported the reversal on Wednesday, Nvidia and AMD stocks have gained 4.4% and 3.4%, respectively.\n\nBut any respite could prove temporary, and obstacles persist when it comes to accessing the crucial Chinese market.\n\nAdvertisement\n\nNvidia’s most powerful chips, including the A100 and H100, are already banned from export to China, as a result of Biden-era restrictions.\n\nLast month the Trump administration also introduced new license requirements for less powerful chips by Nvidia and AMD in order to comply with export controls. Nvidia said these requirements on its H20 chips had resulted in a $5.5 billion hit to its quarterly earnings, according to a Securities and Exchange Commission filing. The company’s earnings are scheduled to be released May 28."
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Lee Chong Ming",
    "title": "Jensen Huang says he uses AI as a tutor 'every day'",
    "description": "Jensen Huang said at the 28th annual Milken Institute Global Conference that AI is the \"greatest opportunity for us to close the technology divide.\"",
    "url": "https://www.businessinsider.com/nvidia-ceo-jensen-huang-ai-tutor-every-day-milken-2025-5",
    "urlToImage": "https://i.insider.com/681ae7343fe8d3928365239e?width=1200&format=jpeg",
    "publishedAt": "2025-05-07T06:50:17Z",
    "content": "\"Don't be that person who ignores this technology and this result loses you,\" said Nvidia's CEO Jensen Huang.Kevin Dietsch/Getty Images\r\n<ul><li>Nvidia's CEO, Jensen Huang, said he uses AI \"as a tuto… [+2456 chars]",
    "full_content": "\"Don't be that person who ignores this technology and this result loses you,\" said Nvidia's CEO Jensen Huang.\n\n\"Don't be that person who ignores this technology and this result loses you,\" said Nvidia's CEO Jensen Huang. Kevin Dietsch/Getty Images\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nNvidia's CEO, Jensen Huang, isn't just building the chips that power advanced AI models — he says he's also using those models as his personal tutor.\n\n\"I use it as a tutor every day,\" Huang said of tools like ChatGPT, Gemini Pro, and Perplexity. \"In areas that are fairly new to me, I might say, 'Start by explaining it to me like I'm a 12-year-old,' and then work your way up into a doctorate-level over time.\"\n\nHuang was speaking at a panel at the 28th annual Milken Institute Global Conference on Tuesday. The mega-investment conference held in California this year draws global leaders, tech executives, and experts to discuss the future of finance, innovation, and global markets.\n\nThat kind of access, Huang says, is what makes this generation of technology a potential equalizer.\n\n\"Artificial intelligence is the greatest opportunity for us to close the technology divide,\" he said.\n\n\"In this room, it's very unlikely that more than a handful of people know how to program with C++,\" he said. C++ is a specialized coding language used for building software.\n\n\"Yet 100% of you know how to program an AI, and the reason for that is because the AI will speak whatever language you wanted to speak,\" he added.\n\nHuang said everybody should take advantage of AI's capabilities and \"every student should use it as a tutor.\"\n\n\"Don't be that person who ignores this technology and this result loses you,\" he added.\n\nThe AI revolution will also touch every job, Huang said.\n\nSome roles will be lost, others created — but all will be transformed. \"You're not going to lose your job to AI,\" Huang said. \"You're going to lose your job to someone who uses AI.\"\n\nHuang has long been a proponent of using AI and co-pilots to automate tasks in the workforce. He previously said that he wanted Nvidia to be a company with \"100 million AI assistants.\"\n\nHuang said in October at an AI summit in India that AI will do parts of some jobs 1,000 times better — but it will never replace the actual humans doing those roles.\n\nNvidia produces some of the most sought-after chips for AI models. In June, on the back of the AI wave, Nvidia hit a $3 trillion market cap for the first time. Its value has since dipped back down to $2.8 trillion."
  },
  {
    "source": {
      "id": null,
      "name": "Tlapl.us"
    },
    "author": "TLA+ Foundation",
    "title": "GenAI-Accelerated TLA+ Challenge",
    "description": "The TLA+ Foundation, in collaboration with NVIDIA, is pleased to announce the GenAI-accelerated TLA+ challenge—an open call for submissions that explore the intersection of TLA+ and generative AI. This initiative aims to foster practical and innovative toolin…",
    "url": "https://foundation.tlapl.us/challenge/index.html",
    "urlToImage": null,
    "publishedAt": "2025-05-06T17:54:52Z",
    "content": "Awards\r\nExample Project Areas\r\nParticipants may submit work including, but not limited to:\r\n<ul><li>Intelligent refactoring of TLA+ specifications (e.g., managing UNCHANGED correctly when adding vari… [+2049 chars]",
    "full_content": "GenAI-accelerated TLA+ challenge\n\nThe TLA+ Foundation, in collaboration with NVIDIA, is pleased to announce the GenAI-accelerated TLA+ challenge—an open call for submissions that explore the intersection of TLA+ and generative AI.\n\nThis initiative aims to foster practical and innovative tooling, workflows, and approaches that bring the capabilities of generative AI and LLMs to TLA+. Participants are invited to develop engineering-oriented solutions that advance the usability, accessibility, and automation of formal specification through the integration of GenAI.\n\nAwards\n\n1st Place : Nvidia GeForce RTX 5090 (sponsored by NVIDIA)\n\n: Nvidia GeForce RTX 5090 (sponsored by NVIDIA) 2nd Place : One-year single seat, individual subscription to Github Copilot Pro+ (sponsored by the TLA+ Foundation)\n\n: One-year single seat, individual subscription to Github Copilot Pro+ (sponsored by the TLA+ Foundation) 3rd Place: One-year single seat, individual subscription to Github Copilot Pro (sponsored by the TLA+ Foundation)\n\nExample Project Areas\n\nParticipants may submit work including, but not limited to:\n\nIntelligent refactoring of TLA+ specifications (e.g., managing UNCHANGED correctly when adding variables)\n\ncorrectly when adding variables) LLM-enhanced linters, formatters, or other development tools\n\nLLM-driven tools for automated grading in education\n\nVisualizations of specifications or execution traces\n\nGeneration of type annotations for tools like Apalache\n\nSynthesis of inductive invariant candidates, validated via TLC or Apalache\n\nSynthesis of TLAPS proofs\n\nSynthesis of entire specifications from source code and design documents\n\nEvaluation\n\nSubmissions will be judged by the TLA+ Specification Language Committee (SLC)\n\nThe Jury will evaluate submissions based on their functionality, relevance to the TLA+ ecosystem, and the thoughtful use of AI. Submissions must be reproducible by the Jury. Passive formats, such as videos alone, are not sufficient. However, the Jury does not require a fully polished product—a prototype is sufficient. All submissions must be released under the MIT license, and any underlying AI models must be publicly available.\n\nThe use of GenAI/LLMs is explicitly encouraged, provided that any AI-generated content—such as specs, invariants, visualizations, … —is checked using some form of verification such as the TLA+ tools.\n\nParticipation Criteria\n\nEligible participants must meet the following:\n\nPrior engagement with the TLA+ community (e.g., contribution to mailing lists, forums, open-source repositories, conference presentations, or academic publications)\n\nMust not be a member of the TLA+ Foundation Board or Specification Language Committee\n\nMust not be subject to any legal, contractual, export control, or jurisdictional restrictions that would preclude participation\n\nSubmission Timeline & Announcement\n\nSubmissions will open alongside this announcement. The deadline to submit entries for the challenge is July 3, 2025. Submissions must be sent to genai@tlapl.us. The jury will select the winner one month after the submission period closes. We welcome innovative, technically robust, and practically valuable contributions that explore and expand the potential of GenAI within the context of TLA+.\n\nFor longer-term or foundational engineering and research efforts related to TLA+, we encourage you to explore the TLA+ grant program."
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Why This Nvidia-Backed Robotaxi Stock Is Skyrocketing Today",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_976101cc-03f4-43aa-abcf-f10979001ce0",
    "urlToImage": null,
    "publishedAt": "2025-05-06T18:19:00Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Trefis Team, Contributor, \n Trefis Team, Contributor\n https://www.forbes.com/sites/greatspeculations/people/trefis/",
    "title": "Nvidia Stock At 40% Safety",
    "description": "With artificial intelligence tunes playing everywhere, do you think Nvidia stock is a good long-term bet at current levels?",
    "url": "https://www.forbes.com/sites/greatspeculations/2025/05/10/nvidia-stock-at-40-safety/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681f59e9f51978e1158e59d7/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-10T14:57:37Z",
    "content": "Nvidia CEO Jensen Huang speaks during the Milken Institute Global Conference in Beverly Hills, ... More California on May 6, 2025. (Photo by Patrick T. Fallon / AFP) (Photo by PATRICK T. FALLON/AFP v… [+5069 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Kyle Barr",
    "title": "The $170 Backbone Pro Mobile Controller Falls Just Short of Premium",
    "description": "The Backbone Pro wants to be your controller for both mobile and PC, but it's too expensive for what it does.",
    "url": "https://gizmodo.com/backbone-pro-review-mobile-controller-falls-just-short-of-premium-2000599153",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/backbone-pro-review-03.jpg",
    "publishedAt": "2025-05-08T16:30:42Z",
    "content": "In an effort to expand beyond smartphones, Backbone is now selling an everything controller. Just like the Backbone One, the new $170 Backbone Pro turns a phone into a quick and dirty gaming handheld… [+5128 chars]",
    "full_content": "In an effort to expand beyond smartphones, Backbone is now selling an everything controller. Just like the Backbone One, the new $170 Backbone Pro turns a phone into a quick and dirty gaming handheld, but with added Bluetooth connectivity, it also connects to a PC or smart TV. If you’re the traveling kind, it promises to be the only quality (albeit expensive) controller you need to take with you. Or it would be a solid 2-in-1 gamepad if—unlike me—you apparently have enormous hands.\n\nSee Backbone Pro at Amazon\n\nThere has to be something exemplary about a “Pro” device, especially to justify the $170 price compared to the $100 you pay for the Backbone One. If you judge it merely by its on-paper feature set, there’s not so much that stands out. The new mobile controller has a pair of back buttons on both the left and right grips. Not exciting enough? The Backbone Pro also houses a special pairing button for connecting to external devices—mainly PC, Mac, or TV—over Bluetooth. You can combine it with the Backbone+ app for button mapping and easy swapping between connected devices with the new “FlowState” feature.\n\nBackbone Pro It feels good in hand, but there are missing features that make it less 'pro' than it could be. Pros Controls are clicky and responsive\n\nControls are clicky and responsive Textured grips offer extra comfort\n\nTextured grips offer extra comfort Solid battery life with smart power passthrough\n\nSolid battery life with smart power passthrough Smart idea for connecting to multiple devices Cons Backbone still doesn't feel perfect for my hands\n\nBackbone still doesn't feel perfect for my hands No Hall effect joysticks\n\nNo Hall effect joysticks Doesn't extend enough to support latest iPad mini\n\nDoesn't extend enough to support latest iPad mini Expensive\n\nThat easy swapping is especially nice for gaming on multiple devices, but is it the controller you honestly want to use for both PC and mobile? Controllers live and die by how they feel in your hands. If you’ve ever held a Backbone One, you have a good idea of the general feel for the “Pro” controller, even though there are subtle improvements. The high point of the Backbone One is the D-pad and face buttons, which aren’t overly loud even though they have the sort of clicky feeling I enjoy most on low-profile controls. This pricier Backbone includes Hall effect triggers, but even if the new full-size thumbsticks are responsive, they are still the traditional ALPS-type sensor. These use potentiometers to calculate the orientation of the stick, and that can lead to wear and stick drift, whereas Hall effect sticks normally last longer. Hall effect sticks would be more welcome on a gamepad whose full-sized sticks could get knocked around in your backpack when traveling.\n\nThe Backbone Pro’s satin-textured grips have the feel I normally only get from premium devices, but is it $170 premium? If I had to judge, it wasn’t quite on par with high-end “Pro” level devices from the likes of SCUF, Razer, or even an Xbox Elite wireless controller. These devices normally cost closer to $200 or more, so the Backbone Pro needs to be pitch-perfect. Using the controller, I found my hands were big enough that I needed to adjust my grip ever-so-slightly if I wanted to access the face buttons or D-pad while maintaining quick access to the thumbsticks. It’s not a problem when playing some mobile titles or emulating retro titles. When playing a more modern game such as The Elder Scrolls V: Oblivion remake through Xbox Game Pass, I had to adjust my grip more than I was used to.\n\nA larger device like a Gamesir G8+ fits my hands better, but its controls don’t feel nearly as polished as the Backbone Pro. There are other trade-offs to consider. Unlike the Backbone One, there is no version of the Pro that supports Apple’s Lightning connection. The Razer Kishi Ultra at $150 extends far enough to fit a tiny tablet, but the Backbone Pro doesn’t even stretch to allow for the most recent iPad mini’s 8.3-inch screen. That’s where Bluetooth could come in handy, if only I could cover or remove the USB-C dongle to fit my non-standard device inside.\n\nCombined with a foldable phone like the Google Pixel 9 Pro Fold, the Backbone Pro became a kind of pseudo gaming handheld that was especially handy for playing games that fit its wonky 20:9 aspect ratio, specifically Diablo Immortal. Add on the ease of the Backbone+ app, and the Backbone Pro makes streaming games through Nvidia GeForce Now or Xbox Game Pass far more of a console-like experience. The app promotes its “dual screen” experience when playing on PC or TV. However, it’s only useful for checking the charge on both the controller and the phone.\n\nThe battery life is perhaps the Backbone Pro’s best feature. I could go for around three hours without seeing the device dipping into the 20% mark. The gamepad also includes smart passthrough charging that tops off both the phone and built-in battery at once. I can’t knock the build quality on the Backbone Pro. It has controls I’d be happy to use on practically any other gaming device, though only if I didn’t have any of my other preferred controls around.\n\nThe Backbone Pro is the wireless controller I would slip into my backpack if that space already wasn’t occupied with my Steam Deck. As for a mobile controller that would actually fit in my pocket, I’ll just keep waiting for MCon to slip into my life.\n\nSee Backbone Pro at Amazon"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Kyle Barr",
    "title": "I Desperately Hope This Lenovo Gaming Laptop Can Make 3D Screens Mainstream",
    "description": "Glasses-free 3D gaming refuses to die.",
    "url": "https://gizmodo.com/i-desperately-hope-this-lenovo-gaming-laptop-can-make-3d-screens-mainstream-2000599809",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/lenovo9i.jpg",
    "publishedAt": "2025-05-08T18:45:26Z",
    "content": "Lenovo is one of the few big hardware brands that seems to think the next big thing in laptopsbeyond better processors and even more glowy RGB lightsis glasses-free 3D displays. The Lenovo Legion 9i … [+3644 chars]",
    "full_content": "Lenovo is one of the few big hardware brands that seems to think “the next big thing” in laptops—beyond better processors and even more glowy RGB lights—is glasses-free 3D displays. The Lenovo Legion 9i should support 30 games with 3D effects, though it may be brought down by an enormous, tariff-boosted price tag. Ignoring the possible enormous price, I’m left holding out hope that lenticular lenses can find a niche in today’s gaming environment.\n\nThe Legion 9i is one of those kitchen sink, desktop replacement laptops meant for both gamers and creatives who want to do everything from one device, even one that weighs nearly eight pounds. That’s nothing new, though what’s different about this device is its 18-inch “PureSight” display that supports 4K resolution in 2D alongside 2K (1,920 x 1,200) resolution in 3D. Like what we experienced with the Samsung Odyssey 3D gaming monitor and Lenovo’s concept 3D curved displays, the screen is an IPS LCD panel built with a lenticular lens array. This creates a kind of pseudo 3D popout effect along with a subtle hint of depth on images. If you ever tried the 3D effect on a Nintendo 3DS, then you have a good idea what this looks like.\n\nThe Nintendo 3DS was also notorious for requiring pitch-perfect viewing angles for the 3D effect. The technology has improved thanks to the use of eye-tracking cameras that beam the image to each eye individually. Lenovo says users will be able to control this using the Lenovo 3D Studio software. The company claims this supports 3D viewing in “a myriad of video, image, and streaming formats” including some creation apps.\n\nYes, the 3D effect is a novelty for a niche crowd of gamers, but from what I played, the effect enhances the otherworldliness of games with more stylized visuals. Our main gripe with the Samsung Odyssey 3D was its mere 13 supported games when the monitor itself cost $2,000. Lenovo told Gizmodo this laptop supports 30 games, including major titles of the last several years like Cyberpunk 2077, Death Stranding, Black Myth: Wukong, Forza Horizon 5, and Fallout 4. We have yet to see this 3D effect when playing a first-person game, and we’d be concerned the view would lead to a sense of queasiness when a cyberpsycho’s monofilament blade aimed at your character pops out of the screen like a knife aimed at your eyes.\n\nThe screen also supports variable refresh rate (VRR) that can switch from 240Hz at 4K to a blistering 440Hz at FHD. That’s handy, since the laptop is set to contain an Intel Core 9 275HX CPU, an Nvidia GeForce RTX 5090 laptop GPU, plus up to 192GB of RAM. We still don’t have pricing, but considering the stated specs, it could be an enormously expensive device. The Legion 9i could cost even more than the MSI Titan 18 HX, one of the beefiest and most expensive laptops I’ve ever reviewed. At least it supports four slots apiece for RAM and SSD storage extensions.\n\nEven the cover of the laptop is unique, sporting a camo-like pattern made of eight layers of carbon fiber. The gaming laptop won’t be available until fall this year, although some gamers and creators in China will likely be the first to check it out. Trump tariffs have pushed prices up for most gadgets and many other products besides, so we aren’t holding out much hope for a product most people can actually afford.\n\nEven with 30 games on offer at launch, that still may not be enough to push 3D screens into the mainstream. We asked Lenovo if the Legion 9i could support third-party 3D software, like Samsung’s Reality Hub used on its Odyssey 3D, but the company declined to say. The cost of concept devices like this will only get steeper as time goes on."
  },
  {
    "source": {
      "id": null,
      "name": "Windows Central"
    },
    "author": "c.cale.hunt@gmail.com (Cale Hunt)",
    "title": "3 of NVIDIA's biggest red flags I can't ignore for its upcoming RTX 5060 launch",
    "description": "NVIDIA's RTX 5060 is expected to launch on May 19. Unfortunately, NVIDIA looks to be limiting review driver access, adding another red flag to the launch.",
    "url": "https://www.windowscentral.com/hardware/nvidia/rtx-5060-launch-red-flags",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/jPKjHFHDb8iDrSSU76htaf.jpg",
    "publishedAt": "2025-05-08T13:51:30Z",
    "content": "NVIDIA made its mid-range RTX 5060 GPUs official on April 15, and the RTX 5060 Ti in 8GB and 16GB versions debuted one day later on April 16.\r\nRumors suggested that the non-Ti 5060 model would launch… [+5477 chars]",
    "full_content": "NVIDIA isn't giving me much confidence in its RTX 5060 launch.\n\nNVIDIA made its mid-range RTX 5060 GPUs official on April 15, and the RTX 5060 Ti in 8GB and 16GB versions debuted one day later on April 16.\n\nRumors suggested that the non-Ti 5060 model would launch on May 19, and NVIDIA has now confirmed that release date with a 9 AM PT (12 PM ET) launch.\n\nStarting May 19 at 9 a.m. Pacific Time, GeForce RTX 5060 graphics cards, desktops, and GeForce RTX 5060 Laptop GPUs will be available from our partners and retailers worldwide.#GeForceRTX50 pic.twitter.com/VLA9bZUWRWMay 6, 2025\n\nAs explained in the NVIDIA post I shared above, standalone RTX 5060 desktop GPUs, pre-built PCs, and laptops are expected to be available on launch day.\n\nThe RTX 5060 is the most affordable \"Blackwell\" GPU that NVIDIA has released so far, arriving with a $299 MSRP. How closely third-party cards stick to that price remains to be seen.\n\nNVIDIA's 60-class GPUs have traditionally been the most popular cards out there for gamers, at least judging by Steam's Hardware survey. A mix of laptop and desktop RTX XX60 cards dominate the list.\n\nRegardless of the 60-class popularity and relatively attractive pricing (at least compared to other RTX 5000 GPUs), some major red flags are popping up as information regarding the RTX 5060's review cycle comes out.\n\nAdd that to the commotion already created by VRAM amounts and a competing AMD Radeon RX 9060 XT that could be unveiled at Computex (which kicks off May 20), and you have a situation in which NVIDIA doesn't look too hot.\n\nGet the Windows Central Newsletter All the latest news, reviews, and guides for Windows and Xbox diehards. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nHere are the three biggest issues I have with NVIDIA's upcoming RTX 5060 launch.\n\n🚩 NVIDIA RTX 5060 reviews won't go live on launch day\n\nNVIDIA's RTX 5060 GPU is expected to debut at a $299 MSRP on May 19, 2025. (Image credit: NVIDIA)\n\nThere's no better way to judge a GPU than with first-hand experience and testing.\n\nThis is especially important with NVIDIA's RTX 50-series cards, which have all arrived with boastful performance claims that don't always work out as advertised.\n\nUnfortunately, the most recent news suggests that the company won't provide early access to drivers for press reviewing the RTX 5060.\n\nHardware Unboxed revealed the situation with a post on X, claiming that NVIDIA is \"trying to hide the RTX 5060, just as they did the 8GB RTX 5060 Ti.\"\n\nNvidia: \"We're not hiding the RTX 5060, we're very proud of it and gamers will love it\"...also Nvidia: \"We're going to launch the RTX 5060 on May 19th during Computex, and although reviewers have cards right now we won't be releasing the driver until they go on sale\" pic.twitter.com/Cw0mJnSgUpMay 8, 2025\n\nNo advance drivers means no support for the new RTX 5060, so getting hands on the card early doesn't mean anything.\n\nWorsening the situation is the fact that a lot of the major GPU reviewers will already be at Computex on May 19; hard to properly review a GPU when you're at a trade show.\n\nThe Hardware Unboxed revelation points to a post from igorsLAB with the same information. Igor Wallossek is quoted as saying:\n\n\"I will not (be able to) publish a review of the GeForce RTX 5060 here at the official launch. Not because the sample is missing – it’s already on the table – but because NVIDIA has decided not to provide any press drivers until the launch.\"\n\nNothing like delaying a review until after launch to instill confidence in your product that traditionally sells out within hours (if not minutes) of release.\n\n🚩 NVIDIA's RTX 5060 has only 8GB of VRAM\n\nNVIDIA did a split review opportunity for its RTX 5060 Ti launch, seeding to reviewers ahead of release the version with 16GB of VRAM.\n\nThat left launch-day buyers unsure how well the 8GB version performs, and now that publications have been able to review the card with less VRAM, I can see why.\n\nHardware Unboxed got its hands on the 8GB RTX 5060 Ti and published a review a few days after launch, calling the card \"instantly obsolete.\"\n\nRTX 5060 Ti 8GB - Instantly Obsolete, Nvidia Screws Gamers - YouTube Watch On\n\nTechSpot also provided some in-depth RTX 5060 Ti 8GB testing after launch, and it too called the card \"instantly obsolete.\"\n\nA more complete quote from TechSpot's review sums up the results it saw after testing 15 games:\n\n\"It's painfully obvious that an 8GB frame buffer is no longer satisfactory for PC gaming beyond the most entry-level products, which can't cost more than about $150. Since such products no longer exist in the current market, neither should 8GB VRAM configurations.\"\n\nConsidering the RTX 5060 doesn't have a 16GB VRAM option and falls behind the 5060 Ti in terms of CUDA cores and clock frequency, it's easy to suspect that reviewers won't go easy on the GPU.\n\n🚩 AMD's Radeon RX 9060 XT GPUs are expected soon\n\nAMD's Radeon RX 9060 XT GPUs are expected to be unveiled at Computex 2025. (Image credit: AMD)\n\nRumors suggest that AMD's Radeon RX 9060 XT GPUs will be revealed at Computex 2025.\n\nLike NVIDIA with its RTX 5060 Ti, it looks like AMD plans to offer 8GB and 16GB VRAM options.\n\nConsidering the fallout it's seen regarding NVIDIA's $379 8GB 5060 Ti, I expect AMD will deliver its GPUs at a more affordable price to help justify its own 8GB card.\n\nOf course, the RX 9060 XT GPUs are meant to compete directly with the 5060 Ti — XT is AMD's version of Ti, after all — but a price close to the RTX 5060 would theoretically push a lot of mid-range buyers towards the 9060 XT.\n\nBecause the Radeon announcement is expected so soon after NVIDIA's RTX 5060 launch date, I strongly recommend waiting to see what AMD has created, good or bad, before jumping on any new mid-range GPU."
  }
]