[
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Exec-Edge",
    "title": "Identity Strategy: Semperis CEO Mickey Bresman, Live at RSAC 2025",
    "description": "Tech Edge hosted a fireside chat on April 30 at RSAC 2025 in San Francisco with Mickey Bresman, Chief Executive Officer at Semperis. The in-person interview ...",
    "url": "https://finance.yahoo.com/news/identity-strategy-semperis-ceo-mickey-201514892.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/VBeEJcurRvX2rCN52zqdJw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Njk-/https://media.zenfs.com/en/exec_edge_220/7d6afa69fa127fc4a09a21d35ced005a",
    "publishedAt": "2025-05-08T20:15:14Z",
    "content": "Tech Edge hosted a fireside chat on April 30 at RSAC 2025 in San Francisco with Mickey Bresman, Chief Executive Officer at Semperis. The in-person interview was joined by Editor-at-Large Jarrett Bank… [+2931 chars]",
    "full_content": "Tech Edge hosted a fireside chat on April 30 at RSAC 2025 in San Francisco with Mickey Bresman, Chief Executive Officer at Semperis. The in-person interview was joined by Editor-at-Large Jarrett Banks and they discussed what’s next for the company after recently surpassing $100M ARR, the evolution of Semperis’ mission of putting identity at the center of cyber resilience strategy, among other topics.\n\nWatch the interview below:\n\nAbout Mickey Bresman\n\nMickey Bresman is CEO and co-founder of Semperis, a leading provider of enterprise, hybrid identity protection, threat research, and incident response services. Among the top three fastest-growing cybersecurity companies in the U.S., according to Inc. 5000, Semperis is widely recognized for offering the industry’s most comprehensive hybrid directory protection technology and services. Semperis recently surpassed $100M in annual recurring revenue, a milestone that fewer than one in every 1,000 venture-backed enterprise software companies achieves.\n\nThe company has been recognized by Deloitte’s Technology Fast 500, Inc’s Best Workplaces, and, recently, CRN’s 2025 Security 100 list. Its Purple Knight community tool, a free assessment solution designed to identify vulnerabilities in Microsoft Active Directory, Entra ID, and Okta, has been endorsed by leading cyber agencies from the Five Eyes Nation, including the NSA and CISA.\n\nBeginning his technical career in the Navy, Mickey’s comfort zone is on the front lines helping organizations thwart and respond to cyberattacks. The long-time cybersecurity expert and entrepreneur has an extensive track record of driving revenue growth and scaling organizations across the globe. Prior to founding Semperis, Mickey held the position of CTO at YouCC Technologies, a Microsoft Gold Partner integration company.\n\nAbout Semperis\n\nFor security teams charged with defending hybrid and multi-cloud environments, Semperis ensures the integrity and availability of critical enterprise directory services at every step in the cyber kill chain and cuts recovery time by 90%. Purpose-built for securing hybrid identity environments—including Active Directory, Entra ID, and Okta—Semperis‘ AI-powered technology protects over 100 million identities from cyberattacks, data breaches and operational errors. The world’s leading organizations trust Semperis to spot directory vulnerabilities, intercept cyberattacks in progress and quickly recover from ransomware and other data integrity emergencies.\n\nSemperis is headquartered in Hoboken, New Jersey, and operates internationally, with its research and development team distributed throughout the United States, Canada and Israel. Semperis hosts the award-winning Hybrid Identity Protection conference and podcast series (www.hipconf.com) and built the community hybrid Active Directory cyber defender tools, Purple Knight (www.semperis.com/purple-knight/) and Forest Druid. The company has received the highest level of industry accolades, recently named to Inc. Magazine’s list of best workplaces for 2024 and ranked the fastest-growing cybersecurity company in America by the Financial Times."
  },
  {
    "source": {
      "id": null,
      "name": "Betalist.com"
    },
    "author": "BetaList",
    "title": "Orbity – Collects evidence in minutes and repurposes it for all security audits",
    "description": null,
    "url": "https://betalist.com/startups/orbity?utm_campaign=startup-123973&utm_medium=atom&utm_source=newsfeed",
    "urlToImage": null,
    "publishedAt": "2025-05-09T10:00:00Z",
    "content": "Orbity is an automated compliance platform built for lean B2B SaaS companies. Connect AWS, Azure, GitHub, Okta, and Google Workspace in minutes, and Orbity streams live configurations, maps them to S… [+453 chars]",
    "full_content": "Orbity Collects evidence in minutes and repurposes it for all security audits\n\nOrbity Collects evidence in minutes and repurposes it for all security audits\n\nOrbity is an automated compliance platform built for lean B2B SaaS companies. Connect AWS, Azure, GitHub, Okta, and Google Workspace in minutes, and Orbity streams live configurations, maps them to SOC 2 controls, and continuously re‑uses the same evidence for HIPAA, ISO 27001, and PCI. A real‑time dashboard flags gaps, one‑click exports generate auditor‑ready reports, and a public trust badge accelerates enterprise sales. Designed for teams under 50 employees, Orbity replaces weeks of manual evidence gathering and costly consultants with an affordable subscription—join the private beta and keep shipping while we handle compliance."
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Ofer Klein, Forbes Councils Member, \n Ofer Klein, Forbes Councils Member\n https://www.forbes.com/councils/forbestechcouncil/people/oferklein/",
    "title": "What's Next In SaaS Security?",
    "description": "We only have to look as far as the last 12 months to see that SaaS environments have reached the breaking point of acceptable security exposure.",
    "url": "https://www.forbes.com/councils/forbestechcouncil/2025/05/07/whats-next-in-saas-security/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64959f01282610fa438daaa0/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-07T11:30:00Z",
    "content": "Ofer Klein is CEO and cofounder of Reco, creators of a full lifecycle SaaS security platform.\r\ngetty\r\nPicture this: Someone at your company downloads a content management system to assist with market… [+4837 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Okta (NASDAQ:OKTA) Now Covered by Analysts at Loop Capital",
    "description": "Analysts at Loop Capital began coverage on shares of Okta (NASDAQ:OKTA – Get Free Report) in a note issued to investors on Monday, MarketBeat.com reports. The brokerage set a “buy” rating and a $140.00 price target on the stock. Loop Capital’s price objective…",
    "url": "https://www.etfdailynews.com/2025/05/07/okta-nasdaqokta-now-covered-by-analysts-at-loop-capital/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/okta-inc-logo-1200x675.png?v=20240109091735&w=240&h=240&zc=2",
    "publishedAt": "2025-05-07T05:58:49Z",
    "content": "Analysts at Loop Capital began coverage on shares of Okta (NASDAQ:OKTA – Get Free Report) in a note issued to investors on Monday, MarketBeat.com reports. The brokerage set a “buy” rating and a $140.… [+5337 chars]",
    "full_content": "Analysts at Loop Capital began coverage on shares of Okta (NASDAQ:OKTA – Get Free Report) in a note issued to investors on Monday, MarketBeat.com reports. The brokerage set a “buy” rating and a $140.00 price target on the stock. Loop Capital’s price objective points to a potential upside of 19.59% from the stock’s previous close.\n\nSeveral other research firms also recently weighed in on OKTA. Wells Fargo & Company upped their price objective on shares of Okta from $95.00 to $100.00 and gave the stock an “equal weight” rating in a report on Tuesday, March 4th. DA Davidson raised shares of Okta from a “neutral” rating to a “buy” rating and raised their price target for the company from $90.00 to $125.00 in a research report on Tuesday, March 4th. Truist Financial lifted their price target on Okta from $92.00 to $100.00 and gave the company a “hold” rating in a research note on Tuesday, March 4th. Barclays increased their price objective on Okta from $105.00 to $115.00 and gave the stock an “equal weight” rating in a research note on Tuesday, March 4th. Finally, The Goldman Sachs Group upped their price target on Okta from $107.00 to $123.00 and gave the stock a “buy” rating in a report on Tuesday, March 4th. One research analyst has rated the stock with a sell rating, thirteen have given a hold rating, twenty have given a buy rating and two have issued a strong buy rating to the company. Based on data from MarketBeat, Okta currently has an average rating of “Moderate Buy” and an average target price of $116.80.\n\nGet Okta alerts:\n\nRead Our Latest Stock Report on OKTA\n\nOkta Trading Up 1.2 %\n\nInsider Buying and Selling\n\nNASDAQ OKTA opened at $117.07 on Monday. The company has a quick ratio of 1.34, a current ratio of 1.34 and a debt-to-equity ratio of 0.06. Okta has a 52 week low of $70.56 and a 52 week high of $118.14. The business has a 50 day moving average price of $105.28 and a 200-day moving average price of $91.24. The company has a market cap of $20.32 billion, a price-to-earnings ratio of -334.49, a P/E/G ratio of 6.42 and a beta of 0.96.\n\nIn other news, CRO Jonathan James Addison sold 7,005 shares of the stock in a transaction dated Friday, April 11th. The shares were sold at an average price of $101.19, for a total value of $708,835.95. Following the sale, the executive now directly owns 19,067 shares of the company’s stock, valued at approximately $1,929,389.73. This represents a 26.87 % decrease in their ownership of the stock. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website. Also, insider Larissa Schwartz sold 2,740 shares of the firm’s stock in a transaction that occurred on Tuesday, February 11th. The shares were sold at an average price of $97.59, for a total transaction of $267,396.60. Following the completion of the transaction, the insider now owns 22,125 shares of the company’s stock, valued at $2,159,178.75. This trade represents a 11.02 % decrease in their ownership of the stock. The disclosure for this sale can be found here. In the last ninety days, insiders sold 157,192 shares of company stock valued at $16,614,756. Company insiders own 7.00% of the company’s stock.\n\nInstitutional Trading of Okta\n\nSeveral institutional investors and hedge funds have recently bought and sold shares of the company. SBI Securities Co. Ltd. purchased a new stake in shares of Okta in the fourth quarter worth $1,686,000. Nordea Investment Management AB raised its holdings in shares of Okta by 1,150.2% in the 4th quarter. Nordea Investment Management AB now owns 415,418 shares of the company’s stock valued at $33,146,000 after acquiring an additional 382,190 shares in the last quarter. Charles Schwab Investment Management Inc. boosted its position in shares of Okta by 4.3% during the 4th quarter. Charles Schwab Investment Management Inc. now owns 1,115,516 shares of the company’s stock valued at $87,903,000 after acquiring an additional 46,064 shares during the last quarter. Tower Research Capital LLC TRC grew its holdings in shares of Okta by 46.3% during the fourth quarter. Tower Research Capital LLC TRC now owns 10,833 shares of the company’s stock worth $854,000 after purchasing an additional 3,429 shares in the last quarter. Finally, Westpac Banking Corp increased its position in shares of Okta by 2,574.9% in the fourth quarter. Westpac Banking Corp now owns 9,817 shares of the company’s stock worth $774,000 after purchasing an additional 9,450 shares during the last quarter. 86.64% of the stock is currently owned by hedge funds and other institutional investors.\n\nAbout Okta\n\n(Get Free Report)\n\nOkta, Inc operates as an identity partner in the United States and internationally. The company offers Okta's suite of products and services used to manage and secure identities, such as Single Sign-On that enables users to access applications in the cloud or on-premises from various devices; Adaptive Multi-Factor Authentication provides a layer of security for cloud, mobile, web applications, and data; API Access Management enables organizations to secure APIs; Access Gateway enables organizations to extend Workforce Identity Cloud; and Okta Device Access enables end users to securely log in to devices with Okta credentials.\n\nFeatured Articles\n\nReceive News & Ratings for Okta Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Okta and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "Pypi.org"
    },
    "author": null,
    "title": "pulumi-okta 4.19.0a1746771698",
    "description": "A Pulumi package for creating and managing okta resources.",
    "url": "https://pypi.org/project/pulumi-okta/4.19.0a1746771698/",
    "urlToImage": null,
    "publishedAt": "2025-05-09T06:30:44Z",
    "content": "A required part of this site couldnt load. This may be due to a browser\r\n extension, network issues, or browser settings. Please check your\r\n connection, disable any ad blockers, or try using a diffe… [+12 chars]",
    "full_content": "JavaScript is disabled in your browser. Please enable JavaScript to proceed.\n\nA required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser."
  },
  {
    "source": {
      "id": null,
      "name": "Pypi.org"
    },
    "author": null,
    "title": "pulumi-okta 4.19.0a1746734672",
    "description": "A Pulumi package for creating and managing okta resources.",
    "url": "https://pypi.org/project/pulumi-okta/4.19.0a1746734672/",
    "urlToImage": null,
    "publishedAt": "2025-05-08T20:16:28Z",
    "content": "A required part of this site couldnt load. This may be due to a browser\r\n extension, network issues, or browser settings. Please check your\r\n connection, disable any ad blockers, or try using a diffe… [+12 chars]",
    "full_content": "JavaScript is disabled in your browser. Please enable JavaScript to proceed.\n\nA required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser."
  },
  {
    "source": {
      "id": null,
      "name": "Saastr.com"
    },
    "author": "Jason Lemkin",
    "title": "Meet 700+ VCs at SaaStr 2025 THIS WEEK!",
    "description": "So far for SaaStr + AI Summit 2025, May 13-15, we have 711 VCs coming from 298 unique VC firms.  A lot of VCs register … a bit late … so we should hit almost 800 by the time SaaStr 2025 is in full swing. Some of the notable VC firms on the list include... Con…",
    "url": "https://www.saastr.com/700-vcs-at-saastr-2025-this-week/",
    "urlToImage": null,
    "publishedAt": "2025-05-11T20:22:05Z",
    "content": "So far for SaaStr + AI Summit 2025, May 13-15, we have 711 VCs coming from 298 unique VC firms.  A lot of VCs register … a bit late … so we should hit almost 800 by the time SaaStr 2025 is in full sw… [+6078 chars]",
    "full_content": "Meet 700+ VCs at SaaStr 2025 THIS WEEK!\n\nSo far for SaaStr + AI Summit 2025, May 13-15, we have 711 VCs coming from 298 unique VC firms. A lot of VCs register … a bit late … so we should hit almost 800 by the time SaaStr 2025 is in full swing.\n\nSome of the notable VC firms on the list include Accel, A16Z, Base10 Partners, Emergence Capital, ICONIQ Growth, Innovation Endeavors, Mayfield, Redpoint Ventures, and Softbank, among many others.\n\nA partial list:\n\nA16Z\n\nAbyro Capital\n\nAccel\n\nAccolade Partners\n\nActivant Capital\n\nAfore Capital\n\nAircover Communications\n\nAllied Advisers\n\nAllocate\n\nAlpha Square Group\n\nAlpharank\n\nAltair Capital\n\nAres Management\n\nAsia2G Capital\n\nAvatar Growth Capital\n\nAzuro Capital\n\nBackbone Ventures\n\nBADideas.fund\n\nBase10 Partners\n\nBCI\n\nBhansali Partners\n\nBlack Mangroves\n\nBlume Ventures\n\nBonfire Ventures\n\nBoreal Ventures\n\nATLAS Global Ventures\n\nCambridge Associates\n\nCascade Seed Fund\n\nCendana Capital\n\nCF Private Equity/Commonfund\n\nChemistry\n\nCollaborative Fund\n\nComma Capital\n\nCoral Capital\n\nCox Enterprises\n\nCraft Ventures\n\nDallas Venture Capital\n\nDefy VC\n\nDiagram Collective\n\nEfficient Capital Labs\n\nElephant Ventures\n\nElevation Capital\n\nEmergence Capital\n\nExec Functions\n\nFin Capital\n\nFive Elms Capital\n\nFlywheel Advisors\n\nFounders Circle Capital\n\nGEX Ventures\n\nGlobis Capital Partners\n\nGlory Sky Capital\n\nGlynn Capital\n\nGood Human Partners\n\nGravity Advisors\n\nGTMfund\n\nGumshoe Ventures\n\nGyanara Advisor & Ventures\n\nHighland Europe\n\nHopeVentures\n\nHypergrowth Partners\n\nI2BF Global Ventures\n\nICONIQ Growth\n\nIDC Ventures\n\nBlack Ops Capital\n\nInnovation Endeavors\n\nInvestor Flow\n\nInvus\n\niSeed Ventures\n\nJanuary Capital\n\nJavelin\n\nJolly VC\n\nJump Capital\n\nKerala Ventures\n\nKimberlite Partners\n\nKing-Alpha\n\nLAGO Innovation\n\nLeft Lane\n\nLevel Equity\n\nLeverage VC\n\nLTS Growth\n\nMaple Leaf Angels\n\nMayfield\n\nMir Meridian\n\nMosaic Capital\n\nMoses Capital\n\nMoxon Capital\n\nMudita Venture Partners\n\nMultiples\n\nMXV Capital\n\nNew Capacity Partners\n\nNew Heritage Investments\n\nNinja Capital\n\nOak Capital\n\nOkta Ventures\n\nOlive Tech Ventures\n\nOSS Ventures\n\nOutcomes Fund\n\nPalmarium AI\n\nPanache Ventures\n\nPartinc Capital\n\nPax Momentum\n\nPear VC\n\nPerformance Equity Management\n\nPictet\n\nTransparent Collective\n\nPitango Growth\n\nPivotal LLC\n\nPlain Sight Capital\n\nPotenza Capital\n\nPowerhouse Ventures\n\nPresidio Ventures\n\nPrimary Venture Partners\n\nPSG Equity\n\nRakuten Ventures\n\nRedpoint Ventures\n\nReformation Partners\n\nREV Venture Partners\n\nRevTek Capital\n\nRight Side Capital\n\nRTP Global\n\nSaaS Ventures\n\nSaaStr Fund\n\nSandrine Capital\n\nSapphire Ventures\n\nScale Management Group\n\nSeventh Street Ventures\n\nSixth Street Partners\n\nSoftbank\n\nSony Ventures\n\nSorin Investments\n\nSSS Ventures\n\nStafford Capital Partners\n\nStage 2 Capital\n\nStartX\n\nStellaris Venture Partners\n\nTech Labs Capital\n\nTechne Infinity Ventures\n\nTekVentures\n\nTelegraph Hill Advisors\n\nTelescope Partners\n\nTH Global Capital\n\nTheory Ventures\n\nThreshold Ventures\n\nTidemark\n\nHow do you scale to $3B and, more importantly, dominate a space in Vertical SaaS? A deep dive with @jack_newton CEO + Founder @goclio – Cloud-Based Legal Technology + @davelyuan Wednesday, May 14th | AI Stage\n\n12 – 12:30pm PST Plus, the Tidemark team will be onsite and… pic.twitter.com/Em3yQtUogV — Jason ✨👾SaaStr 2025 is May 13-15✨ Lemkin (@jasonlk) May 10, 2025\n\nTranslink Capital\n\nTruco Ventures\n\nUpdata Partners\n\nUprise\n\nVendep Capital\n\nVesey Ventures\n\nVolition Capital\n\nWelight Capital\n\nWestCap\n\nWing Venture Capital\n\nWTIC\n\nFog Ventures\n\nJefferies\n\nBain & Company\n\nJapan VC\n\nTranspose Platform\n\nMudita Venture Partners\n\nTechne Infinity Ventures\n\nFLG Partners\n\n+ many more!!\n\nHow to Meet VCs at SaaStr Annual 2025\n\n#1. Leverage the Meet-a-VC Program\n\nThe Meet-a-VC program is a cornerstone of SaaStr Annual. It’s designed to connect founders with VCs actively looking for investments. To participate, founders must submit their pitch decks, growth metrics, and funding details. This program ensures that VCs review your startup profile before the event, increasing your chances of securing a meeting. Remember, VCs are selective, so your metrics and pitch need to stand out.\n\n#2. Attend the Founder-VC Brunch\n\nThe Founder-VC Brunch on May 15th is an exclusive, invite-only event where founders and VCs can connect in a relaxed setting. This is one of the best opportunities to have meaningful conversations with multiple investors without the pressure of a formal pitch. It’s a must-attend for founders serious about fundraising.\n\n#3. Use the Who Do You Want to Meet Networking App Strategically\n\nSaaStr’s networking app allows you to research and connect with VCs attending the event. Be specific in your meeting requests—highlight why your startup aligns with their investment focus. Since you’re limited to two accepted meetings initially, prioritize VCs who are the best fit for your stage and sector. Tailored outreach is key here.\n\n#4. Take Meetings in the VC Lounge\n\nThe VC Lounge is a dedicated space for VCs to meet with founders and CEOs to network. It’s access-controlled, ensuring high-quality interactions. You need to be invited in by a VC, but it’s a great place to take 1-on-1 quiet meetings."
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "The LockBit ransomware site was breached, database dump was leaked online",
    "description": "Lockbit ransomware group has been compromised, attackers stole and leaked data contained in the backend infrastructure of their dark web site. Hackers compromised the dark web leak site of the LockBit ransomware gang and defaced it, posting a message and a li…",
    "url": "https://securityaffairs.com/177619/cyber-crime/the-lockbit-ransomware-site-was-breached-database-dump-was-leaked-online.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-14.png",
    "publishedAt": "2025-05-08T18:37:05Z",
    "content": "The LockBit ransomware site was breached, database dump was leaked online\r\n | Cisco fixed a critical flaw in its IOS XE Wireless Controller\r\n | U.S. CISA adds GoVision device flaws to its Known Explo… [+162589 chars]",
    "full_content": "The LockBit ransomware site was breached, database dump was leaked online\n\nPierluigi Paganini May 08, 2025 May 08, 2025\n\nLockbit ransomware group has been compromised, attackers stole and leaked data contained in the backend infrastructure of their dark web site.\n\nHackers compromised the dark web leak site of the LockBit ransomware gang and defaced it, posting a message and a link to the dump of the MySQL database of its backend affiliate panel.\n\n“Don’t do crime CRIME IS BAD xoxo from Prague,” reads the message published on the group dark web leak site.\n\nThe LockBit operator ‘LockBitSupp’ confirmed the data breach in a private conversation with the threat actor Rey, however, he said that no private keys were leaked or data lost.\n\nBleepingComputer analyzed the leaked database and reported that it has 20 tables, including BTC addresses, builds with target names, build configurations, 4,442 victim chat logs, and user data with plaintext passwords.\n\n“A ‘chats‘ table is very interesting as it contains 4,442 negotiation messages between the ransomware operation and victims from December 19th to April 29th.” states BleepingComputer.\n\nResearchers noticed that only 44 user accounts are associated with actual encryptor builds for LockBit affiliates, among which 30 were active at the moment of the dump.\n\nAs said, only 44 user accounts are associated with actual encryptor builds, among which 30 were actually active at the moment of the dump.\n\nThat's your number of active #LockBit affiliates by then. Now, who are they and how active were they? 🤔 pic.twitter.com/sYilI2BjXU — Valéry Rieß-Marchive | @valerymarchive.bsky.social (@ValeryMarchive) May 8, 2025\n\nThe Italian cyber security expert Emanuele De Lucia extracted the 60k+ addresses in the dump and argued that the presence of a large number of private keys, linked to specific build configurations or victims (via build_id) suggests these are the actual key data. This data could be critical for developing universal or victim-specific decryption tools.\n\n\n\nDe Lucia added that the chat logs show a significant range in the initial ransom amounts demanded (from $50,000 to at least $1,500,000). The ransomware gang demands are tailored based on the perceived value of the victim.\n\nThe top victim TLDs are:\n\n.et (Ethiopia)\n\n.co (Colombia)\n\n.jp (Japan)\n\n.br (Brazil)\n\n.tw (Taiwan)\n\n.ph (Philippines)\n\n.fr (France)\n\n“Finally, this is a rich source of operational and technical intelligence. Its contents enable a deeper understanding of the threat actor’s capabilities and methods (i.e. FortiVPN is reported as an initial access point) and infrastructures.” said De Luci\n\nThe attacker behind the breach is still unknown, but the defacement message matches a recent Everest ransomware hack, hinting at a possible link between the two defacements.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, Lockbit ransomware)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users",
    "description": "NSO Group must pay WhatsApp over $167M in damages for a 2019 hack targeting 1,400+ users, per U.S. jury ruling after a five-year legal battle. A U.S. jury ordered NSO Group to pay WhatsApp over $167M for using Pegasus spyware to target over 1,400 people, viol…",
    "url": "https://securityaffairs.com/177543/laws-and-regulations/nso-group-must-pay-whatsapp-over-167m-in-damages-for-attacks-on-its-users.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2021/12/NSOGroup.jpeg",
    "publishedAt": "2025-05-07T08:57:08Z",
    "content": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users\r\n | U.S. CISA adds FreeType flaw to its Known Exploited Vulnerabilities catalog\r\n | Samsung MagicINFO flaw exploited days af… [+162069 chars]",
    "full_content": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users\n\nPierluigi Paganini May 07, 2025 May 07, 2025\n\nNSO Group must pay WhatsApp over $167M in damages for a 2019 hack targeting 1,400+ users, per U.S. jury ruling after a five-year legal battle.\n\nA U.S. jury ordered NSO Group to pay WhatsApp over $167M for using Pegasus spyware to target over 1,400 people, violating U.S. laws. After a five-year legal battle, a jury ordered NSO Group to pay over $167 million in punitive and over $444,000 in compensatory damages.\n\n“The jury’s decision to force NSO to pay damages is a critical deterrent to this malicious industry against their illegal acts aimed at American companies and our users worldwide.” reads the post published by WhatsApp after the juty’s rule. “This trial also revealed that WhatsApp was far from NSO’s only target — this is an industry-wide threat and it’ll take all of us to defend against it.”\n\n“We will carefully examine the verdict’s details and pursue appropriate legal remedies, including further proceedings and an appeal,” said NSO Group’s spokesperson Gil Lainer.\n\nIn December, WhatsApp won a legal case against NSO Group in a U.S. court over exploiting a vulnerability to deliver Pegasus spyware. Will Cathcart of WhatsApp called the ruling a major privacy victory, emphasizing accountability for spyware firms after a five-year legal battle.\n\nCourt documents state that on October 29, 2019, plaintiffs filed this lawsuit, alleging that the defendants used WhatsApp to target approximately 1,400 mobile phones and devices to infect them with the surveillance software.\n\n“defendants’ relevant software products, collectively referred to as “Pegasus,” allow defendants’ clients to use a modified version of the Whatsapp application – referred to as the “Whatsapp Installation Server,” or “WIS. The WIS, among other things, allows defendants’ clients to send “cipher” files with “installation vectors” that ultimately allow the clients to surveil target users.” reads the court document. published “As mentioned above, plaintiffs allege that defendants’ conduct was a violation of the CFAA, the CDAFA, and a breach of contract.”\n\nThe U.S. court ruled that NSO Group repeatedly failed to produce key evidence, including Pegasus source code, and imposed sanctions, reserving harsher penalties for later.\n\nWhatsApp stated NSO only provided AWS server code, not the full codebase. Judge Hamilton criticized NSO’s non-compliance, citing concerns about transparency.\n\nThe court found NSO Group liable for breaching WhatsApp’s terms of service by using the platform for malicious purposes. WhatsApp hailed the decision as a victory for privacy.\n\nThe surveillance firm exploited a zero-day vulnerability, tracked as CVE-2019-3568 (CVSS score of 9.8), in the voice calling feature of the popular instant messaging app.\n\nNSO Group continued using WhatsApp exploits, including spyware called “Erised,” even after being sued for violating anti-hacking laws. The experts detected three exploits, called “Heaven,” “Eden,” and “Erised”, that were employed in over 1,400 attacks attributed to NSO Group.\n\n“Even after WhatsApp detected and blocked the exploit described in the Complaint in May 2019, NSO admits that it developed yet another installation vector (known as Erised) that also used WhatsApp servers to install Pegasus.2 NSO continued to use and make Erised available to customers even after this litigation had been filed, until changes to WhatsApp blocked its access sometime after May 2020. NSO’s witnesses have refused to answer whether it developed further WhatsApp-based Malware Vectors thereafter.” continues the court filing. “All of these facts are undisputed, drawn principally from the corporate representative testimony of NSO’s own witnesses, which is binding on Defendants.”\n\nIn May 2019, Facebook patched a critical zero-day vulnerability in WhatsApp, tracked as CVE-2019-3568, that has been exploited to remotely install spyware on phones by calling the targeted device.\n\nAt the time, The Financial Times reported that the WhatsApp zero-day was exploited by threat actors to deliver the spyware developed by surveillance firm NSO Group.\n\nThe surveillance software developed by NSO Group was used by government organizations worldwide to spy on human rights groups, activists, journalists, lawyers, and dissidents. Security experts have detected and analyzed some of the tools in its arsenal, such as the popular Pegasus spyware (for iOS) and Chrysaor (for Android).\n\nIn March 2024, Meta won the litigation against the Israeli spyware vendor, a U.S. Judge ordered the surveillance firm to hand over the source code for its Pegasus spyware and other products to the social network giant.\n\nNSO Group has been requested to provide details regarding the complete functionality of the pertinent spyware, covering the period one year before the alleged attack through one year after the alleged attack (i.e., from April 29, 2018, to May 10, 2020).\n\nCourt documents filed in November revealed that NSO Group had minimal control over customers’ use of its spyware, contradicting prior claims by the Israeli firm.\n\nContrary to NSO’s claims, the filing suggests the spyware vendor operated its Pegasus system, with customers only needing to provide a target number. NSO disputes these allegations, asserting its clients solely operate the system.\n\n“[NSO Group] stands behind its previous statements in which we repeatedly detailed that the system is operated solely by our clients and that neither NSO nor its employees have access to the intelligence gathered by the system.” said Gil Lanier, vice president of global communications for the Israeli firm.\n\nMeta pointed out that the trial exposed how NSO Group’s Pegasus spyware secretly compromises phones, accessing data, mic, and camera. It targets more than WhatsApp, using various exploits, messaging apps, browsers, OS, to install malware on both iOS and Android. NSO admitted spending tens of millions annually to maintain and develop these covert surveillance tools.\n\n“This trial also revealed that WhatsApp was far from NSO’s only target. While we stopped the attack vector that exploited our calling system in 2019, Pegasus has had many other spyware installation methods to exploit other companies’ technologies to manipulate people’s devices into downloading malicious code and compromising their phones.” reads the statement published by Meta. “NSO was forced to admit that it spends tens of millions of dollars annually to develop malware installation methods including through instant messaging, browsers, and operating systems, and that its spyware is capable of compromising iOS or Android devices to this day.”\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, NSO group)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "A cyber attack briefly disrupted South African Airways operations",
    "description": "A cyberattack briefly disrupted South African Airways’ website, app, and systems, but core flight operations remained unaffected. South African Airways (SAA) is the national flag carrier of South Africa, the airline is wholly owned by the South African govern…",
    "url": "https://securityaffairs.com/177656/hacking/a-cyber-attack-briefly-disrupted-south-african-airways-operations.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-15.png",
    "publishedAt": "2025-05-09T18:21:13Z",
    "content": "A cyber attack briefly disrupted South African Airways operations\r\n | Cybercriminal services target end-of-life routers, FBI warns\r\n | Russia-linked ColdRiver used LostKeys malware in recent attacks\r… [+162874 chars]",
    "full_content": "A cyber attack briefly disrupted South African Airways operations\n\nPierluigi Paganini May 09, 2025 May 09, 2025\n\nA cyberattack briefly disrupted South African Airways’ website, app, and systems, but core flight operations remained unaffected.\n\nSouth African Airways (SAA) is the national flag carrier of South Africa, the airline is wholly owned by the South African government and has subsidiaries including SAA Technical and Air Chefs.\n\nA cyberattack hit South African Airways, briefly disrupting its website, app, and systems. The IT team contained the incident and “minimized disruption to core flight operations.”\n\n“6 May 2025 – South African Airways (SAA) announced today that it has been impacted by a significant cyber incident that began on Saturday, 3 May 2025. The breach temporarily disrupted access to the airline’s website, mobile application, and several internal operational systems, prompting swift response measures to mitigate its effects.” reads the press release published by the company on its website.\n\nSAA activated disaster and continuity protocols immediately, it was able to resume all the impacted systems the same day.\n\nSAA is investigating the incident with the help of independent digital forensic experts to determine the root cause and full scope of the security breach. The company reported the incident to national authorities, including the State Security Agency (SSA), South African Police Service (SAPS) for criminal investigation and notified the Information Regulator of South Africa as a precautionary measure under the Protection of Personal Information Act (POPIA).\n\nThe company did not share technical details about the cyber attack.\n\n“The security and integrity of our business systems and the protection of the consumer data entrusted to us remain our highest priority. In response to the cyber incident that began on May 3rd, we acted swiftly to contain the disruption, restore services, and initiate a comprehensive investigation. Our robust business continuity measures ensured operational stability, particularly for our valued customers.” said Prof. John Lamola, Group CEO of South African Airways. “I want to assure all stakeholders, including our partners, customers, and dedicated employees, that we are taking every necessary step to determine the root cause of this incident, strengthen our security framework, and mitigate any potential risks. SAA remains committed to delivering safe, reliable, and resilient service.”\n\nIn April 2025, the South African multinational telecommunications company MTN Group Limited disclosed a data breach that exposed subscribers’ personal information, it added that the incident did not impact the core network, billing systems and financial services infrastructure.\n\nIn April, Cell C is the fourth-largest mobile network operator in South Africa, confirmed a data breach following a RansomHouse cyberattack that occurred last year. The ransomware group has since leaked the stolen data on its dark web leak site. The gang claimed the theft of 2 TB of data. Compromised data includes full names, contact details, ID numbers, banking information, driver’s license numbers, medical records and passport details.\n\nIn March 2025, Astral Foods, South Africa’s largest poultry producer, lost over $1M due to a cyberattack disrupting deliveries and impacting operations.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, South African Airways)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Google fixed actively exploited Android flaw CVE-2025-27363",
    "description": "Google addressed 46 Android security vulnerabilities, including one issue that has been exploited in attacks in the wild. Google’s monthly security updates for Android addressed 46 flaws, including a high-severity vulnerability, tracked as CVE-2025-27363 (CVS…",
    "url": "https://securityaffairs.com/177514/mobile-2/google-fixed-actively-exploited-android-flaw-cve-2025-27363.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2022/02/Android-security.png",
    "publishedAt": "2025-05-06T10:23:57Z",
    "content": "Google fixed actively exploited Android flaw CVE-2025-27363\r\n | New 'Bring Your Own Installer (BYOI)' technique allows to bypass EDR\r\n | Smishing on a Massive Scale: Panda Shop Chinese Carding Syndic… [+161670 chars]",
    "full_content": "Google fixed actively exploited Android flaw CVE-2025-27363\n\nPierluigi Paganini May 06, 2025 May 06, 2025\n\nGoogle addressed 46 Android security vulnerabilities, including one issue that has been exploited in attacks in the wild.\n\nGoogle’s monthly security updates for Android addressed 46 flaws, including a high-severity vulnerability, tracked as CVE-2025-27363 (CVSS score of 8.1), that has been exploited in the wild.\n\nThe company did not disclose any details regarding the attacks or the threat actors exploiting the vulnerability.\n\nThe vulnerability resides in the System component, and successful exploitation could lead to local code execution.\n\n“The most severe of these issues is a high security vulnerability in the System component that could lead to local code execution with no additional execution privileges needed. User interaction is not needed for exploitation.” reads the Android Security Bulletin—May 2025.\n\n“There are indications that CVE-2025-27363 may be under limited, targeted exploitation.”\n\nIn mid-March, Meta warned that an out-of-bounds write vulnerability, tracked as CVE-2025-27363 in the FreeType library, may have been actively exploited in attacks.\n\n“An out of bounds write exists in FreeType versions 2.13.0 and below when attempting to parse font subglyph structures related to TrueType GX and variable font files.” reads the advisory published by Meta. “The vulnerable code assigns a signed short value to an unsigned long and then adds a static value causing it to wrap around and allocate too small of a heap buffer. The code then writes up to 6 signed long integers out of bounds relative to this buffer. This may result in arbitrary code execution.”\n\nThe company did not disclose details on the attacks exploiting this vulnerability, attackers, or attack scale.\n\n“This vulnerability may have been exploited in the wild.” continues the advisory.\n\nThe vulnerability doesn’t impact FreeType versions after 2.13.0.\n\nThe experts warn that multiple Linux distributions are using an outdated library version, making them vulnerable to attacks.\n\n“Exploitation for many issues on Android is made more difficult by enhancements in newer versions of the Android platform. We encourage all users to update to the latest version of Android where possible.” concludes the Google’s Bulletin.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini (SecurityAffairs – hacking, Android)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Smishing on a Massive Scale: ‘Panda Shop’ Chinese Carding Syndicate",
    "description": "Resecurity found a new smishing kit called ‘Panda Shop,’ mimicking Smishing Triad tactics with improved features and new templates. Resecurity (USA) was the first company to identify the Smishing Triad, a group of Chinese cybercriminals targeting consumers ac…",
    "url": "https://securityaffairs.com/177502/cyber-crime/smishing-on-a-massive-scale-panda-shop-chinese-carding-syndicate.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/panda.jpg",
    "publishedAt": "2025-05-06T06:30:10Z",
    "content": "Smishing on a Massive Scale: Panda Shop Chinese Carding Syndicate\r\n | Kelly Benefits December data breach impacted over 400,000 individuals\r\n | A hacker stole data from TeleMessage, the firm that sel… [+161533 chars]",
    "full_content": "Smishing on a Massive Scale: ‘Panda Shop’ Chinese Carding Syndicate\n\nPierluigi Paganini May 06, 2025 May 06, 2025\n\nResecurity found a new smishing kit called ‘Panda Shop,’ mimicking Smishing Triad tactics with improved features and new templates.\n\nResecurity (USA) was the first company to identify the Smishing Triad, a group of Chinese cybercriminals targeting consumers across the globe. In August 2023, our team was able to identify their activity and locate the smishing kit they were using, successfully exploiting a vulnerability, which exposed the threat actors and their infrastructure. Since then, the group has become stealthier and upgraded its tooling, tactics, and procedures (TTPs). A group of this scale is not limited to just one threat actor; it has numerous associates with different roles, blurring its public profile. Such groups leverage a “Crime-as-a-Service” model, enabling other cybercriminals to use their smishing kit and scale operations targeting consumers in different countries.\n\n\n\nResecurity identified a new smishing kit known as ‘Panda Shop,’ based on the same principles used by the Smishing Triad. The kit’s structure and scripting scenarios analyzed by Resecurity mimic the same product but include specific improvements and new supported templates. We identified multiple actors leveraging the Panda Shop smishing kit for Google Wallet and Apple Pay, harvesting traditional credit card and PII data, and intercepting transactions.\n\n\n\nThe investigators noted that, besides Google RCS and Apple iMessage being used as the primary smishing delivery methods, the group also uses SMS gateways, specialized equipment for network operators. Telemarketing companies also use similar devices to send messages to mobile subscribers for legitimate purposes, which appears to be misused by Chinese cybercriminals in combination with other methods.\n\n\n\nAccording to the latest chatter, one identified threat actor can send up to 2,000,000 smishing messages daily. The negative aspect of this is that cybercriminals have everything needed for this, which may mean that the Smishing Triad and similar groups could easily target up to 60,000,000 victims per month, or 720,000,000 per year, enough to target every person in the US at least twice every year.\n\n\n\nThe scale of global smishing activity generated by Chinese cybercriminals is impressive. The spectrum of the crimes conducted due to smishing ranges from traditional carding and NFC-enabled fraud to money laundering chains, enabling fraudsters to process stolen funds. Based on Resecurity’s engagements with financial institutions globally, this activity generates millions in losses annually.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, Panda Shop)\n\n\n\n"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Samsung MagicINFO flaw exploited days after PoC exploit publication",
    "description": "Threat actors started exploiting a vulnerability in Samsung MagicINFO only days after a PoC exploit was published. Arctic Wolf researchers observed threat actors beginning to exploit a high-severity vulnerability, tracked as CVE-2024-7399 (CVSS score: 8.8), i…",
    "url": "https://securityaffairs.com/177529/hacking/samsung-magicinfo-vulnerability-exploited-after-poc-publication.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2022/09/Samsung-logo.jpg",
    "publishedAt": "2025-05-06T17:54:39Z",
    "content": "Samsung MagicINFO flaw exploited days after PoC exploit publication\r\n | Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324\r\n | U.S. CISA adds Langflow flaw to its Kno… [+161910 chars]",
    "full_content": "Samsung MagicINFO flaw exploited days after PoC exploit publication\n\nPierluigi Paganini May 06, 2025 May 06, 2025\n\nThreat actors started exploiting a vulnerability in Samsung MagicINFO only days after a PoC exploit was published.\n\nArctic Wolf researchers observed threat actors beginning to exploit a high-severity vulnerability, tracked as CVE-2024-7399 (CVSS score: 8.8), in the Samsung MagicINFO content management system (CMS) just days after proof-of-concept (PoC) exploit code was publicly released.\n\nThe vulnerability is an improper limitation of a pathname to a restricted directory vulnerability in Samsung MagicINFO 9 Server version before 21.1050, an attacker can exploit the flaw to write arbitrary file as system authority.\n\n“As of early May 2025, Arctic Wolf has observed exploitation in the wild of CVE-2024-7399 in Samsung MagicINFO 9 Server—a content management system (CMS) used to manage and remotely control digital signage displays.” reads the report published by Arctic Wolf. “The vulnerability allows for arbitrary file writing by unauthenticated users, and may ultimately lead to remote code execution when the vulnerability is used to write specially crafted JavaServer Pages (JSP) files.”\n\nCVE-2024-7399 is a flaw in Samsung MagicINFO 9 Server’s input validation, it allows unauthenticated attackers to upload JSP files and execute code with system-level access.\n\nSamsung first disclosed the flaw in August 2024, and at the time, there were no signs of it being exploited. However, just days after a proof-of-concept (PoC) was published on April 30, 2025, threat actors began taking advantage of it. Given how easy it is to exploit, and the public availability of the PoC, experts believe that the attacks are likely to continue.\n\nSamsung addressed the vulnerability with the release of MagicINFO 9 Server version 21.1050 in August 2024.\n\n“Given the low barrier to exploitation and the availability of a public PoC, threat actors are likely to continue targeting this vulnerability.” concludes the report. “Arctic Wolf will continue to monitor for malicious post-compromise activities related to this vulnerability, and will alert Managed Detection and Response customers as required when malicious activities are observed. “\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, Samsung MagicINFO)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code",
    "description": "SonicWall addressed three SMA 100 flaws, including a potential zero-day, that could allow remote code execution if chained. SonicWall patches three SMA 100 vulnerabilities (CVE-2025-32819, CVE-2025-32820, and CVE-2025-32821), including a potential zero-day, t…",
    "url": "https://securityaffairs.com/177626/hacking/sonicwall-fixed-sma-100-flaws-that-could-be-chained-to-execute-arbitrary-code.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2020/10/SonicWall.png",
    "publishedAt": "2025-05-09T07:50:45Z",
    "content": "Russia-linked ColdRiver used LostKeys malware in recent attacks\r\n | SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code\r\n | The LockBit ransomware site was breached, databas… [+162739 chars]",
    "full_content": "SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code\n\nPierluigi Paganini May 09, 2025 May 09, 2025\n\nSonicWall addressed three SMA 100 flaws, including a potential zero-day, that could allow remote code execution if chained.\n\nSonicWall patches three SMA 100 vulnerabilities (CVE-2025-32819, CVE-2025-32820, and CVE-2025-32821), including a potential zero-day, that could be chained by a remote attacker to execute arbitrary code.\n\nThe first flaw, tracked as CVE-2025-32819 (CVSS score of 8.8), is a Post-Authentication SSLVPN user arbitrary file delete vulnerability.\n\n“A vulnerability in SMA100 allows a remote authenticated attacker with SSLVPN user privileges to bypass the path traversal checks and delete an arbitrary file potentially resulting in a reboot to factory default settings.” reads the advisory.\n\nThe second vulnerability, tracked as CVE-2025-32820 (CVSS score of 8.3), is a Post-Authentication SSLVPN user Path Traversal issue. An authenticated remote attacker can use path traversal via SSLVPN to make any directory on the SMA appliance writable.\n\nThe third flaw, tracked as CVE-2025-32821 (CVSS score of 6.7), is a Post-Authentication SSLVPN admin remote command injection vulnerability.\n\n“A vulnerability in SMA100 allows a remote authenticated attacker with SSLVPN admin privileges can with admin privileges can inject shell command arguments to upload a file on the appliance.” states the advisory.\n\nRapid7 researchers discovered the vulnerabilities in April of 2025. The researchers states that an attacker with SSLVPN access can chain the three flaws to gain admin rights, write to system directories, and achieve root-level RCE. Fixed in version 10.2.1.15-81sv.\n\n“An attacker with access to an SMA SSLVPN user account can chain these vulnerabilities to make a sensitive system directory writable, elevate their privileges to SMA administrator, and write an executable file to a system directory.” reads the report published by Rapid7. “This chain results in root-level remote code execution. These vulnerabilities have been fixed in version 10.2.1.15-81sv.”\n\nResearchers demonstrated a full exploit chain on SonicWall SMA using the three flaws. Starting from a low-privilege session cookie, they reset the admin password by deleting a database file, made /bin writable, and executed a reverse shell payload to achieve root-level remote code execution.\n\nRapid7 researchers believe that this vulnerability may have been exploited in attacks in the wild.\n\n“Based on known (private) IOCs and Rapid7 incident response investigations, we believe this vulnerability may have been used in the wild,” Rapid7 says.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, SonicWall SMA)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Security Affairs newsletter Round 523 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Ascension reve…",
    "url": "https://securityaffairs.com/177689/breaking-news/security-affairs-newsletter-round-523-by-pierluigi-paganini-international-edition.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/03/newsletter.png",
    "publishedAt": "2025-05-11T18:02:14Z",
    "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 45\r\n | Security Affairs newsletter Round 523 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | Ascension reveals personal data of 437,329 patients exposed in c… [+163186 chars]",
    "full_content": "We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent."
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Canary Exploit tool allows to find servers affected by Apache Parquet flaw",
    "description": "F5 Labs researchers released a PoC tool to find servers vulnerable to the Apache Parquet vulnerability CVE-2025-30065. A working proof-of-concept exploit for the critical Apache Parquet vulnerability CVE-2025-30065 has been released by F5 Labs, allowing the i…",
    "url": "https://securityaffairs.com/177565/security/canary-exploit-tool-allows-to-find-servers-affected-by-apache-parquet-flaw.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/04/image-7.png",
    "publishedAt": "2025-05-07T14:08:37Z",
    "content": "Canary Exploit tool allows to find servers affected by Apache Parquet flaw\r\n | Unsophisticated cyber actors are targeting the U.S. Energy sector\r\n | NSO Group must pay WhatsApp over $167M in damages … [+162218 chars]",
    "full_content": "Canary Exploit tool allows to find servers affected by Apache Parquet flaw\n\nPierluigi Paganini May 07, 2025 May 07, 2025\n\nF5 Labs researchers released a PoC tool to find servers vulnerable to the Apache Parquet vulnerability CVE-2025-30065.\n\nA working proof-of-concept exploit for the critical Apache Parquet vulnerability CVE-2025-30065 has been released by F5 Labs, allowing the identification of vulnerable servers.\n\nThe tool, called “canary exploit,” is available on the security firm’s GitHub repository.\n\nApache Parquet’s Java Library is a software library for reading and writing Parquet files in the Java programming language. Parquet is a columnar storage file format that is optimized for use with large-scale data processing frameworks, such as Apache Hadoop, Apache Spark, and Apache Drill.\n\nIn April 2025, experts disclosed a critical vulnerability, tracked as CVE-2025-30065 (CVSS score of 10.0), impacting Apache Parquet’s Java Library that could allow remote code execution\n\n“Schema parsing in the parquet-avro module of Apache Parquet 1.15.0 and previous versions allows bad actors to execute arbitrary code” reads the advisory.\n\nThe vulnerability CVE-2025-30065 is a Deserialization of Untrusted Data issue. The flaw affects systems importing Parquet files, especially from untrusted sources, and can be exploited by attackers tampering with the files. Versions 1.15.0 and earlier are vulnerable, with the flaw traced back to version 1.8.0. This impacts big-data frameworks (e.g., Hadoop, Spark, Flink) and custom applications using Parquet. Users should verify their software stack for this issue.\n\n“If an attacker tricks a vulnerable system into reading a specially crafted Parquet file, they could gain remote code execution (RCE) on that system​.” reads a report published by Endor Labs. “In practice, this might allow them to:\n\nTake control of the system: They could run any commands or software, effectively gaining control​.\n\nThey could run any commands or software, effectively gaining control​. Steal or tamper with data: Sensitive information could be accessed, copied, or modified.\n\nSensitive information could be accessed, copied, or modified. Install malware: The attacker might deploy ransomware, cryptominers, or other malicious software.\n\nThe attacker might deploy ransomware, cryptominers, or other malicious software. Disrupt services: They could shut down services or corrupt data, causing denial of service and business downtime.\n\n“All confidentiality, integrity, and availability of the affected system are at risk (in CVSS terms, “High” impact on all three)​. Despite the frightening potential, it’s important to note that the vulnerability can only be exploited if a malicious Parquet file is imported.”\n\nAccording to Endor Labs, as of April 2025, there are no known active exploits for this vulnerability. However, with the issue now public, threat actors may attempt to exploit it. The researchers urge users to address the issue immediately.\n\nTo protect your systems from CVE-2025-30065, upgrade Apache Parquet Java to version 1.15.1 or later. If that’s not possible, avoid or validate Parquet files from untrusted sources and implement input validation. Enable monitoring and logging to detect suspicious behavior, and stay informed on updates from Apache or cybersecurity authorities. Applying these actions will reduce risks and protect your systems.\n\nF5 Labs found that while CVE-2025-30065 isn’t a full RCE, it can trigger harmful side effects like network requests from a vulnerable server. The experts still believe that real-world exploitation of the flaw is difficult.\n\n“F5 Labs has created a tool that generates a parquet/avro file that will trigger object instantiation of a class that comes with Java (javax.swing.JEditorKit).1 Instantiating javax.swing.JEditorKit with a single String argument has the side effect of treating the String as a URL and making an HTTP GET request.” reads the report published by F5 Labs. “By registering a canary URL and using that as the target URL, our tool allows for easy testing of the vulnerability, as well as assurance it has been fixed by applying patches and proper configuration.”\n\nF5 Labs created the tool to help developers and security teams quickly assess if their systems are affected by critical flaws, reducing response time, especially in complex environments with hidden dependencies.\n\n“Various exploitation scenarios for this CVE are possible, but all require that a malicious Parquet/Avro file be placed into an environment which will use the Apache Parquet Avro module to parse it. If you use Apache Parquet Java to parse Parquet files that include embedded Avro, then you should investigate patching.” concludes the report. “Nevertheless, this is somewhat of a high bar for attackers. While Parquet and Avro are used widely, this issue requires a specific set of circumstances that isn’t all that likely in general. Even then, this CVE only allows attackers to trigger the instantiation of a Java object which then must have a side effect that is useful for the attacker. As noted above, this also seems somewhat unlikely to us.”\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, Apache Parquet)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324",
    "description": "Threat actors launch second wave of attacks on SAP NetWeaver, exploiting webshells from a recent zero-day vulnerability. In April, ReliaQuest researchers warned that a zero-day vulnerability, tracked as CVE-2025-31324 (CVSS score of 10/10), in SAP NetWeaver i…",
    "url": "https://securityaffairs.com/177522/hacking/experts-warn-of-a-second-wave-of-attacks-targeting-sap-netweaver-bug-cve-2025-31324.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/05/SAP-systems.gif",
    "publishedAt": "2025-05-06T13:55:46Z",
    "content": "Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324\r\n | U.S. CISA adds Langflow flaw to its Known Exploited Vulnerabilities catalog\r\n | Google fixed actively exploited… [+161838 chars]",
    "full_content": "Experts warn of a second wave of attacks targeting SAP NetWeaver bug CVE-2025-31324\n\nPierluigi Paganini May 06, 2025 May 06, 2025\n\nThreat actors launch second wave of attacks on SAP NetWeaver, exploiting webshells from a recent zero-day vulnerability.\n\nIn April, ReliaQuest researchers warned that a zero-day vulnerability, tracked as CVE-2025-31324 (CVSS score of 10/10), in SAP NetWeaver is potentially being exploited. Thousands of internet-facing applications are potentially at risk.\n\nThe flaw in SAP NetWeaver Visual Composer Metadata Uploader stems from a lack of proper authorization checks. This means that unauthenticated attackers, those without valid credentials, can exploit it to upload malicious executable files to the system.\n\nOnce uploaded, these files can be executed on the host system, potentially leading to a full compromise of the targeted SAP environment. SAP addressed the flaw with the release of the April 2025 Security Patch Day.\n\nResearchers from ReliaQuest discovered the vulnerability while investigating multiple attacks, some of which led to the compromise of fully patched systems.\n\nThe researchers pointed out that SAP systems are high-value targets for attackers due to their use by governments and enterprises. ReliaQuest reported the critical vulnerability to SAP, which led to a patch release. Before public disclosure, ReliaQuest deployed detection mechanisms and enhanced threat visibility to protect customers.\n\nAttackers exploited the Metadata Uploader to upload malicious JSP webshells using crafted POST requests, then executed them with GET requests to gain full control of the target systems. All webshells were deployed in the same root directory, had similar capabilities, and reused code from a public GitHub RCE project.\n\nAttackers exploited the servlet_jsp/irj/root/ path to plant JSP webshells, often named like “helper.jsp” or “cache.jsp,” enabling remote command execution. Attackers used the webshells to run system commands via GET requests, upload files, and maintain persistence. One variant used in one of the attacks relied on Brute Ratel and Heaven’s Gate to enhance stealth and control, signaling a sophisticated threat aimed at full system compromise and data theft.\n\nThe delayed follow-up after initial access suggests the attacker may be an initial access broker, likely selling access via VPN, RDP, or vulnerabilities on forums.\n\nThis week, Onapsis researchers observed a second wave of attacks tha same vulnerability.\n\n“As of May 5, 2025, Onapsis Research Labs and other security firms are seeing evidence of follow-up, opportunistic attackers using previously established webshells from the prior attack campaign in order to stage new attacks.” reads the report published by Onapsis.\n\nOnapsis, in collaboration with Mandiant, released an open-source scanner to detect exploitation attempts for CVE-2025-31324. It finds IoCs, scans for suspicious files, and collects them for analysis. On May 5, the company provided an updated YARA rule to improve the detection of webshell amid widespread exploitation\n\nAt the end of April, the US cybersecurity agency CISA added the vulnerability CVE-2025-31324 to its Known Exploited Vulnerabilities (KEV), ordering federal agencies to patch it by May 20, 2025.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, SAP NetWeaver)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Unsophisticated cyber actors are targeting the U.S. Energy sector",
    "description": "CISA, FBI, EPA, and DoE warn of cyberattacks on the U.S. Energy sector carried out by unsophisticated cyber actors targeting ICS/SCADA systems. The US cybersecurity agency CISA, the FBI, EPA, and the DoE issued a joint alert to warn of cyberattacks targeting …",
    "url": "https://securityaffairs.com/177551/security/unsophisticated-cyber-actors-are-targeting-the-u-s-energy-sector.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2014/11/energy-sector.jpg",
    "publishedAt": "2025-05-07T10:44:38Z",
    "content": "Unsophisticated cyber actors are targeting the U.S. Energy sector\r\n | NSO Group must pay WhatsApp over $167M in damages for attacks on its users\r\n | U.S. CISA adds FreeType flaw to its Known Exploite… [+162139 chars]",
    "full_content": "Unsophisticated cyber actors are targeting the U.S. Energy sector\n\nPierluigi Paganini May 07, 2025 May 07, 2025\n\nCISA, FBI, EPA, and DoE warn of cyberattacks on the U.S. Energy sector carried out by unsophisticated cyber actors targeting ICS/SCADA systems.\n\nThe US cybersecurity agency CISA, the FBI, EPA, and the DoE issued a joint alert to warn of cyberattacks targeting US-based organizations in the oil and natural gas sector.\n\nUnsophisticated threat actors are targeting ICS/SCADA systems in U.S. energy and transport sectors, exploiting poor cyber hygiene to cause major disruptions.\n\nThe researchers observed that attackers are using “basic and elementary intrusion techniques.”\n\n“CISA is increasingly aware of unsophisticated cyber actor(s) targeting ICS/SCADA systems within U.S. critical Infrastructure sectors (Oil and Natural Gas), specifically in Energy and Transportation Systems.” reads the alert. “Although these activities often include basic and elementary intrusion techniques, the presence of poor cyber hygiene and exposed assets can escalate these threats, leading to significant consequences such as defacement, configuration changes, operational disruptions and, in severe cases, physical damage. “\n\nThe US agencies urges Critical Infrastructure Asset Owners and Operators to review the fact sheet “Primary Mitigations to Reduce Cyber Threats to Operational Technology” to reduce the risk of potential intrusions.\n\nCritical infrastructure operators should: remove OT from public internet; change default passwords; secure remote access with VPN and MFA; segment IT/OT networks; and ensure manual OT operation capability. These steps help counter simple yet scalable OT cyber threats and reduce risks of disruptions, damage, and system compromise due to poor cyber hygiene and exposure.\n\nUS CISA warns that misconfigurations may be introduced during standard operations, by the system integrator, by a managed service provider, or as part of the default product configuration by the system manufacturer. Government experts recommend working with the relevant groups to address these issues to prevent the accidental introduction of vulnerabilities in critical infrastructure.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, U.S. Energy sector)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Russia-linked ColdRiver used LostKeys malware in recent attacks",
    "description": "Since early 2025, Russia-linked ColdRiver has used LostKeys malware to steal files in espionage attacks on Western governments and organizations. Google’s Threat Intelligence Group discovered LOSTKEYS, a new malware used by Russia-linked APT COLDRIVER, in rec…",
    "url": "https://securityaffairs.com/177638/apt/russia-linked-coldriver-used-lostkeys-malware-in-recent-attacks.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2025/05/image-13.png",
    "publishedAt": "2025-05-09T08:41:29Z",
    "content": "Russia-linked ColdRiver used LostKeys malware in recent attacks\r\n | SonicWall fixed SMA 100 flaws that could be chained to execute arbitrary code\r\n | The LockBit ransomware site was breached, databas… [+162739 chars]",
    "full_content": "Russia-linked ColdRiver used LostKeys malware in recent attacks\n\nPierluigi Paganini May 09, 2025 May 09, 2025\n\nSince early 2025, Russia-linked ColdRiver has used LostKeys malware to steal files in espionage attacks on Western governments and organizations.\n\nGoogle’s Threat Intelligence Group discovered LOSTKEYS, a new malware used by Russia-linked APT COLDRIVER, in recent attacks to steal files and gather system info. The ColdRiver APT (aka “Seaborgium“, “Callisto”, “Star Blizzard”, “TA446”) is a Russian cyberespionage group that has been targeting government officials, military personnel, journalists and think tanks since at least 2015.\n\nIn the past, the group’s activity involved persistent phishing and credential theft campaigns leading to intrusions and data theft. The APT primarily targets NATO countries, but experts also observed campaigns targeting the Baltics, Nordics, and Eastern Europe regions, including Ukraine.\n\nCOLDRIVER targets high-profile individuals and NGOs to steal credentials, emails, and contacts. They may also deploy malware for file access. Recent victims include Western advisors, journalists, and Ukraine-linked individuals. Their main goal is intelligence gathering for Russian interests, with occasional hack-and-leak operations.\n\nAccording to Google GTIG, the APT group used LostKeys malware in selective ClickFix attacks starting in January, where victims were tricked into running malicious PowerShell scripts that led to data theft via VBS payloads.\n\nLOSTKEYS is deployed via a multi-step chain starting with a fake CAPTCHA that tricks users into running PowerShell. This “ClickFix” method, used by COLDRIVER and others, fetches staged payloads from remote servers.\n\nThe second stage checks the device’s display resolution MD5 hash. If it matches specific values, execution stops, otherwise, the malicious code retrieves the third stage, which uses unique identifiers for each request.\n\nThe third stage decodes a Base64 blob to PowerShell, which retrieves and decodes the final payload. It pulls two files: a VBS decoder and a second encoded file, using unique keys for each infection chain.\n\n“The end result of this is a VBS that we call LOSTKEYS. It is a piece of malware that is capable of stealing files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker.” concludes the report. “The typical behavior of COLDRIVER is to steal credentials and then use them to steal emails and contacts from the target, but as we have previously documented they will also deploy malware called SPICA to select targets if they want to access documents on the target system. LOSTKEYS is designed to achieve a similar goal and is only deployed in highly selective cases.”\n\nGoogle experts found two additional samples dating back to December 2023. These Portable Executable (PE) files, pretending to be Maltego software, execute LOSTKEYS but follow a different execution chain.\n\n“It is currently unclear if these samples from December 2023 are related to COLDRIVER, or if the malware was repurposed from a different developer or operation into the activity seen starting in January 2025.” concludes the report.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, LostKeyster)"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Google will pay Texas $1.4 billion over its location tracking practices",
    "description": "Google will pay the U.S. state of Texas $1.4B to settle lawsuits over unauthorized location tracking and facial recognition data retention. Google will pay nearly $1.4 billion to the state of Texas to settle two lawsuits over tracking users’ locations and sto…",
    "url": "https://securityaffairs.com/177683/laws-and-regulations/google-will-pay-texas-1-4-billion-over-its-location-tracking-practices.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2021/08/google-logo.png",
    "publishedAt": "2025-05-11T16:39:07Z",
    "content": "Ascension reveals personal data of 437,329 patients exposed in cyberattack\r\n | Operation Moonlander dismantled the botnet behind Anyproxy and 5socks cybercriminals services\r\n | A cyber attack briefly… [+163051 chars]",
    "full_content": "Google will pay Texas $1.4 billion over its location tracking practices\n\nPierluigi Paganini May 11, 2025 May 11, 2025\n\nGoogle will pay the U.S. state of Texas $1.4B to settle lawsuits over unauthorized location tracking and facial recognition data retention.\n\nGoogle will pay nearly $1.4 billion to the state of Texas to settle two lawsuits over tracking users’ locations and storing biometric data without consent. The $1.375 billion settlement far exceeds previous fines over its location tracking practices: $391 million to 40 states in 2022, $29.5 million to Indiana and Washington in early 2023, and $93 million to California later that year.\n\nTexas Attorney General Ken Paxton reached a landmark $1.375 billion settlement with Google over unlawful tracking of geolocation, incognito searches, and biometric data.\n\n“In 2022, Attorney General Paxton sued Google for unlawfully tracking and collecting users’ private data regarding geolocation, incognito searches, and biometric data. After years of aggressive litigation, Attorney General Paxton agreed to settle Texas’s data-privacy claims against Google for an amount that far surpasses any other state’s claims for similar violations.” reads the press release published by the Attorney General of Texas. “To date, no state has attained a settlement against Google for similar data-privacy violations greater than $93 million. Even a multistate coalition that included forty states secured just $391 million—almost a billion dollars less than Texas’s recovery.”\n\nFiled in 2022, the case accused Google of unlawfully tracking geolocation, incognito searches, and collecting biometric data without consent, even with Location History turned off.\n\n“In Texas, Big Tech is not above the law. For years, Google secretly tracked people’s movements, private searches, and even their voiceprints and facial geometry through their products and services. I fought back and won,” said Attorney General Paxton. “This $1.375 billion settlement is a major win for Texans’ privacy and tells companies that they will pay for abusing our trust. I will always protect Texans by stopping Big Tech’s attempts to make a profit by selling away our rights and freedoms.”\n\nThe settlement represents a major privacy victory for Texans and a clear warning to companies against violating user trust.\n\nIn July 2024, Texas AG Paxton secured a record $1.4B settlement from Meta over illegal facial recognition data use, adding to prior $700M and $8M settlements with Google.\n\n“Texas Attorney General Ken Paxton has secured a $1.4 billion settlement with Meta (formerly known as Facebook) to stop the company’s practice of capturing and using the personal biometric data of millions of Texans without the authorization required by law.” said the Attorney General of Texas at the time. “This settlement is the largest ever obtained from an action brought by a single State”\n\nGoogle denies any wrongdoing in the $1.375B settlement, stating it had already made relevant policy changes and won’t alter products as part of the deal.\n\nThe settlement addresses claims involving Chrome’s incognito mode, location history disclosures in the Google Maps app, and biometric data use in Google Photos.\n\n“This settles a raft of old claims, many of which have already been resolved elsewhere, concerning product policies we have long since changed,” Google spokesman Jose Castaneda said. “We are pleased to put them behind us, and we will continue to build robust privacy controls into our services.”\n\nIn June 2024, Google announced that starting December 1, 2024, it will store Maps Timeline data locally on user devices instead of their accounts and remove web access to that data.\n\n“Since the data shown on your Timeline comes directly from your device, Timeline won’t be available on Maps on your computer after you move your data. To move your data to your device, download the Google Maps app.” reads the announcement published by the IT giant.\n\nFollow me on Twitter: @securityaffairs and Facebook and Mastodon\n\nPierluigi Paganini\n\n(SecurityAffairs – hacking, newsletter)"
  }
]