[
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Davey Winder, Senior Contributor, \n Davey Winder, Senior Contributor\n https://www.forbes.com/sites/daveywinder/",
    "title": "US Tariff Fears Used In New Cyberattack Campaign As Millions Targeted",
    "description": "Beware the CoGUI threat actors using concern over tariffs to attack.",
    "url": "https://www.forbes.com/sites/daveywinder/2025/05/06/us-tariffs-used-in-new-cyberattack-campaign-as-millions-targeted/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6819e440805ec43881dc6dc2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-06T11:45:23Z",
    "content": "CoGUI cyberattacks exploit US tariff concerns.\r\nGetty Images\r\nIm not going to call them social engineers as that implies a level of professionalism, but criminal actors love to exploit high-profile n… [+3198 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "techradar",
      "name": "TechRadar"
    },
    "author": "Sead Fadilpašić",
    "title": "Japanese businesses are being bombarded with millions of phishing messages",
    "description": "A Chinese threat actor is on the hunt for login credentials and system data.",
    "url": "https://www.techradar.com/pro/security/japanese-businesses-are-being-bombarded-with-millions-of-phishing-messages",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/krBVBETP6cmxBcihGXQFy8.jpg",
    "publishedAt": "2025-05-07T11:22:00Z",
    "content": "<ul><li>Proofpoint observes notable spike in phishing emails targeting Japanese businesses</li><li>The emails are being sent out via a kit called CoGUI</li><li>The researchers attributed the attack t… [+2183 chars]",
    "full_content": "Proofpoint observes notable spike in phishing emails targeting Japanese businesses\n\nThe emails are being sent out via a kit called CoGUI\n\nThe researchers attributed the attack to a Chinese-speaking threat actor\n\nThreat actors are flooding Japanese businesses with phishing attacks, and are using a unique phishing kit framework called CoGUI to do it.\n\nCybersecurity researchers Proofpoint say they have observed a “notable increase” in high-volume Japanese language campaigns using CoGUI in the wild in October 2024, before starting to track it in December of the same year.\n\n“The campaigns typically include a high-volume of messages, with counts ranging from hundreds of thousands to tens of millions per campaign, with an average of approximately 50 campaigns per month campaigned by our researchers,” Proofpoint explained.\n\nGet Keeper Personal for just $1.67/month, Keeper Family for just $3.54/month, and Keeper Business for just $7/month ​Keeper is a cybersecurity platform primarily known for its password manager and digital vault, designed to help individuals, families, and businesses securely store and manage passwords, sensitive files, and other private data. It uses zero-knowledge encryption and offers features like two-factor authentication, dark web monitoring, secure file storage, and breach alerts to protect against cyber threats. Preferred partner (What does this mean?)\n\nMillions of messages\n\nThe campaign peaked in January 2025, when 172 million messages were sent out.\n\nThe attackers were mostly pretending to be Amazon, PayPal, or Rakuten, but other brands were abused, as well. Japan was, by far, the most targeted country, but Proofpoint also said that there were victims in Australia, New Zealand, Canada, and the United States.\n\nThe goal of the campaign was to steal people’s login credentials, and system information. That data includes the geographical location of the IP address, language configuration of the browser, browser type and version, monitor height and width, OS, and the type of device used (mobile, desktop, laptop).\n\nProofpoint added the kit cannot grab 2FA code, but still described it as “sophisticated”, with advanced evasion techniques such as geofencing, header fencing, and fingerprinting.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThese allowed the threat actors to focus on specific geographies, while evading most of today’s security measures.\n\nThe researchers attributed the attacks to a Chinese-speaking threat actor that mainly targets Japanese language speakers in Japan.\n\nThe best way to defend against these attacks remains the same - to use common sense, and slow down when reading and responding to email messages."
  },
  {
    "source": {
      "id": null,
      "name": "Help Net Security"
    },
    "author": "Zeljka Zorz",
    "title": "The many variants of the ClickFix social engineering tactic",
    "description": "As new malware delivery campaigns using the ClickFix social engineering tactic are spotted nearly every month, it’s interesting to see how the various attackers are trying to refine the two main elements: the lure and the “instruction” page. In the latest ema…",
    "url": "https://www.helpnetsecurity.com/2025/05/08/clickfix-social-engineering-tactic-variants/",
    "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2025/05/08173048/clickfix-1-1500.webp",
    "publishedAt": "2025-05-08T15:31:22Z",
    "content": "As new malware delivery campaigns using the ClickFix social engineering tactic are spotted nearly every month, it’s interesting to see how the various attackers are trying to refine the two main elem… [+2677 chars]",
    "full_content": "As new malware delivery campaigns using the ClickFix social engineering tactic are spotted nearly every month, it’s interesting to see how the various attackers are trying to refine the two main elements: the lure and the “instruction” page.\n\nIn the latest email campaigns documented by the Google Threat Intelligence Group, the suspected Russian threat actor tried to trick the targets into downloading malware by urging them to “solve” a fake CAPTCHA page and then press a combination of keys that will execute a malicious PowerShell command without them knowing or noticing.\n\nWhile the FakeCAPTCHA variant of the ClickFix tactic is not unusual, this might be the first time attackers have tried to work around the aversion many users feel towards written-down, step by step instructions by showing this alternative layout:\n\nInstructions that are easy to follow. (Source: GTIG)\n\nThe ClickFix / FakeCaptcha approach\n\nClickFix is a tactic aimed at delivering malware without involving a web browser or requiring users to manually execute a file, and it helps attackers avoid detection by email and endpoint security solutions.\n\nA typical ClickFix attack flow looks like this:\n\n1) The user is tricked into visiting a page that will show a fake alert or a fake CAPTCHA test\n\n2) The page tells the user to press a “Fix it” button or check an “I’m not a robot” box and perform a set of actions (the “instructions”)\n\n3) A malicious PowerShell command is downloaded and executed\n\nThis relatively new tactic was first spotted last year, when it took the form of fake error messages that promised to fix the problem (thus the name “ClickFix”):\n\nThe error message, with step-by-step instructions (Source: Proofpoint)\n\nClickFix variants\n\nThe initial campaigns weren’t targeted: the attackers were trying to deliver infostealers to as many users as possible. Later, when other threat actors started using the tactic, we started witnessing many variations:\n\nMalicious websites using the ClickFix / FakeCaptcha tactic (Source: Sekoia)\n\nAttackers impersonating Samsara (Source: Proofpoint)\n\nFake Google Meet video conference page with malicious ClickFix pop-up (Source: Sekoia)\n\nEmail warning about “important security update” (Source: Proofpoint)\n\nIn time, attackers tried the same trick with macOS and Linux users.\n\nIn a campaign aimed at tech-savvy experts, the (Linux-using) targets were urged to install a CPU update (Source: DataDog)\n\nAccording to Group-IB, the number of domains hosting pages with ClickFix content is consistently rising.\n\nAnd while there are tech-focused protections organizations can implement to prevent this tactic from being successful, the social engineering aspect is primarily fought with security awareness training.\n\nSubscribe to our breaking news e-mail alert to never miss out on the latest breaches, vulnerabilities and cybersecurity threats. Subscribe here!"
  },
  {
    "source": {
      "id": null,
      "name": "BleepingComputer"
    },
    "author": "Bill Toulas",
    "title": "CoGUI phishing platform sent 580 million emails to steal credentials",
    "description": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data. [...]",
    "url": "https://www.bleepingcomputer.com/news/security/cogui-phishing-platform-sent-580-million-emails-to-steal-credentials/",
    "urlToImage": "https://www.bleepstatic.com/content/hl-images/2024/05/13/Phishing.jpg",
    "publishedAt": "2025-05-07T18:02:16Z",
    "content": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data.\r\nThe messages impersonate major brands l… [+2686 chars]",
    "full_content": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data.\n\nThe messages impersonate major brands like Amazon, Rakuten, PayPal, Apple, tax agencies, and banks.\n\nThe activity culminated in January 2025, where 170 campaigns sent 172,000,000 phishing messages to targets, but the following months maintained equally impressive volumes.\n\nProofpoint researchers who discovered the CoGUI campaigns noted that it's the highest volume phishing campaign they currently track. The attacks mainly target Japan, though smaller-scale campaigns were also directed at the United States, Canada, Australia, and New Zealand.\n\nCoGUI has been active since at least October 2024, but Proofpoint started tracking it in December and onward.\n\nPhishing email volumes generated by CoGUI\n\nSource: Proofpoint\n\nThe analysts found several similarities to the Darcula phishing kit, which has been linked to China-based operatives, and initially believed that the origin of the CoGUI attacks is the same.\n\nHowever, upon deeper examination, Proofpoint concluded that the two phishing kits are unrelated even though they are both utilized by Chinese threat actors.\n\nCoGUI attack chain\n\nThe attack starts with a phishing email impersonating a trusted brand, often having urgent subject lines requiring the recipient's action.\n\nThe messages include a URL that redirects to a phishing website hosted on the CoGUI phishing platform, but the link only resolves if the target meets specific criteria pre-defined by the attackers.\n\nThese criteria include their IP address (location), browser language, operating system, screen resolution, and device type (mobile or desktop).\n\nIf the criteria aren't met, victims are redirected to the brand's legitimate site that was impersonated to reduce suspicion.\n\nValid targets are redirected to a phishing page featuring a fake login form that mimics the design of the real brand, tricking victims into entering their sensitive information.\n\nFake Amazon login page\n\nSource: Proofpoint\n\nProofpoint has also found that CoGUI was behind smishing campaigns targeting the United States with 'outstanding toll payment' lures. However, it noted that most of that activity has now migrated to Darcula.\n\nThe researchers believe CoGUI facilitates the operations of multiple threat actors, primarily from China, who predominantly target Japanese users.\n\nHowever, the kit could be adopted by other cybercriminals with a different targeting scope at any moment, resulting in massive attack waves hitting other countries.\n\nThe best way to mitigate phishing risks is never to act with haste when receiving emails requesting urgent action, and always log in to the claimed platform independently instead of following embedded links."
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Davey Winder, Senior Contributor, \n Davey Winder, Senior Contributor\n https://www.forbes.com/sites/daveywinder/",
    "title": "Warning — 19 Billion Compromised Passwords Have Been Published Online",
    "description": "You must take action now, as security experts confirm 19 billion compromised passwords available to cybercriminals for use in account hacking attacks.",
    "url": "https://www.forbes.com/sites/daveywinder/2025/05/06/new-warning---19-billion-compromised-passwords-create-hacking-arsenal/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6815d61a4e4ca3e6569d5212/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-06T14:33:25Z",
    "content": "19 billion exposed passwords analyzed and it's not good news.\r\ngetty\r\nUpdate, May 6, 2025: This story, originally published May 3, has been updated with details of the SMS phishing threat posed by th… [+9547 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Help Net Security"
    },
    "author": "Sinisa Markovic",
    "title": "How cybercriminals exploit psychological triggers in social engineering attacks",
    "description": "Most attacks don’t start with malware; they begin with a message that seems completely normal, whether it comes through email, a phone call, or a chat, and that is exactly what makes them so effective. These threats rely on psychological manipulation to bypas…",
    "url": "https://www.helpnetsecurity.com/2025/05/06/social-engineering-human-behavior/",
    "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2024/05/31195930/social-engineering_1500.webp",
    "publishedAt": "2025-05-06T05:00:44Z",
    "content": "Most attacks dont start with malware; they begin with a message that seems completely normal, whether it comes through email, a phone call, or a chat, and that is exactly what makes them so effective… [+5429 chars]",
    "full_content": "Most attacks don’t start with malware; they begin with a message that seems completely normal, whether it comes through email, a phone call, or a chat, and that is exactly what makes them so effective. These threats rely on psychological manipulation to bypass people, not firewalls. Pressure is applied, authority is faked, and communication is mimicked.\n\nSocial engineering threats account for most cyberthreats faced by individuals in 2024, according to Avast.\n\nSome people are easier to manipulate than others, but no matter how good we are in recognizing social engineering everyone could have a bad day and could let their guard down.\n\nA recent example is security expert Troy Hunt, creator of Have I Been Pwned (HIBP), who disclosed that he fell for a well-crafted phishing email. The attacker gained access to his Mailchimp account and stole a list of email addresses belonging to his newsletter subscribers.\n\nThere are numerous ways criminals will try to find the emotional button that will help them get what they want.\n\nOne of the latest trends is known as “scam-yourself” tactics. Instead of stealing your data directly, they trick you into handing it over. You might share a passcode, click a fake prompt, or disable a security step, because it feels like a normal task. These attacks work because they blend into everyday tools and routines.\n\nAs Josh Taylor, Lead Cybersecurity Analyst at Fortra, put it: “What makes these attacks so dangerous is their deceptive familiarity. Gone are the glaring red flags. In their place are authentic-looking prompts designed to exploit our habits and trust in everyday technology.”\n\nOne social engineering trick that’s becoming particularly popular is getting users to install malware through fake error messages. Proofpoint researchers point out that these messages often look like legitimate system warnings, tricking users into actions like installing root certificates or running suspicious scripts, all while pretending to fix an issue.\n\nThe psychology behind social engineering\n\nAuthority\n\nPeople are more likely to trust those who seem to have authority. Impersonating important figures, such as a boss or IT administrator, convinces others to follow their lead. By exploiting this trust, individuals can be manipulated into taking actions they wouldn’t normally consider.\n\nUrgency and fear\n\nTime pressure and fear often go hand in hand. Messages might warn that an account will be locked, a payment failed, or sensitive data has been exposed. This combination creates panic and rushes people into acting before they think. When emotion takes over, it’s easier to make mistakes, especially when a task looks routine but isn’t.\n\nSocial proof\n\nHumans naturally look to others for guidance. Fake reviews or messages posing as familiar colleagues make the message seem more legitimate, increasing the likelihood of it being trusted.\n\nReciprocity\n\nWhen someone does something nice for us, we feel pressure to return the favor. Offering help or a free gift upfront makes it easier to later ask for personal information or access.\n\nFamiliarity\n\nWe tend to trust things that feel familiar. Mimicking friends, coworkers, trusted emails, websites, or messages makes attempts seem more legitimate, making it harder to recognize when something is a scam.\n\nFrom lobby to breach\n\nNot all social engineering happens online. Sometimes, it starts at the front door. Tailgating, badge cloning, or posing as a delivery person are simple ways to get inside a secure building. Once inside, it’s easier to plug in rogue devices, access unlocked machines, or gather intel left in the open.\n\nKevin Mitnick demonstrated how attackers often rely on nothing more than a casual conversation or subtle social cues to manipulate people.\n\n“With a physical intrusion, so many factors come into play—time of day, location, the security in place, and the people trusted to maintain it. All these factors change constantly, often without notice, making prevention much harder. Many companies will put in the bare minimum and hope for the best until they are unfortunately proven wrong. Human nature has always had an aversion to contemplating and preparing for negative outcomes,” said Jayson E. Street, Chief Adversarial Officer at Secure Yeti.\n\nAI’s role in social engineering\n\nVishing and deepfake phishing attacks are on the rise as attackers leverage GenAI to amplify social engineering tactics, according to Zscaler.\n\nIn 2024, a deepfake video conference call, combined with social engineering techniques, led to the theft of over $25 million from a major multinational firm.\n\n“Deepfakes are getting so convincing, so realistic that even storied researchers now have a hard time differentiating real from fake simply by looking at or listening to a media file,” explained Ben Colman, CEO of Reality Defender.\n\nHow to protect against social engineering\n\nVerify identity: Always confirm identities before sharing sensitive information, especially through email or phone. If in doubt, call the person back using an official number.\n\nEducate employees: Conduct regular training to raise awareness about phishing, pretexting, and other social engineering tactics, emphasizing skepticism.\n\nLimit information sharing: Avoid sharing sensitive details (like job titles or office layouts) on public platforms or social media to reduce exposure.\n\nUse MFA: Implement MFA for all corporate accounts to add an extra layer of security against unauthorized access.\n\nMonitor and report suspicious behavior: Encourage employees to report any unusual requests or behaviors, and continuously monitor systems for signs of compromise."
  }
]