[
  {
    "source": {
      "id": null,
      "name": "Science Daily"
    },
    "author": null,
    "title": "Physicists snap the first images of 'free-range' atoms",
    "description": "Physicists captured the first images of individual atoms freely interacting in space. The pictures reveal correlations among the 'free-range' particles that until now were predicted but never directly observed.",
    "url": "https://www.sciencedaily.com/releases/2025/05/250507125959.htm",
    "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
    "publishedAt": "2025-05-07T16:59:59Z",
    "content": "MIT physicists have captured the first images of individual atoms freely interacting in space. The pictures reveal correlations among the \"free-range\" particles that until now were predicted but neve… [+7033 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Trefis Team, Contributor, \n Trefis Team, Contributor\n https://www.forbes.com/sites/greatspeculations/people/trefis/",
    "title": "How Will QBTS Stock React To Its Upcoming Earnings?",
    "description": "The company has $1.8 Bil in current market capitalization.",
    "url": "https://www.forbes.com/sites/greatspeculations/2025/05/06/how-will-qbts-stock-react-to-its-upcoming-earnings/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67d4642653169b51c05274e7/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-06T12:18:50Z",
    "content": "CHONGQING, CHINA - MARCH 10: In this photo illustration, the D-Wave logo is displayed on a ... More smartphone screen, on March 10, 2025, in Chongqing, China. (Photo illustration by Cheng Xin/Getty I… [+3243 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Investopedia"
    },
    "author": "Colin Laidley",
    "title": "Why D-Wave Quantum Stock Is Skyrocketing Thursday",
    "description": "D-Wave Quantum stock soared on Thursday after the quantum computing company reported record revenue and a narrower loss in the first quarter.",
    "url": "https://www.investopedia.com/why-d-wave-quantum-stock-is-skyrocketing-thursday-11730973",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LjeFzERb_sdwwnS_rbKEIA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDc-/https://media.zenfs.com/en/investopedia_245/72f6402f242299a4af6fe130c3a99b83",
    "publishedAt": "2025-05-08T20:25:37Z",
    "content": "Pavlo Gonchar / SOPA Images / LightRocket via Getty Images\r\n D-Wave shares were up 50% Thursday afternoon, approaching their record high of $11.95\r\nD-Wave Quantum (QBTS) stock soared on Thursday afte… [+1584 chars]",
    "full_content": "D-Wave Quantum (QBTS) stock soared on Thursday after the quantum computing company reported record revenue and a narrower loss in the first quarter.\n\nD-Wave reported first-quarter revenue of $15 million, a 509% increase from a year ago. The surge in revenue was driven by the sale of an Advantage quantum computing system to Germany’s Jülich Supercomputing Centre. D-Wave’s net loss narrowed to $5.4 million, or 2 cents a share, from $17.3 million, or 11 cents per share, last year.\n\nD-Wave finished the quarter with a record consolidated cash balance of $304.3 million, an amount that management expects will be sufficient to fund the company until it’s profitable.\n\nLatest Quarter 'Most Significant in D-Wave's History,' CEO Says\n\n“The first quarter of 2025 was arguably the most significant in D-Wave’s history,” said CEO Alan Baratz. The company, he said, “became the first to demonstrate quantum supremacy over classical computing on a useful real-world problem” with a peer-reviewed paper published in the scientific journal Science in March.\n\nQuantum computing stocks stepped into the spotlight late last year when Alphabet (GOOG) debuted a quantum computing chip called Willow, which the company claimed can complete computations orders of magnitude faster than the most advanced non-quantum chips. Since then, quantum stocks, including D-Wave, Rigetti Computing (RGTI), and Quantum Computing (QUBT), have been volatile amid highly speculative trading.\n\nD-Wave shares were up more than 50% at $10.44 in recent trading on Thursday, approaching their record high of $11.95. Shares of competitors Rigetti and Quantum Computing were up 11% and 19%, respectively."
  },
  {
    "source": {
      "id": null,
      "name": "PetaPixel"
    },
    "author": "Jeremy Gray",
    "title": "Scientists Capture First-Ever Images of Free-Range Atoms",
    "description": "Physicists at the Massachusetts Institute of Technology (MIT) have captured the first photos ever of \"free-range\" atoms. The groundbreaking achievement will help scientists visualize quantum phenomena in real-world space.\n[Read More]",
    "url": "https://petapixel.com/2025/05/07/scientists-capture-first-ever-images-of-free-range-atoms/",
    "urlToImage": "https://petapixel.com/assets/uploads/2025/05/mit-atom-resolved-microscopy.jpg",
    "publishedAt": "2025-05-07T21:09:59Z",
    "content": "Physicists at the Massachusetts Institute of Technology (MIT) have captured the first photos ever of “free-range” atoms. The groundbreaking achievement will help scientists visualize quantum phenomen… [+5500 chars]",
    "full_content": "Physicists at the Massachusetts Institute of Technology (MIT) have captured the first photos ever of “free-range” atoms. The groundbreaking achievement will help scientists visualize quantum phenomena in real-world space.\n\nThe new photos and associated research published this week in the scientific journal Physical Review Letters, relied on novel imaging techniques to resolve single, free-range atoms. The team’s “atom-resolved microscopy” system uses a “lattice of light that briefly freezes atoms in their tracks,” and then uses precisely-tuned lasers to rapidly illuminate suspended atoms, which creates a “picture of their positions before the atoms naturally dissipate,” MIT’s press release explains.\n\nThe physicists used the new technique to visualize clouds of various types of atoms, including atoms known as “bosons,” which then bunched into a wave form thanks to a quantum phenomenon. The team also observed “fermions” actively pairing in free space.\n\n“We are able to see single atoms in these interesting clouds of atoms and what they are doing in relation to each other, which is beautiful,” says Martin Zwierlein, the Thomas A. Frank Professor of Physics at MIT.\n\nTwo other groups using similar imaging techniques reported their results in the new journal issue as well, including a team led by Nobel laureate Wolfgang Ketterle, the John D. MacArthur Professor of Physics at MIT, and a group from École Normale Supérieure in Paris led by Tarik Yefsah. Ketterle’s group looked at enhanced pair correlations among bosons, while Yefsah’s team imaged noninteracting fermions.\n\nIt’s easy to imagine how challenging it is to photograph a single atom given its extremely small size. A single atom is about one-tenth of a nanometer in diameter. Or, put another way, one-millionth the thickness of a single human hair.\n\nScientists have been able to image atoms before, thanks to techniques like absorption imaging, where a laser shines onto an atom cloud and casts shadows onto an image sensor. However, these techniques show the overall structure and shape of a cloud of atoms, rather than an individual atom.\n\n“It’s like seeing a cloud in the sky, but not the individual water molecules that make up the cloud,” Zwierlein says of absorption imaging.\n\nZwierlein and his colleagues used a much different technique. Atom-resolved microscopy requires a cloud of atoms to be held in space by a laser beam trap. Within this trap, the atoms can still freely interact with each other, which is vital to understanding the quantum phenomena at play. A lattice of light, as mentioned earlier, then freezes the atoms in their positions. Finally, a second laser enters the scene, illuminating the suspended atoms. Their fluorescence reveals their position to a highly specialized sensor.\n\n“The hardest part was to gather the light from the atoms without boiling them out of the optical lattice,” Zwierlein says. “You can imagine if you took a flamethrower to these atoms, they would not like that. So, we’ve learned some tricks through the years on how to do this. And it’s the first time we do it in-situ, where we can suddenly freeze the motion of the atoms when they’re strongly interacting, and see them, one after the other. That’s what makes this technique more powerful than what was done before.”\n\nThe new imaging results have been decades in the making for Professor Ketterle. He won the Nobel Prize in Physics in 2001 as part of a team that was the first to produce a Bose-Einstein condensate of sodium atoms, which is a state of matter where all bosons share a unified quantum state. Ketterle’s team now captured novel images of bosons.\n\nZwierlein’s group imaged individual sodium atoms within the atom cloud and observed the atoms sharing the same quantum mechanical wave. The wave-like characteristic, named after its discoverer, Louis de Broglie, helped spur the modern age of quantum mechanics.\n\n“We understand so much more about the world from this wave-like nature,” Zwierlein continues. “But it’s really tough to observe these quantum, wave-like effects. However, in our new microscope, we can visualize this wave directly.”\n\nThe MIT team, for the first time in situ, witnessed bosons sharing a single quantum, correlated de Broglie wave. The observations showed real, physical world phenomena previously only demonstrated through pure mathematics.\n\n“This kind of pairing is the basis of a mathematical construction people came up with to explain experiments. But when you see pictures like these, it’s showing in a photograph, an object that was discovered in the mathematical world,” explains study co-author Richard J. Fletcher. “So it’s a very nice reminder that physics is about physical things. It’s real.”\n\nThey will begin using their new imaging technique to observe even more exotic phenomena, such as “quantum Hall physics,” which are situations when interacting electrons display correlated behaviors while in the presence of a magnetic field.\n\n“That’s where theory gets really hairy — where people start drawing pictures instead of being able to write down a full-fledged theory because they can’t fully solve it,” Zwierlein hopes. “Now we can verify whether these cartoons of quantum Hall states are actually real. Because they are pretty bizarre states.”\n\nCredits: The full research paper is available now in Physical Review Journals. The paper, “Measuring Pair Correlations in Bose and Fermi Gases via Atom-Resolved Microscopy,” was written by Ruixiao Yao, Sungjae Chi, Mingxuan Wang, Richard J. Fletcher, and Martin Zwierlein."
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Why D-Wave Quantum Inc. (QBTS) Skyrocketed This Week",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9c1be537-ec81-4a97-9afa-5eb91fbf1dca",
    "urlToImage": null,
    "publishedAt": "2025-05-10T13:34:43Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Angelica Ballesteros",
    "title": "Why D-Wave Quantum Inc. (QBTS) Went Up On Thursday",
    "description": "We recently published a list of 10 Unexpected Market Movers—What Propelled Double-Digit Gains? In this article, we are going to take a look at where D-Wave...",
    "url": "https://finance.yahoo.com/news/why-d-wave-quantum-inc-044133613.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/agg7c6ypsVjxMwZbGpkvkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/963fe51cbecacbfb5e693831f69c8f7c",
    "publishedAt": "2025-05-09T04:41:33Z",
    "content": "We recently published a list of 10 Unexpected Market MoversWhat Propelled Double-Digit Gains? In this article, we are going to take a look at where D-Wave Quantum Inc. (NYSE:QBTS) stands against othe… [+2906 chars]",
    "full_content": "We recently published a list of 10 Unexpected Market Movers—What Propelled Double-Digit Gains? In this article, we are going to take a look at where D-Wave Quantum Inc. (NYSE:QBTS) stands against other Thursday’s top-performing stocks.\n\nThe stock market extended its winning streak on Thursday as investors cheered President Donald Trump’s trade deal framework between the United States and the United Kingdom.\n\nAmong Wall Street’s major indices, the tech-heavy Nasdaq rallied the most, up 1.07 percent, followed by the Dow Jones, up 0.62 percent, and the S&P 500, gaining 0.58 percent.\n\nAccording to Trump, the Oval Office outlined a trade deal framework. While a 10-percent baseline tariff will remain for imported goods from the UK, it could be the low end of deals with future countries.\n\n“The final details are being written up,” Trump said. “In the coming weeks, we’ll have it all very conclusive.”\n\nBeyond the major indices, 10 firms stood out, booking double-digit gains amid a flurry of fresh developments such as optimistic revenue guidance and impressive earnings performance, among others. In this article, let us explore Thursday’s 10 top-performing stocks and detail the reasons behind their gains.\n\nTo come up with the list, we considered only the stocks with a $2-billion market capitalization and $5-million trading volume.\n\nWhy D-Wave Quantum Inc. (QBTS) Went Up On Thursday\n\nA modern computer datacenter, running an advanced quantum computer system.\n\nD-Wave Quantum Inc. (NYSE:QBTS)\n\nD-Wave Quantum Inc. skyrocketed by 51.23 percent on Thursday to end at $10.42 apiece after its earnings soared in the first quarter of the year.\n\nOn Thursday, D-Wave Quantum Inc. (NYSE:QBTS) announced that its revenues expanded by 508 percent to $15 million from $2.465 million in the same period last year, primarily driven by the sale of a quantum computing system during the period.\n\nThis pushed its net loss to shrink by 69 percent to $5.421 million from $17.312 million year-on-year.\n\n“The first quarter of 2025 was arguably the most significant in D-Wave’s history, especially in terms of our unique ability to deliver quantum value today to our customers and the scientific community,” said D-Wave Quantum Inc. (NYSE:QBTS) CEO Alan Baratz.\n\n“We recognized revenue on our first Advantage system sale to a major research institution, moved an additional customer application into commercial production, and became the first to demonstrate quantum supremacy over classical computing on a useful real-world problem. The end result was a record revenue and gross profit quarter,” he underscored.\n\nOverall, QBTS ranks 1st on our list of Thursday’s top-performing stocks. While we acknowledge the potential of QBTS as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than QBTS but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock."
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Trefis Team, Contributor, \n Trefis Team, Contributor\n https://www.forbes.com/sites/greatspeculations/people/trefis/",
    "title": "Should You Buy The Dip In Upstart Stock?",
    "description": "The company reported revenue of $213 million and earnings of $0.30 per share, surpassing the consensus estimates of $201 million and $0.17, respectively.",
    "url": "https://www.forbes.com/sites/greatspeculations/2025/05/07/should-you-buy-the-dip-in-upstart-stock/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67acaebb06f3263fc0479f64/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-07T11:58:30Z",
    "content": "CANADA - 2025/02/06: In this photo illustration, the Upstart Holdings logo is seen displayed on a ... More smartphone screen. (Photo Illustration by Thomas Fuller/SOPA Images/LightRocket via Getty Im… [+3699 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Peter Bendor-Samuel, Contributor, \n Peter Bendor-Samuel, Contributor\n https://www.forbes.com/sites/peterbendorsamuel/",
    "title": "The Realistic Path To Quantum Computing: Separating Hype From Reality",
    "description": "The buzz is deafening – promises of breakthroughs in encryption, pharmaceuticals, and financial modeling fill headlines.",
    "url": "https://www.forbes.com/sites/peterbendorsamuel/2025/05/07/the-realistic-path-to-quantum-computing-separating-hype-from-reality/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681b54152f6f38c9b025beab/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-07T12:37:57Z",
    "content": "The Realistic Path to Quantum Computing: Separating Hype from Reality \r\ngetty\r\nIf theres one technology that has captured the imagination of futurists and tech enthusiasts as much as generative AI, i… [+7331 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Why D-Wave Stock Skyrocketed 40.2% This Week",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_90fd9264-8bce-407d-b296-4dca1cb5e9b6",
    "urlToImage": null,
    "publishedAt": "2025-05-11T08:25:47Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "GameSpot"
    },
    "author": "Tomas Franzese",
    "title": "Clair Obscur: Expedition 33's New Patch Nerfs The Strongest Party Member",
    "description": "Sandfall Interactive and Kepler Interactive have released Patch 1.2.3 for Clair Obscur: Expedition 33, and it nerfs Maelle, a party member who can deal absolutely massive amounts of damage with the right character build.Expedition 33 is a turn-based RPG, and …",
    "url": "https://www.gamespot.com/articles/clair-obscur-expedition-33s-new-patch-nerfs-the-strongest-party-member/1100-6531420/",
    "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1849/18498836/4491185-ss_c130295c9e1169dc0c63eaae0618e64d06a88c92.1920x1080.jpg",
    "publishedAt": "2025-05-09T14:18:00Z",
    "content": "Sandfall Interactive and Kepler Interactive have released Patch 1.2.3 for Clair Obscur: Expedition 33, and it nerfs Maelle, a party member who can deal absolutely massive amounts of damage with the r… [+5465 chars]",
    "full_content": "Sandfall Interactive and Kepler Interactive have released Patch 1.2.3 for Clair Obscur: Expedition 33, and it nerfs Maelle, a party member who can deal absolutely massive amounts of damage with the right character build.\n\nExpedition 33 is a turn-based RPG, and each party member acquired over the course of the game has a set of abilities that offer up a distinct playstyle. Maelle's abilities center around switching between Offensive, Defensive, and Virtuose stances to maximize defense or damage. But a powerful late-game ability called Stendahl was a little too powerful, and with the right Pictos equipped, players can deal several million in damage using this ability.\n\nOn May 8, the developers admitted that they made Stendahl a little too powerful and would nerf it in the next patch. Now that the patch notes are here, Stendahl damage has been reduced by a whopping 40%. While that's a pretty massive nerf, Maelle's Medalum weapon now doubles all damage in Virtuose stance. This patch also brings improved widescreen support with it, and gets rid of a lot of areas where players could get stuck while exploring the world map.\n\nDon't expect this to be the final balance pass for Expedition 33 either, as the patch notes tease that more is on the way. \"This is the first in a series of patches we are looking to do over the coming months,\" Sandfall Interactive says. \"We are still investigating many feature requests and issues for future updates.\" You can read the Patch 1.2.3 notes below:\n\nSteam Deck\n\nFixed backgrounds of various menus not displaying properly on the Steam Deck\n\nXbox Game Pass\n\nPC GAMEPASS: PS5 controllers are now compatible\n\nVarious Ultrawide Fixes\n\nGameplay no longer becomes zoomed after a cutscene occurs in ultrawide resolutions\n\nThe Options menu image will no longer be stretched in ultrawide resolutions\n\nCombat UI now adapts correctly to ultrawide resolutions\n\nGame will no longer minimize upon changing settings in ultrawide resolution\n\nCutscenes won’t letterbox in 32:9 aspect ratio\n\nTitle screen now displays fullscreen when the game is launched in ultrawide resolution\n\nMouse and Keyboard\n\nUI button prompts in Expedition Menu are now visible and fully able to be triggered with Keyboard\n\nMouse buttons do not become unresponsive after first use\n\nWith mouse cursor on screen, using 'WSAD' or directional arrows to navigate in UI or trigger any other functionality will no longer hide the cursor instead of doing the intended action\n\nLeft Mouse-button click will no longer block the player from using Keyboard to navigate menus\n\nMouse input is not lost after the first Jump counter attack if it is pressed only once\n\nEach year, the number decreases, erasing more lives. Soon, she will mark “33.” When she does, we will embark on our final mission—to destroy the Paintress and end her deadly cycle for good.\n\nFixed areas of the world map where you can get stuck:\n\nBetween lanterns scattered on the ground near Stone Wave Cliff portal\n\nWhile walking on the ship wreck near the Forgotten Battlefield level entrance\n\nBetween lanterns on the ground near Bourgeon encounter next to Stone Wave Cliffs level\n\nBetween two small rocks located between Spring Meadows and Abbest Cave\n\nBetween vases and corals when jumping from rooftopps\n\nBetween various rocks\n\nIn ruins behind Flying Manor level entrance\n\nNear the bridge between Flying Waters and Spring Meadows\n\nIn the rocks on the World Map, near Flying Waters\n\nNext to hardened land, close to the Flying Waters location exit\n\nFixed situations where Esquie specifically would get stuck (poor guy):\n\nWhen taking off from paint bridges, making him fall through the bridge and restrict movement\n\nWhen flying into bottom parts of levitating structures near Visages\n\nNear the Flying Waters entrance level\n\nNear a giant hammer when traversing close to Blades' Graveyard level\n\nWeapon and skill fixes and tuning:\n\nFixed Lithelim attribute scaling not working at high level. Reduced initial Vitality scaling from A to C (will still end at S at max level). Added Luck scaling starting at D.\n\nFixed Blizzon attribute scaling not working at high level. Reduced initial Luck scaling from B to C (will still end at S at max level). Added Defense scaling starting at D.\n\nFixed Medalum third Lumina doubling all damage in Virtuose Stance instead of doubling only Burn damage.\n\nStendhal: Reduced damage by 40%.\n\nOther fixes\n\nBoss encounter in Stone Wave Cliffs can now be finished on NG+\n\nYou will no longer be blocked by the Journal UI window after opening the first Journal in the Spring Meadows\n\nFixed being unable to shoot in Free aim while exploring levels due to worn triggers\n\nLune and Monoco no longer spawn in same place during end of theirs Level 6 relationship quests if they are completed without going to camp\n\nIf at camp you pick “remember the objective”, then quickly choose to \"go to sleep\" and immediately after press \"leave\", the screen no longer goes black\n\nYou can no longer trigger the \"Discovering the truth\" cutscene in Old Lumière a second time in a row, splitting the party forever with only Verso and Maelle in it.\n\nUpdate to rolling credits\n\nClair Obscur: Expedition 33 is available for PC, PS5, and Xbox Series X/S. You can try it out through Xbox Game Pass if you aren't already one of the 2 million people who have bought the game."
  },
  {
    "source": {
      "id": null,
      "name": "Github.io"
    },
    "author": null,
    "title": "SDFs and the Fast sweeping algorithm in Jax",
    "description": "Talking about the Fast Sweeping Method for solving solutions to the Eikonal equation efficiently",
    "url": "https://rohangautam.github.io/blog/fast_sweeping/fastsweeping/",
    "urlToImage": null,
    "publishedAt": "2025-05-08T09:32:57Z",
    "content": "SDFs and Fast sweeping in JAX\r\nThis is going to be a fun blog - we'll explore the intuition behind level sets, the Eikonal equation, and implement a speedy algorithm for solving this equation, called… [+14380 chars]",
    "full_content": "SDFs and Fast sweeping in JAX\n\n04 May 2025\n\njax,\n\nsimulation\n\nThis is going to be a fun blog - we'll explore the intuition behind level sets, the Eikonal equation, and implement a speedy algorithm for solving this equation, called the fast sweeping method, in JAX.\n\nFig 1: FSM in action\n\nI was recently researching a problem that involved interface evolution over time. Our interface was represented by a set of points. To evolve this interface along its normal direction, we were approximating the normals for these points, extending the points along the normal direction, then resampling them to maintain point density - since, if the shape had expanded, the point density would have decreased. This method of propagating interfaces, involving tracking particles on the front as it evolves, is known as Lagrangian front evolution, and comes with a host of problems, such as resampling issues, handling particles that \"grow into\" a surface, etc.\n\nThe level set method and the eikonal equation #\n\nAn alternative view of propagating interfaces was provided by Sethian and Osher, where they developed the level set theory of propagating interfaces. The key difference is that this is an Eulerian approach - the interface is tracked implicitly on a fixed grid, not as particles on the surface as before. In the level set technique, this implicit representation of the surface is the zero level set of a function. What that means, is that you'll have some function defined on your grid, and the grid points where this function is zero will represent your surface. This function (let's call it ϕ \\phi ϕ) is the level set function, and is a higher order function, with x,y (in 2D) and time as it's inputs. ϕ ( x g r i d , y g r i d , t = k ) \\phi(x_{grid}, y_{grid}, t=k) ϕ(x​grid​​,y​grid​​,t=k) gives you the zero level set at time k k k, describing your interface. It is this function that we want to learn/approximate. Most of the time, the level set function at a specific point in time is the signed distance function.\n\nThe initial value problem defined by the level set theory allows for both positive and negative propagation speeds along the normal. In fact, for most complex problems involving the level set technique, designing an appropriate propagation speed is crucial, as mentioned in Sethian's book. In this blog, we'll consider a simpler case, where the propagation speed is only positive - this is the case in several important applications.\n\nThe equation we'll be looking at solutions of is known as the Eikonal equation, and it looks like this:\n\n∣ ∇ T ∣ F = 1 |\n\nabla T| F=1 ∣∇T∣F=1\n\nThis is a hyperbolic PDE. If you imagine light from a flame propagating from a point, then T T T is the arrival time of the flame at a specific grid point. F F F is the propagation speed, and ∇\n\nabla ∇ is the gradient operator. Both T T T and F F F are functions which take in a spatial vector x x x. You can imagine this being extremely useful in modelling wavefronts - for example, in the Huygens principle, where each point on the new wave acts as a source of secondary wavelets, and the front is a envelope of the outer parts of these wavelets. It's also used in seismic studies - as wave propagation translates directly to these, as well as shortest path problems, medical imaging and so on. More recently, it's also been used to construct signed distance functions (SDFs) of arbitrary geometry, a representation being increasingly used in implicit representations of 3D surfaces in machine learning. For SDFs, F = 1 F=1 F=1.\n\nThe Eikonal equation can develop shocks and singularities, for example, near obstacles or a self-collapsing curve (see Fig 2). Traditional numerical methods for solving the eikonal equation (discretising the PDE into a system of ODEs defined on a grid, use a numerical integrator like Runge-Kutta to solve the ODEs, and so on) do not handle shocks and singularities well. For example, a classical numerical routine for solving this equation in presence of an obstacle would not give you a signed distance function. For this reason, there are other more efficient handcrafted algorithms we can use.\n\nFig 2: Image from [Sethian's paper](https://math.berkeley.edu/~sethian/2006/Papers/sethian.trento.1994.pdf), showing how starting from a cosine front (bottom curve), propagating inward can result in a singularity (sharp point on the front). Also as you can see, markdown doeesnt render here.\n\nFast sweeping method #\n\nThe Fast Marching Method (FMM), introduced by Sethian, solves the Eikonal equation in O ( n log n ) O(n\\log n) O(nlogn) time ( n n n is the grid size), using a heap structure for efficient min/max value queries. The Fast Sweeping Method (FSM), later introduced by Hongkai Zhao in 2005, does this in O ( n ) O(n) O(n) time. That's the one we'll be looking at. We will consider 2D examples, though this algorithm can be generalised to n-D.\n\nFSM performs computations in sweeps - and each sweep approximates the arrival time along one direction, and these are implicitly combined, as the sweeps happen one after the other. There are 2 2 = 4 2^2=4 2​2​​=4 directions in a 2D domain. You can see it in action in the animation in Fig 1, with some bean-shaped initial fronts and an obstacle.\n\nNow that you have some kind of intuition, let's understand the components of this algorithm.\n\nGrid setup: As with any eulerian approximation, you divide your domain into a grid, with a grid spacing of choice. You identify the grid cells that you want the propagation to start from (source cells) and any obstacles in the way. Note that since these cells are marked as \"frozen\" - they do not participate in the computation. The algorithm basically skips these points. You initialise the source points to have an arrival time of 0 - this will be fixed. All other points are initialised to a \"large enough value\" In each sweep, you update the arrival time of the current cell based on values of the neighbouring cells. Here, we locally solve the Eikonal equation. The spatial derivative is approximated by a Godunov upwind difference scheme, which is sensitive to the direction of information flow, something crucial in this problem. Basically, if the \"wave\" is arriving from the bottom for example, it should mainly use values from these cells. You can read more about it here. It sounds like a fancy term, but it really isn't, and is quite simple to implement. Solving the Eikonal equation locally involves solving a quadratic equation (equation 2.4 in Zhao's paper). Sweeps cover the 2 n 2^n 2 ​ n ​ ​ (4 in 2D) combinations of coordinate directions, ensuring information propagating from all relative 'quadrants' (e.g., increasing x / increasing y, decreasing x / increasing y, etc.) is correctly captured by the upwind scheme. As mentioned earlier, the upwind scheme needs to respect the direction of information flow, and each of the 4 sweeps contribute information from a specific direction, which are all combined in the final algorithm.\n\nThere's only so much I can talk about it. To really understand it, do play with the code. I'll first show you the numpy code, which is easier to understand, before moving on to the JAX code. The JAX code is the same logic, but things are reorganised for efficiency with just in time compilation. What I like about these algorithms is that since interface propagation is such a visual problem, seeing their outputs and playing with the code can be really engaging. All the code is available in this repo, and you'll find this demo notebook a good place to start playing with it .\n\nimport numpy as np def fast_sweep_2d ( grid , fixed_cells , obstacle , f , dh , iterations = 5 ) : large_val = 1e3 nx , ny = grid . shape sweep_dirs = [ ( 0 , nx , 1 , 0 , ny , 1 ) , ( nx - 1 , - 1 , - 1 , 0 , ny , 1 ) , ( nx - 1 , - 1 , - 1 , ny - 1 , - 1 , - 1 ) , ( 0 , nx , 1 , ny - 1 , - 1 , - 1 ) , ] padded = np . pad ( grid , pad_width = 1 , mode = \"constant\" , constant_values = large_val ) for _ in range ( iterations ) : for x_start , x_end , x_step , y_start , y_end , y_step in sweep_dirs : for iy in range ( y_start , y_end , y_step ) : for ix in range ( x_start , x_end , x_step ) : if fixed_cells [ iy , ix ] or obstacle [ iy , ix ] : continue py , px = iy + 1 , ix + 1 a = np . min ( ( padded [ py , px - 1 ] , padded [ py , px + 1 ] ) ) b = np . min ( ( padded [ py - 1 , px ] , padded [ py + 1 , px ] ) ) xbar = ( large_val ) if np . abs ( a - b ) >= f * dh : xbar = np . min ( ( a , b ) ) + f * dh else : xbar = ( a + b + np . sqrt ( 2 * ( f * dh ) ** 2 - ( a - b ) ** 2 ) ) / 2 padded [ py , px ] = np . min ( ( padded [ py , px ] , xbar ) ) return padded [ 1 : - 1 , 1 : - 1 ]\n\nYou'd call it like this:\n\nout = fast_sweep_2d ( dist_grid_np , interface_mask , obstacle_mask , f = 1 , dh = dh , iterations = 5 , )\n\nAnd the code in JAX!\n\nimport jax import jax . numpy as jnp from functools import partial @partial ( jax . jit , static_argnames = [ \"iterations\" ] ) def fast_sweep_2d ( grid , fixed_cells , obstacle , f , dh , iterations = 5 ) : large_val = 1e3 nx , ny = grid . shape sweep_dirs = [ ( 0 , nx , 1 , 0 , ny , 1 ) , ( nx - 1 , - 1 , - 1 , 0 , ny , 1 ) , ( nx - 1 , - 1 , - 1 , ny - 1 , - 1 , - 1 ) , ( 0 , nx , 1 , ny - 1 , - 1 , - 1 ) , ] frozen = jnp . logical_or ( fixed_cells , obstacle ) padded = jnp . pad ( grid , pad_width = 1 , mode = \"constant\" , constant_values = large_val ) def run_sweep ( sweep_dir , grid ) : x_start , x_end , x_step , y_start , y_end , y_step = sweep_dir def y_loop_body ( iy , grid ) : def x_loop_body ( ix , grid ) : piy , pix = iy + 1 , ix + 1 a = jnp . minimum ( grid [ piy , pix - 1 ] , grid [ piy , pix + 1 ] ) b = jnp . minimum ( grid [ piy - 1 , pix ] , grid [ piy + 1 , pix ] ) updated_val = jnp . where ( frozen [ iy , ix ] , grid [ piy , pix ] , jnp . minimum ( grid [ piy , pix ] , jnp . where ( jnp . abs ( a - b ) >= f * dh , jnp . minimum ( a , b ) + f * dh , ( a + b + jnp . sqrt ( 2 * ( f * dh ) ** 2 - ( a - b ) ** 2 ) ) / 2 , ) , ) , ) return grid . at [ piy , pix ] . set ( updated_val ) x_indices = jnp . arange ( x_start , x_end , x_step ) return jax . lax . fori_loop ( 0 , len ( x_indices ) , lambda ix , grid : x_loop_body ( x_indices [ ix ] , grid ) , grid , ) y_indices = jnp . arange ( y_start , y_end , y_step ) return jax . lax . fori_loop ( 0 , len ( y_indices ) , lambda iy , grid : y_loop_body ( y_indices [ iy ] , grid ) , grid , ) def iteration_body ( _ , cur_grid ) : grid_s1 = run_sweep ( sweep_dirs [ 0 ] , cur_grid ) grid_s2 = run_sweep ( sweep_dirs [ 1 ] , grid_s1 ) grid_s3 = run_sweep ( sweep_dirs [ 2 ] , grid_s2 ) grid_s4 = run_sweep ( sweep_dirs [ 3 ] , grid_s3 ) return grid_s4 final_grid = jax . lax . fori_loop ( 0 , iterations , iteration_body , padded ) return final_grid [ 1 : - 1 , 1 : - 1 ]\n\nIn action #\n\nHere's an example of the fast sweeping method in action. We have some bean outlines (made here, heh), which I processed to be (greyscale) 0 at the boundary and 255 everywhere else. I've also added an obstacle (in red). We can see that it computes the distance function (not the signed distance function), by noticing the contours inside the beans for a t = 5 t=5 t=5. If you want a SDF, the sign information needs to be available. For example, if we have a matrix of the same shape as the grid, with -1 inside the shape, 0 on the surface, and 1 outside, we could simply multiply this matrix with the distance function to get the signed distance function. I mention SDFs, as using FSM to generate SDFs is quite common. In this case, I have not computed the sign information, so I leave just the distance field below. We use contour lines to visualise the fronts at different time points.\n\nFig 3: Initial setup\n\nFig 4: Calculated distance field with contours for sample arrival times. See Fig 3 for FSM in action.\n\nI ran a few benchmarks on my Apple M2 Pro chip. We can see that the JAX compiled code on CPU is much faster than the numpy code, as expected. Do note the log scale used on the y-axis of this plot. I also compared this with a FMM library - skfmm. The logic in the library is written in C++, making it faster than both approaches discussed here. However, when working with custom FSM approaches for domain-specific problems, I'd trade the speed of skfmm for the ease of hackability and experimentation that I'd get with the python code any day. Of course, you might be comfortable hacking C++ code :)\n\nA note on parallel FSM #"
  },
  {
    "source": {
      "id": null,
      "name": "SiliconANGLE News"
    },
    "author": "Maria Deutscher",
    "title": "D-Wave delivers surprise adjusted profit after quantum computer sale",
    "description": "Quantum computer maker D-Wave Quantum Inc. today posted first quarter results that topped the consensus estimate across the board. The Palo Alto, California-based company generated $15 million in revenue during the first three months of the year. Analysts had…",
    "url": "https://siliconangle.com/2025/05/08/d-wave-delivers-surprise-adjusted-profit-quantum-computer-sale/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2025/05/D-Wave.png",
    "publishedAt": "2025-05-08T21:20:22Z",
    "content": "Quantum computer maker D-Wave Quantum Inc. today posted first-quarter results that topped the consensus estimate across the board.\r\nThe Palo Alto, California-based company generated $15 million in re… [+3346 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "Why D-Wave Quantum Inc. (QBTS) Skyrocketed This Week",
    "description": "We recently published a list of These 10 Stocks Moved the Market This Week, Here’s Why. In this article, we are going to take a look at where D-Wave Quantum Inc. (NYSE:QBTS) stands against other stocks that moved the market this week.\nThe stock market edged l…",
    "url": "https://biztoc.com/x/712b2088da9b9138",
    "urlToImage": "https://biztoc.com/cdn/712b2088da9b9138_s.webp",
    "publishedAt": "2025-05-10T13:52:51Z",
    "content": "We recently published a list of These 10 Stocks Moved the Market This Week, Heres Why. In this article, we are going to take a look at where D-Wave Quantum Inc. (NYSE:QBTS) stands against other stock… [+151 chars]",
    "full_content": "We recently published a list of These 10 Stocks Moved the Market This Week, Here’s Why. In this article, we are going to take a look at where D-Wave Quantum Inc. (NYSE:QBTS) stands against other stocks that moved the market this week.\n\nThe stock market edged lower week-on-week, as cautious…\n\nThis story appeared on finance.yahoo.com , 2025-05-10 13:34:43."
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "investors.com",
    "title": "Quantum Computing Stocks: D-Wave Earnings Beat. Path To Profitability In Sight?",
    "description": "D-Wave Quantum (QBTS) on Thursday reported a smaller-than-expected first quarter loss while revenue topped views as investors focus on the near-term growth outlook for quantum computing stocks. D-Wave stock surged on the news.\nFor the March quarter, D-Wave re…",
    "url": "https://biztoc.com/x/6527be833d892cbe",
    "urlToImage": "https://biztoc.com/cdn/6527be833d892cbe_s.webp",
    "publishedAt": "2025-05-08T17:46:07Z",
    "content": "D-Wave Quantum (QBTS) on Thursday reported a smaller-than-expected first quarter loss while revenue topped views as investors focus on the near-term growth outlook for quantum computing stocks. D-Wav… [+144 chars]",
    "full_content": "D-Wave Quantum (QBTS) on Thursday reported a smaller-than-expected first quarter loss while revenue topped views as investors focus on the near-term growth outlook for quantum computing stocks. D-Wave stock surged on the news.\n\nFor the March quarter, D-Wave reported a 2-cent loss on an…\n\nThis story appeared on investors.com , 2025-05-08 17:05:03."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "D-Wave Quantum (NYSE:QBTS) Shares Gap Down – Here’s Why",
    "description": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) shares gapped down prior to trading on Friday . The stock had previously closed at $10.42, but opened at $9.85. D-Wave Quantum shares last traded at $10.60, with a volume of 17,171,114 shares changing hands. A…",
    "url": "https://www.etfdailynews.com/2025/05/11/d-wave-quantum-nyseqbts-shares-gap-down-heres-why/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/d-wave-quantum-inc-logo-1200x675.png?v=20241011142301&w=240&h=240&zc=2",
    "publishedAt": "2025-05-11T07:42:44Z",
    "content": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) shares gapped down prior to trading on Friday . The stock had previously closed at $10.42, but opened at $9.85. D-Wave Quantum shares last traded at … [+3647 chars]",
    "full_content": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) shares gapped down prior to trading on Friday . The stock had previously closed at $10.42, but opened at $9.85. D-Wave Quantum shares last traded at $10.60, with a volume of 17,171,114 shares changing hands.\n\nAnalysts Set New Price Targets\n\nA number of equities analysts have issued reports on QBTS shares. Roth Mkm upped their target price on D-Wave Quantum from $7.00 to $10.00 and gave the stock a “buy” rating in a report on Friday, March 14th. Needham & Company LLC raised their price objective on shares of D-Wave Quantum from $8.50 to $13.00 and gave the company a “buy” rating in a report on Friday. B. Riley upped their price target on shares of D-Wave Quantum from $11.00 to $12.00 and gave the company a “buy” rating in a research report on Friday, March 14th. Finally, Benchmark reiterated a “buy” rating and set a $8.00 price target on shares of D-Wave Quantum in a report on Friday, March 14th. Six research analysts have rated the stock with a buy rating, According to data from MarketBeat.com, the company currently has a consensus rating of “Buy” and an average target price of $9.17.\n\nGet D-Wave Quantum alerts:\n\nGet Our Latest Research Report on QBTS\n\nD-Wave Quantum Stock Performance\n\nThe company has a market capitalization of $3.23 billion, a P/E ratio of -26.43 and a beta of 0.90. The stock’s 50 day moving average price is $7.41 and its 200 day moving average price is $5.81.\n\nD-Wave Quantum (NYSE:QBTS – Get Free Report) last announced its quarterly earnings results on Monday, May 12th. The company reported ($0.02) earnings per share (EPS) for the quarter, topping the consensus estimate of ($0.05) by $0.03. The firm had revenue of $15.00 million during the quarter, compared to the consensus estimate of $10.50 million. On average, analysts expect that D-Wave Quantum Inc. will post -0.41 earnings per share for the current fiscal year.\n\nHedge Funds Weigh In On D-Wave Quantum\n\nA number of hedge funds have recently added to or reduced their stakes in QBTS. Fourth Dimension Wealth LLC purchased a new position in D-Wave Quantum during the fourth quarter worth about $26,000. PNC Financial Services Group Inc. bought a new position in D-Wave Quantum in the 4th quarter worth about $38,000. Signaturefd LLC grew its stake in D-Wave Quantum by 106.1% during the first quarter. Signaturefd LLC now owns 5,771 shares of the company’s stock valued at $44,000 after acquiring an additional 2,971 shares in the last quarter. Amalgamated Bank increased its holdings in shares of D-Wave Quantum by 107.8% in the first quarter. Amalgamated Bank now owns 6,296 shares of the company’s stock worth $48,000 after purchasing an additional 3,266 shares during the period. Finally, IFP Advisors Inc raised its holdings in shares of D-Wave Quantum by 231.0% in the 1st quarter. IFP Advisors Inc now owns 6,620 shares of the company’s stock valued at $50,000 after acquiring an additional 4,620 shares in the last quarter. Institutional investors and hedge funds own 42.47% of the company’s stock.\n\nAbout D-Wave Quantum\n\n(Get Free Report)\n\nD-Wave Quantum Inc develops and delivers quantum computing systems, software, and services worldwide. The company offers Advantage, a fifth-generation quantum computer; Ocean, a suite of open-source python tools; and Leap, a cloud-based service that provides real-time access to a live quantum computer, as well as access to Advantage, hybrid solvers, the Ocean software development kit, live code, demos, learning resources, and a vibrant developer community.\n\nFeatured Stories\n\nReceive News & Ratings for D-Wave Quantum Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for D-Wave Quantum and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "benzinga.com",
    "title": "Thursday's Top 5 Trending Stocks: What's Going On With D-Wave, Novavax, Carvana?",
    "description": "D-Wave Quantum Inc. (NYSE:QBTS), Asset Entities, Inc. (NASDAQ:ASST), Alphabet, Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL), Novavax, Inc. (NASDAQ:NVAX) and Carvana Co. (NYSE:CVNA) are the top five trending tickers on Stocktwits Thursday. \nHere's a look at what is grabb…",
    "url": "https://biztoc.com/x/2b860ed0b8b818c2",
    "urlToImage": "https://biztoc.com/cdn/2b860ed0b8b818c2_s.webp",
    "publishedAt": "2025-05-08T16:03:58Z",
    "content": "D-Wave Quantum Inc. (NYSE:QBTS), Asset Entities, Inc. (NASDAQ:ASST), Alphabet, Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL), Novavax, Inc. (NASDAQ:NVAX) and Carvana Co. (NYSE:CVNA) are the top five trending tic… [+138 chars]",
    "full_content": "D-Wave Quantum Inc. (NYSE:QBTS), Asset Entities, Inc. (NASDAQ:ASST), Alphabet, Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL), Novavax, Inc. (NASDAQ:NVAX) and Carvana Co. (NYSE:CVNA) are the top five trending tickers on Stocktwits Thursday.\n\nHere's a look at what is grabbing retail investors'…\n\nThis story appeared on benzinga.com , 2025-05-08 15:51:21."
  },
  {
    "source": {
      "id": null,
      "name": "Space Daily"
    },
    "author": null,
    "title": "MIT physicists snap the first images of \"free-range\" atoms",
    "description": "Boston MA (SPX) May 06, 2025\n\n\nMIT physicists have captured the first images of individual atoms freely interacting in space. The pictures reveal correlations among the \"free-range\" particles that until now were predicted but never directly observed. Their fi…",
    "url": "https://www.spacedaily.com/reports/MIT_physicists_snap_the_first_images_of_free_range_atoms_999.html",
    "urlToImage": "https://www.spxdaily.com/images-hg/zurich-superconductors-atom-by-atom-chromium-hg.jpg",
    "publishedAt": "2025-05-06T10:12:01Z",
    "content": "MIT physicists snap the first images of \"free-range\" atomsby Jennifer Chu | MIT NewsBoston MA (SPX) May 06, 2025\r\nMIT physicists have captured the first images of individual atoms freely interacting … [+6927 chars]",
    "full_content": "MIT physicists snap the first images of \"free-range\" atoms\n\n\n\nby Jennifer Chu | MIT News\n\n\n\nBoston MA (SPX) May 06, 2025\n\n\n\nMIT physicists have captured the first images of individual atoms freely interacting in space. The pictures reveal correlations among the \"free-range\" particles that until now were predicted but never directly observed. Their findings, appearing in the journal Physical Review Letters, will help scientists visualize never-before-seen quantum phenomena in real space.\n\nThe images were taken using a technique developed by the team that first allows a cloud of atoms to move and interact freely. The researchers then turn on a lattice of light that briefly freezes the atoms in their tracks, and apply finely tuned lasers to quickly illuminate the suspended atoms, creating a picture of their positions before the atoms naturally dissipate.\n\nThe physicists applied the technique to visualize clouds of different types of atoms, and snapped a number of imaging firsts. The researchers directly observed atoms known as \"bosons,\" which bunched up in a quantum phenomenon to form a wave. They also captured atoms known as \"fermions\" in the act of pairing up in free space - a key mechanism that enables superconductivity.\n\n\"We are able to see single atoms in these interesting clouds of atoms and what they are doing in relation to each other, which is beautiful,\" says Martin Zwierlein, the Thomas A. Frank Professor of Physics at MIT.\n\nIn the same journal issue, two other groups report using similar imaging techniques, including a team led by Nobel laureate Wolfgang Ketterle, the John D. MacArthur Professor of Physics at MIT. Ketterle's group visualized enhanced pair correlations among bosons, while the other group, from Ecole Normale Superieure in Paris, led by Tarik Yefsah, imaged a cloud of noninteracting fermions.\n\nThe study by Zwierlein and his colleagues is co-authored by MIT graduate students Ruixiao Yao, Sungjae Chi, and Mingxuan Wang, and MIT assistant professor of physics Richard Fletcher.\n\nInside the cloud\n\nA single atom is about one-tenth of a nanometer in diameter, which is one-millionth of the thickness of a strand of human hair. Unlike hair, atoms behave and interact according to the rules of quantum mechanics; it is their quantum nature that makes atoms difficult to understand. For example, we cannot simultaneously know precisely where an atom is and how fast it is moving.\n\nScientists can apply various methods to image individual atoms, including absorption imaging, where laser light shines onto the atom cloud and casts its shadow onto a camera screen.\n\n\"These techniques allow you to see the overall shape and structure of a cloud of atoms, but not the individual atoms themselves,\" Zwierlein notes. \"It's like seeing a cloud in the sky, but not the individual water molecules that make up the cloud.\"\n\nHe and his colleagues took a very different approach in order to directly image atoms interacting in free space. Their technique, called \"atom-resolved microscopy,\" involves first corralling a cloud of atoms in a loose trap formed by a laser beam. This trap contains the atoms in one place where they can freely interact. The researchers then flash on a lattice of light, which freezes the atoms in their positions. Then, a second laser illuminates the suspended atoms, whose fluorescence reveals their individual positions.\n\n\"The hardest part was to gather the light from the atoms without boiling them out of the optical lattice,\" Zwierlein says. \"You can imagine if you took a flamethrower to these atoms, they would not like that. So, we've learned some tricks through the years on how to do this. And it's the first time we do it in-situ, where we can suddenly freeze the motion of the atoms when they're strongly interacting, and see them, one after the other. That's what makes this technique more powerful than what was done before.\"\n\nBunches and pairs\n\nThe team applied the imaging technique to directly observe interactions among both bosons and fermions. Photons are an example of a boson, while electrons are a type of fermion. Atoms can be bosons or fermions, depending on their total spin, which is determined by whether the total number of their protons, neutrons, and electrons is even or odd. In general, bosons attract, whereas fermions repel.\n\nZwierlein and his colleagues first imaged a cloud of bosons made up of sodium atoms. At low temperatures, a cloud of bosons forms what's known as a Bose-Einstein condensate - a state of matter where all bosons share one and the same quantum state. MIT's Ketterle was one of the first to produce a Bose-Einstein condensate, of sodium atoms, for which he shared the 2001 Nobel Prize in Physics.\n\nZwierlein's group now is able to image the individual sodium atoms within the cloud, to observe their quantum interactions. It has long been predicted that bosons should \"bunch\" together, having an increased probability to be near each other. This bunching is a direct consequence of their ability to share one and the same quantum mechanical wave. This wave-like character was first predicted by physicist Louis de Broglie. It is the \"de Broglie wave\" hypothesis that in part sparked the beginning of modern quantum mechanics.\n\n\"We understand so much more about the world from this wave-like nature,\" Zwierlein says. \"But it's really tough to observe these quantum, wave-like effects. However, in our new microscope, we can visualize this wave directly.\"\n\nIn their imaging experiments, the MIT team were able to see, for the first time in situ, bosons bunch together as they shared one quantum, correlated de Broglie wave. The team also imaged a cloud of two types of lithium atoms. Each type of atom is a fermion, that naturally repels its own kind, but that can strongly interact with other particular fermion types. As they imaged the cloud, the researchers observed that indeed, the opposite fermion types did interact, and formed fermion pairs - a coupling that they could directly see for the first time.\n\n\"This kind of pairing is the basis of a mathematical construction people came up with to explain experiments. But when you see pictures like these, it's showing in a photograph, an object that was discovered in the mathematical world,\" says study co-author Richard Fletcher. \"So it's a very nice reminder that physics is about physical things. It's real.\"\n\nGoing forward, the team will apply their imaging technique to visualize more exotic and less understood phenomena, such as \"quantum Hall physics\" - situations when interacting electrons display novel correlated behaviors in the presence of a magnetic field.\n\n\"That's where theory gets really hairy - where people start drawing pictures instead of being able to write down a full-fledged theory because they can't fully solve it,\" Zwierlein says. \"Now we can verify whether these cartoons of quantum Hall states are actually real. Because they are pretty bizarre states.\"\n\nResearch Report:\"Measuring pair correlations in Bose and Fermi gases via atom-resolved microscopy\"\n\n\n\nRelated Links\n\nResearch Laboratory of Electronics\n\nUnderstanding Time and Space\n\n"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Traders Buy Large Volume of D-Wave Quantum Call Options (NYSE:QBTS)",
    "description": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) was the recipient of some unusual options trading on Thursday. Stock traders acquired 245,715 call options on the stock. This is an increase of approximately 180% compared to the average volume of 87,810 call …",
    "url": "https://www.etfdailynews.com/2025/05/09/traders-buy-large-volume-of-d-wave-quantum-call-options-nyseqbts/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/d-wave-quantum-inc-logo-1200x675.png?v=20241011142301&w=240&h=240&zc=2",
    "publishedAt": "2025-05-09T05:39:00Z",
    "content": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) was the recipient of some unusual options trading on Thursday. Stock traders acquired 245,715 call options on the stock. This is an increase of appro… [+3874 chars]",
    "full_content": "D-Wave Quantum Inc. (NYSE:QBTS – Get Free Report) was the recipient of some unusual options trading on Thursday. Stock traders acquired 245,715 call options on the stock. This is an increase of approximately 180% compared to the average volume of 87,810 call options.\n\nD-Wave Quantum Stock Performance\n\nShares of QBTS stock opened at $10.53 on Friday. The company has a market capitalization of $3.07 billion, a P/E ratio of -25.06 and a beta of 0.90. D-Wave Quantum has a 52 week low of $0.75 and a 52 week high of $11.95. The company’s 50 day moving average price is $7.29 and its two-hundred day moving average price is $5.71.\n\nGet D-Wave Quantum alerts:\n\nD-Wave Quantum (NYSE:QBTS – Get Free Report) last posted its quarterly earnings data on Monday, May 12th. The company reported ($0.02) EPS for the quarter, beating the consensus estimate of ($0.05) by $0.03. Analysts forecast that D-Wave Quantum will post -0.41 earnings per share for the current year.\n\nWall Street Analyst Weigh In\n\nSeveral equities analysts have recently issued reports on QBTS shares. Roth Mkm boosted their target price on D-Wave Quantum from $7.00 to $10.00 and gave the stock a “buy” rating in a research report on Friday, March 14th. Needham & Company LLC reaffirmed a “buy” rating and issued a $8.50 target price on shares of D-Wave Quantum in a research note on Wednesday, April 2nd. Benchmark reiterated a “buy” rating and issued a $8.00 target price on shares of D-Wave Quantum in a report on Friday, March 14th. Finally, B. Riley boosted their price target on shares of D-Wave Quantum from $11.00 to $12.00 and gave the company a “buy” rating in a report on Friday, March 14th. Six equities research analysts have rated the stock with a buy rating, According to MarketBeat, D-Wave Quantum has an average rating of “Buy” and a consensus target price of $8.42.\n\nRead Our Latest Stock Analysis on D-Wave Quantum\n\nInstitutional Inflows and Outflows\n\nInstitutional investors and hedge funds have recently modified their holdings of the company. Vanguard Group Inc. boosted its position in D-Wave Quantum by 103.7% during the 4th quarter. Vanguard Group Inc. now owns 7,118,322 shares of the company’s stock worth $59,794,000 after acquiring an additional 3,624,407 shares during the last quarter. Bank of America Corp DE lifted its position in shares of D-Wave Quantum by 4,912.4% in the fourth quarter. Bank of America Corp DE now owns 2,548,099 shares of the company’s stock worth $21,404,000 after purchasing an additional 2,497,263 shares in the last quarter. UNICOM Systems Inc. bought a new stake in shares of D-Wave Quantum in the fourth quarter worth $20,258,000. Penserra Capital Management LLC boosted its holdings in D-Wave Quantum by 80.1% during the first quarter. Penserra Capital Management LLC now owns 5,068,199 shares of the company’s stock worth $38,518,000 after purchasing an additional 2,253,741 shares during the last quarter. Finally, Geode Capital Management LLC grew its position in D-Wave Quantum by 33.8% in the third quarter. Geode Capital Management LLC now owns 2,555,927 shares of the company’s stock valued at $2,513,000 after purchasing an additional 645,039 shares in the last quarter. 42.47% of the stock is owned by institutional investors and hedge funds.\n\nD-Wave Quantum Company Profile\n\n(Get Free Report)\n\nD-Wave Quantum Inc develops and delivers quantum computing systems, software, and services worldwide. The company offers Advantage, a fifth-generation quantum computer; Ocean, a suite of open-source python tools; and Leap, a cloud-based service that provides real-time access to a live quantum computer, as well as access to Advantage, hybrid solvers, the Ocean software development kit, live code, demos, learning resources, and a vibrant developer community.\n\nFeatured Articles\n\nReceive News & Ratings for D-Wave Quantum Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for D-Wave Quantum and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Needham & Company LLC Forecasts Strong Price Appreciation for D-Wave Quantum (NYSE:QBTS) Stock",
    "description": "D-Wave Quantum (NYSE:QBTS – Free Report) had its price target hoisted by Needham & Company LLC from $8.50 to $13.00 in a report released on Friday,Benzinga reports. Needham & Company LLC currently has a buy rating on the stock. A number of other research firm…",
    "url": "https://www.etfdailynews.com/2025/05/12/needham-company-llc-forecasts-strong-price-appreciation-for-d-wave-quantum-nyseqbts-stock/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/d-wave-quantum-inc-logo.png?v=20241011142301&w=240&h=240&zc=2",
    "publishedAt": "2025-05-12T07:40:48Z",
    "content": "D-Wave Quantum (NYSE:QBTS – Free Report) had its price target hoisted by Needham &amp; Company LLC from $8.50 to $13.00 in a report released on Friday,Benzinga reports. Needham &amp; Company LLC curr… [+3811 chars]",
    "full_content": "D-Wave Quantum (NYSE:QBTS – Free Report) had its price target hoisted by Needham & Company LLC from $8.50 to $13.00 in a report released on Friday,Benzinga reports. Needham & Company LLC currently has a buy rating on the stock.\n\nA number of other research firms have also weighed in on QBTS. Roth Mkm lifted their target price on D-Wave Quantum from $7.00 to $10.00 and gave the company a “buy” rating in a report on Friday, March 14th. Benchmark reissued a “buy” rating and issued a $8.00 price target on shares of D-Wave Quantum in a report on Friday, March 14th. Finally, B. Riley boosted their price objective on shares of D-Wave Quantum from $11.00 to $12.00 and gave the company a “buy” rating in a research note on Friday, March 14th. Six analysts have rated the stock with a buy rating, According to MarketBeat, the stock presently has an average rating of “Buy” and an average price target of $9.17.\n\nGet D-Wave Quantum alerts:\n\nView Our Latest Analysis on D-Wave Quantum\n\nD-Wave Quantum Price Performance\n\nShares of QBTS stock opened at $11.10 on Friday. The stock has a market capitalization of $3.23 billion, a price-to-earnings ratio of -26.43 and a beta of 0.90. The company’s fifty day simple moving average is $7.41 and its two-hundred day simple moving average is $5.84. D-Wave Quantum has a 1 year low of $0.75 and a 1 year high of $11.95.\n\nD-Wave Quantum (NYSE:QBTS – Get Free Report) last announced its quarterly earnings results on Monday, May 12th. The company reported ($0.02) earnings per share for the quarter, beating the consensus estimate of ($0.05) by $0.03. The company had revenue of $15.00 million during the quarter, compared to analysts’ expectations of $10.50 million. Equities research analysts anticipate that D-Wave Quantum will post -0.41 EPS for the current year.\n\nHedge Funds Weigh In On D-Wave Quantum\n\nSeveral hedge funds and other institutional investors have recently added to or reduced their stakes in the business. Vanguard Group Inc. raised its holdings in shares of D-Wave Quantum by 103.7% in the 4th quarter. Vanguard Group Inc. now owns 7,118,322 shares of the company’s stock valued at $59,794,000 after acquiring an additional 3,624,407 shares in the last quarter. Bank of New York Mellon Corp increased its position in shares of D-Wave Quantum by 40.9% in the fourth quarter. Bank of New York Mellon Corp now owns 219,620 shares of the company’s stock worth $1,845,000 after purchasing an additional 63,799 shares during the last quarter. Commonwealth Equity Services LLC raised its stake in D-Wave Quantum by 1,097.3% in the fourth quarter. Commonwealth Equity Services LLC now owns 228,047 shares of the company’s stock valued at $1,916,000 after purchasing an additional 209,000 shares in the last quarter. Truist Financial Corp purchased a new stake in D-Wave Quantum in the fourth quarter valued at approximately $108,000. Finally, Barclays PLC lifted its position in D-Wave Quantum by 298.3% during the third quarter. Barclays PLC now owns 120,029 shares of the company’s stock valued at $117,000 after purchasing an additional 89,894 shares during the last quarter. 42.47% of the stock is currently owned by hedge funds and other institutional investors.\n\nD-Wave Quantum Company Profile\n\n(Get Free Report)\n\nD-Wave Quantum Inc develops and delivers quantum computing systems, software, and services worldwide. The company offers Advantage, a fifth-generation quantum computer; Ocean, a suite of open-source python tools; and Leap, a cloud-based service that provides real-time access to a live quantum computer, as well as access to Advantage, hybrid solvers, the Ocean software development kit, live code, demos, learning resources, and a vibrant developer community.\n\nRead More\n\nReceive News & Ratings for D-Wave Quantum Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for D-Wave Quantum and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": "politico",
      "name": "Politico"
    },
    "author": "Ankush Khardori",
    "title": "A Clue From the Supreme Court on How It Will Handle Trump",
    "description": "Federal judges throughout the country are losing patience with the administration. Will it be an issue for the Supreme Court?",
    "url": "https://www.politico.com/news/magazine/2025/05/06/trump-justice-department-trust-supreme-court-00329222",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/1fjNTurp3.3WxUmfVaPkxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/politico_453/9a64654964cdc742f61526123bb90831",
    "publishedAt": "2025-05-06T09:55:00Z",
    "content": "It is generally a bad idea to get in the governments crosshairs. After all, the Justice Department has powerful tools at its disposal among them, the vast machinery of federal law enforcement and the… [+13585 chars]",
    "full_content": null
  }
]