[
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Jessica Lyons",
    "title": "You think ransomware is bad now? Wait until it infects CPUs",
    "description": "Rapid7 threat hunter told The Reg wrote a PoC. No he's not releasing it\nRSAC If Rapid7's Christiaan Beek decided to change careers and become a ransomware criminal, he knows exactly how he'd innovate: CPU ransomware.…",
    "url": "https://www.theregister.com/2025/05/11/cpu_ransomware_rapid7/",
    "urlToImage": "https://regmedia.co.uk/2023/06/16/ransomwarebadactor.jpg",
    "publishedAt": "2025-05-11T20:22:08Z",
    "content": "RSAC If Rapid7's Christiaan Beek decided to change careers and become a ransomware criminal, he knows exactly how he'd innovate: CPU ransomware.\r\nThe senior director of  threat analytics for the cybe… [+3369 chars]",
    "full_content": "RSAC If Rapid7's Christiaan Beek decided to change careers and become a ransomware criminal, he knows exactly how he'd innovate: CPU ransomware.\n\nThe senior director of threat analytics for the cybersecurity company got the idea from a bad bug in AMD Zen chips that, if exploited by highly skilled attackers, would allow those intruders to load unapproved microcode into the processors, breaking encryption at the hardware level and modifying CPU behavior at will.\n\nTypically, only chip manufacturers can provide the correct microcode for their CPUs, which they might do to improve performance or fix holes. While it's difficult for outsiders to figure out how to write new microcode, it's not impossible - in the case of the AMD bug, Google demonstrated it could inject microcode to make the chip always choose the number 4 when asked for a random number.\n\n\"Coming from a background in firmware security, I was like, woah, I think I can write some CPU ransomware,\" Beek told The Register.\n\nSpoiler alert: Beek followed through and wrote proof-of-concept code for ransomware that hides in the computer's processor. \"Of course, we won't release that, but it's fascinating, right?\"\n\nThis, according to Beek, is the worst-case scenario. \"Ransomware at the CPU level, microcode alteration, and if you are in the CPU or the firmware, you will bypass every freaking traditional technology we have out there.\"\n\nIt's not an entirely theoretical risk, though honestly very slim right now. There are some indications that criminals are moving toward this end goal, from the UEFI bootkits that go back to 2018 and are now sold on cyber-crime forums to allow miscreants to bypass Secure Boot and embed malware into the firmware, surviving operating system reboots.\n\nMore recently, the 2022 Conti leaks indicated that the ransomware gang's developers were working on firmware ransomware. Beek included some quotes from the Conti chat logs in his RSAC presentation:\n\n\"I am working on a PoC where the ransomware installs itself inside UEFI, so even after reinstalling Windows, the encryption stays.\" \"If we modify the UEFI firmware, we can trigger encryption before the OS even loads. No AV can detect this.\" \"There are already vulnerable UEFI firmware versions that allow unsigned updates. We just need the right exploit.\" \"Imagine we control the BIOS and load our own bootloader that locks the drive until the ransom is paid.\"\n\nWhile Beek says he hasn't yet found a working malware sample in the wild, \"if they worked on it a few years ago, you can bet some of them will get smart enough at some point and start creating this stuff.\"\n\nBeek knows it's possible because he's already done it himself.\n\n\"We should not be talking about ransomware in 2025 — and that fault falls on everyone: the vendors, the end users, cyber insurers,\" Beek told The Register.\n\n\"Twelve years later, we're still fighting the battle,\" he said. \"While we're still seeing a lot of technological evolution, everybody's shouting agentic, AI, ML. And if we're bloody honest, we still haven't fixed our foundations.\"\n\nHow attackers break in \"is not rocket science,\" he added. \"What I'm seeing with a lot of ransomware breaches: it's a high-risk vulnerability, or a weak password, or we haven't deployed multi-factor authentication, or it's wrongly deployed. That is frustrating.\"\n\nWhat should organizations do? Beek urges everyone to focus on cybersecurity basics. \"We spend a lot of our time and money as an industry on innovation,\" he said. \"But at the same time, our cyber hygiene is not improving.\" ®"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Max Juang",
    "title": "Rapid7 (RPD) Reports Earnings Tomorrow: What To Expect",
    "description": "Cybersecurity software maker Rapid7 (NASDAQ:RPD) will be announcing earnings results tomorrow after market close. Here’s what to expect.",
    "url": "https://finance.yahoo.com/news/rapid7-rpd-reports-earnings-tomorrow-173153469.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/o86c2H4OyxFkRsM.67EbMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://media.zenfs.com/en/stockstory_922/1c2b668eac2948e48be86b292edb285b",
    "publishedAt": "2025-05-11T17:31:53Z",
    "content": "Cybersecurity software maker Rapid7 (NASDAQ:RPD) will be announcing earnings results tomorrow after market close. Heres what to expect.\r\nRapid7 beat analysts revenue expectations by 1.9% last quarter… [+1995 chars]",
    "full_content": "Cybersecurity software maker Rapid7 (NASDAQ:RPD) will be announcing earnings results tomorrow after market close. Here’s what to expect.\n\nRapid7 beat analysts’ revenue expectations by 1.9% last quarter, reporting revenues of $216.3 million, up 5.4% year on year. It was a slower quarter for the company, with full-year guidance of slowing revenue growth and full-year EPS guidance missing analysts’ expectations significantly. It added 108 customers to reach a total of 11,727.\n\nIs Rapid7 a buy or sell going into earnings? Read our full analysis here, it’s free.\n\nThis quarter, analysts are expecting Rapid7’s revenue to grow 1.4% year on year to $208 million, slowing from the 12% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $0.34 per share.\n\nRapid7 Total Revenue\n\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. Rapid7 has missed Wall Street’s revenue estimates twice over the last two years.\n\nLooking at Rapid7’s peers in the cybersecurity segment, some have already reported their Q1 results, giving us a hint as to what we can expect. Qualys delivered year-on-year revenue growth of 9.7%, beating analysts’ expectations by 1.8%, and Tenable reported revenues up 10.7%, topping estimates by 2.4%. Qualys’s stock price was unchanged after the resultswhile Tenable was down 9.3%.\n\nRead our full analysis of Qualys’s results here and Tenable’s results here.\n\nThere has been positive sentiment among investors in the cybersecurity segment, with share prices up 12.9% on average over the last month. Rapid7 is up 6.5% during the same time and is heading into earnings with an average analyst price target of $35.21 (compared to the current share price of $25.19).\n\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback."
  },
  {
    "source": {
      "id": null,
      "name": "Internet"
    },
    "author": "info@thehackernews.com (The Hacker News)",
    "title": "SonicWall Patches 3 Flaws in SMA 100 Devices Allowing Attackers to Run Code as Root",
    "description": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities are listed below -\n\nCVE-2025-32819 (CVSS score: 8.8) - A vul…",
    "url": "https://thehackernews.com/2025/05/sonicwall-patches-3-flaws-in-sma-100.html",
    "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiwP_1mxjcUQ5tfmigVsrjlbsaVQkbWo4CpFngWLGAwvtu8_s-kdMhtiKHT62bEcUq3MwoQe7qtpvbXBiHN1x9CBaJUH-o7zCnRafS1Zf31bWQWYpJH5DyQKsveqnoBpLY6Wx7T0hdvGtXtY5CuhWmSV2ZlQhzfRQp8nE9qSJ8OpM9JQh4vPdwozrL24J3K/s728-rw-e365/sonicc.png",
    "publishedAt": "2025-05-08T13:56:00Z",
    "content": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\r\nThe vulnerabilities… [+2014 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Help Net Security"
    },
    "author": "Zeljka Zorz",
    "title": "Yet another SonicWall SMA100 vulnerability exploited in the wild (CVE-2025-32819)",
    "description": "SonicWall has fixed multiple vulnerabilities affecting its SMA100 Series devices, one of which (CVE-2025-32819) appears to be a patch bypass for an arbitrary file delete vulnerability that was exploited in zero-day attacks in early 2021, and may have also bee…",
    "url": "https://www.helpnetsecurity.com/2025/05/08/sonicwall-sma100-vulnerability-exploited-cve-2025-32819/",
    "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2025/01/23094843/sonicwall-1500.webp",
    "publishedAt": "2025-05-08T12:27:59Z",
    "content": "SonicWall has fixed multiple vulnerabilities affecting its SMA100 Series devices, one of which (CVE-2025-32819) appears to be a patch bypass for an arbitrary file delete vulnerability that was exploi… [+3153 chars]",
    "full_content": "SonicWall has fixed multiple vulnerabilities affecting its SMA100 Series devices, one of which (CVE-2025-32819) appears to be a patch bypass for an arbitrary file delete vulnerability that was exploited in zero-day attacks in early 2021, and may have also been leveraged in the wild.\n\nThe vulnerabilities and the attack chain\n\nSonicwall SMA100 Series appliances provide a unified secure access (VPN) gateway for small and medium-size businesses, and are regularly targeted by attackers.\n\nReported by Rapid7 researcher Ryan Emmons, two of the fixed vulnerabilities allow a remote attacker who is able to log in with a low-privilege SMA user account to delete an arbitrary file (CVE-2025-32819) and inject a path traversal sequence to any directory on the SMA appliance to make it writable (CVE-2025-32820).\n\nCVE-2025-32821 can only be exploited by a remote attacker who has achieved admin privileges on the device, and can be used to inject shell command arguments to upload a file on the appliance.\n\nIn a write-up released on Wednesday, Emmons has demonstrated how the three vulnerabilities could be leveraged in a sequence that ends with the attacker gaining root-level remote code execution on a vulnerable SMA device:\n\nCVE-2025-32819 can be exploited remotely to delete the primary SQLite database, which will trigger a system reboot to factory default settings and thus reset the password of the default SMA admin user to “password”\n\nAfter logging in as admin to the SMA web interface, CVE-2025-32820 can be exploited to make a specific directory writable\n\nCVE-2025-32821 can be leveraged to write a malicious executable file into the directory, which will be executed by the device\n\n“Based on our testing, the unauthenticated arbitrary file delete vulnerability disclosed by NCC Group [in 2021] was patched by adding an authentication check. However, that authentication check is satisfied with a valid low-privilege session cookie, so exploitation is still viable,” Emmons explained.\n\nThus CVE-2025-32819, an authenticated arbitrary file delete vulnerability, can be similarly exploited, but only if the attacker obtains valid account credentials for a SMA user account. Unfortunately, those can be easily sourced from the dark web or stolen via phishing or malware.\n\nUpgrade and investigate\n\nBased on known private inficators of compromise and Rapid7 incident response investigations, Rapid7 believes that CVE-2025-32819 “may have been used in the wild.”\n\nSonicWall advises customers to upgrade their SMA 100 Series devices (SMA 200, 210, 400, 410, 500v) to firmware version 10.2.1.15-81sv and higher, protect\n\nuser accounts by enabling multifactor authentication (MFA), and enable the built-in web application firewall feature to mitigate the risk of exploitation.\n\n“SonicWall PSIRT recommends that customers review their SMA devices to ensure [there have been] no unauthorized logins,” the company also said, and confirmed that SMA1000 Series appliances are not affected by these vulnerabilities.\n\nFinally, resetting the passwords for all users who have logged in to the device(s) via the web interface is a good idea, especially if the accounts don’t have MFA enabled.\n\nSubscribe to our breaking news e-mail alert to never miss out on the latest breaches, vulnerabilities and cybersecurity threats. Subscribe here!"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Rapid7 (RPD) Expected to Announce Quarterly Earnings on Monday",
    "description": "Rapid7 (NASDAQ:RPD – Get Free Report) is anticipated to post its Q1 2025 quarterly earnings results after the market closes on Monday, May 12th. Analysts expect the company to announce earnings of $0.37 per share and revenue of $208.25 million for the quarter…",
    "url": "https://www.etfdailynews.com/2025/05/11/rapid7-rpd-expected-to-announce-quarterly-earnings-on-monday/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/rapid7-inc-logo-1200x675.png&w=240&h=240&zc=2",
    "publishedAt": "2025-05-11T06:02:56Z",
    "content": "Rapid7 (NASDAQ:RPD – Get Free Report) is anticipated to post its Q1 2025 quarterly earnings results after the market closes on Monday, May 12th. Analysts expect the company to announce earnings of $0… [+3786 chars]",
    "full_content": "Rapid7 (NASDAQ:RPD – Get Free Report) is anticipated to post its Q1 2025 quarterly earnings results after the market closes on Monday, May 12th. Analysts expect the company to announce earnings of $0.37 per share and revenue of $208.25 million for the quarter. Rapid7 has set its FY 2025 guidance at 1.720-1.850 EPS and its Q1 2025 guidance at 0.330-0.360 EPS.\n\nRapid7 (NASDAQ:RPD – Get Free Report) last released its quarterly earnings results on Wednesday, February 12th. The technology company reported $0.12 earnings per share for the quarter, missing analysts’ consensus estimates of $0.50 by ($0.38). Rapid7 had a negative return on equity of 130.41% and a net margin of 3.46%. On average, analysts expect Rapid7 to post $0 EPS for the current fiscal year and $1 EPS for the next fiscal year.\n\nGet Rapid7 alerts:\n\nRapid7 Price Performance\n\nRapid7 stock opened at $25.14 on Friday. The company has a market cap of $1.61 billion, a price-to-earnings ratio of 64.46 and a beta of 1.06. The firm has a 50-day moving average of $25.63 and a 200-day moving average of $34.33. Rapid7 has a one year low of $21.61 and a one year high of $44.48.\n\nAnalysts Set New Price Targets\n\nA number of equities research analysts have recently issued reports on RPD shares. Jefferies Financial Group dropped their price objective on Rapid7 from $45.00 to $35.00 and set a “buy” rating on the stock in a research note on Monday, March 31st. Raymond James dropped their target price on shares of Rapid7 from $55.00 to $45.00 and set an “outperform” rating on the stock in a report on Thursday, February 13th. Robert W. Baird reduced their price target on Rapid7 from $43.00 to $39.00 and set a “neutral” rating for the company in a report on Thursday, February 13th. StockNews.com raised Rapid7 from a “hold” rating to a “buy” rating in a research report on Friday, February 21st. Finally, JPMorgan Chase & Co. decreased their target price on Rapid7 from $42.00 to $40.00 and set a “neutral” rating on the stock in a report on Tuesday, February 11th. Fourteen investment analysts have rated the stock with a hold rating, seven have given a buy rating and one has issued a strong buy rating to the company’s stock. Based on data from MarketBeat.com, Rapid7 currently has an average rating of “Hold” and an average target price of $37.32.\n\nGet Our Latest Report on RPD\n\nInsiders Place Their Bets\n\nIn other news, insider Christina Luconi sold 12,551 shares of the business’s stock in a transaction that occurred on Monday, April 7th. The shares were sold at an average price of $23.12, for a total value of $290,179.12. Following the completion of the transaction, the insider now directly owns 58,165 shares in the company, valued at approximately $1,344,774.80. The trade was a 17.75 % decrease in their position. The sale was disclosed in a filing with the Securities & Exchange Commission, which can be accessed through this hyperlink. Company insiders own 2.60% of the company’s stock.\n\nAbout Rapid7\n\n(Get Free Report)\n\nRapid7, Inc provides cybersecurity solutions under the Rapid7, Nexpose, and Metasploit brand names. The company offers endpoint to cloud data collection and sharing applications, such as Rapid7 Insight Agent, a software-based agent that is used on assets across on-premises and cloud environments to centralize and monitor data on company's platform; Rapid7 Insight Network Sensor that analyzes raw end-to-end network traffic to increase visibility into user activity, pinpoint real threats, and investigations; Rapid7 Cloud Event Data Harvesting that offers visibility into changes made to cloud resources; and third-party integrations and ecosystem, as well as orchestration and automation solutions.\n\nFurther Reading\n\nReceive News & Ratings for Rapid7 Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Rapid7 and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Northern Trust Corp Boosts Holdings in Rapid7, Inc. (NASDAQ:RPD)",
    "description": "Northern Trust Corp raised its holdings in Rapid7, Inc. (NASDAQ:RPD – Free Report) by 8.0% in the 4th quarter, Holdings Channel reports. The institutional investor owned 624,936 shares of the technology company’s stock after acquiring an additional 46,351 sha…",
    "url": "https://www.etfdailynews.com/2025/05/12/northern-trust-corp-boosts-holdings-in-rapid7-inc-nasdaqrpd/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/rapid7-inc-logo-1200x675.png&w=240&h=240&zc=2",
    "publishedAt": "2025-05-12T07:48:48Z",
    "content": "Northern Trust Corp raised its holdings in Rapid7, Inc. (NASDAQ:RPD – Free Report) by 8.0% in the 4th quarter, Holdings Channel reports. The institutional investor owned 624,936 shares of the technol… [+5405 chars]",
    "full_content": "Northern Trust Corp raised its holdings in Rapid7, Inc. (NASDAQ:RPD – Free Report) by 8.0% in the 4th quarter, Holdings Channel reports. The institutional investor owned 624,936 shares of the technology company’s stock after acquiring an additional 46,351 shares during the period. Northern Trust Corp’s holdings in Rapid7 were worth $25,141,000 at the end of the most recent quarter.\n\nSeveral other hedge funds and other institutional investors also recently added to or reduced their stakes in the business. Pacer Advisors Inc. grew its holdings in Rapid7 by 30.4% in the 4th quarter. Pacer Advisors Inc. now owns 1,487 shares of the technology company’s stock valued at $60,000 after buying an additional 347 shares during the period. Exchange Traded Concepts LLC lifted its stake in shares of Rapid7 by 0.6% in the 4th quarter. Exchange Traded Concepts LLC now owns 69,154 shares of the technology company’s stock valued at $2,782,000 after purchasing an additional 446 shares in the last quarter. Skandinaviska Enskilda Banken AB publ lifted its stake in shares of Rapid7 by 68.8% in the 4th quarter. Skandinaviska Enskilda Banken AB publ now owns 1,116 shares of the technology company’s stock valued at $46,000 after purchasing an additional 455 shares in the last quarter. Ostrum Asset Management lifted its stake in shares of Rapid7 by 45.3% in the 4th quarter. Ostrum Asset Management now owns 2,478 shares of the technology company’s stock valued at $100,000 after purchasing an additional 772 shares in the last quarter. Finally, KBC Group NV lifted its stake in shares of Rapid7 by 47.7% in the 4th quarter. KBC Group NV now owns 2,686 shares of the technology company’s stock valued at $108,000 after purchasing an additional 867 shares in the last quarter. Hedge funds and other institutional investors own 95.66% of the company’s stock.\n\nGet Rapid7 alerts:\n\nInsider Activity at Rapid7\n\nIn other Rapid7 news, insider Christina Luconi sold 12,551 shares of the stock in a transaction on Monday, April 7th. The stock was sold at an average price of $23.12, for a total value of $290,179.12. Following the sale, the insider now directly owns 58,165 shares of the company’s stock, valued at $1,344,774.80. This trade represents a 17.75% decrease in their ownership of the stock. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available at this link. Corporate insiders own 2.60% of the company’s stock.\n\nRapid7 Trading Down 0.4%\n\nRPD stock opened at $25.14 on Monday. The firm has a market cap of $1.61 billion, a P/E ratio of 64.46 and a beta of 1.06. Rapid7, Inc. has a 12-month low of $21.61 and a 12-month high of $44.48. The stock’s 50 day simple moving average is $25.63 and its 200 day simple moving average is $34.30.\n\nRapid7 (NASDAQ:RPD – Get Free Report) last posted its quarterly earnings results on Wednesday, February 12th. The technology company reported $0.12 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.50 by ($0.38). Rapid7 had a net margin of 3.46% and a negative return on equity of 130.41%. On average, research analysts forecast that Rapid7, Inc. will post 0.35 EPS for the current fiscal year.\n\nAnalyst Upgrades and Downgrades\n\nSeveral equities analysts have recently weighed in on the company. UBS Group reduced their price objective on Rapid7 from $52.00 to $45.00 and set a “buy” rating on the stock in a research note on Thursday, February 13th. Stifel Nicolaus reduced their price objective on Rapid7 from $42.00 to $38.00 and set a “hold” rating on the stock in a research note on Thursday, February 13th. Morgan Stanley reduced their price objective on Rapid7 from $33.00 to $26.00 and set an “equal weight” rating on the stock in a research note on Wednesday, April 16th. Scotiabank reduced their price target on Rapid7 from $42.00 to $38.00 and set a “sector perform” rating on the stock in a research report on Thursday, February 13th. Finally, Citigroup reduced their price target on Rapid7 from $46.00 to $44.00 and set a “buy” rating on the stock in a research report on Thursday, February 13th. Fourteen research analysts have rated the stock with a hold rating, seven have given a buy rating and one has assigned a strong buy rating to the company’s stock. According to MarketBeat.com, the stock has an average rating of “Hold” and an average price target of $37.32.\n\nView Our Latest Report on RPD\n\nRapid7 Company Profile\n\n(Free Report)\n\nRapid7, Inc provides cybersecurity solutions under the Rapid7, Nexpose, and Metasploit brand names. The company offers endpoint to cloud data collection and sharing applications, such as Rapid7 Insight Agent, a software-based agent that is used on assets across on-premises and cloud environments to centralize and monitor data on company's platform; Rapid7 Insight Network Sensor that analyzes raw end-to-end network traffic to increase visibility into user activity, pinpoint real threats, and investigations; Rapid7 Cloud Event Data Harvesting that offers visibility into changes made to cloud resources; and third-party integrations and ecosystem, as well as orchestration and automation solutions.\n\nSee Also\n\nWant to see what other hedge funds are holding RPD? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Rapid7, Inc. (NASDAQ:RPD – Free Report).\n\nReceive News & Ratings for Rapid7 Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Rapid7 and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Hsbc Holdings PLC Sells 33,054 Shares of Rapid7, Inc. (NASDAQ:RPD)",
    "description": "Hsbc Holdings PLC decreased its position in shares of Rapid7, Inc. (NASDAQ:RPD – Free Report) by 70.8% in the 4th quarter, according to the company in its most recent 13F filing with the SEC. The fund owned 13,623 shares of the technology company’s stock afte…",
    "url": "https://www.etfdailynews.com/2025/05/07/hsbc-holdings-plc-sells-33054-shares-of-rapid7-inc-nasdaqrpd/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/rapid7-inc-logo-1200x675.png&w=240&h=240&zc=2",
    "publishedAt": "2025-05-07T08:05:14Z",
    "content": "Hsbc Holdings PLC decreased its position in shares of Rapid7, Inc. (NASDAQ:RPD – Free Report) by 70.8% in the 4th quarter, according to the company in its most recent 13F filing with the SEC. The fun… [+5299 chars]",
    "full_content": "Hsbc Holdings PLC decreased its position in shares of Rapid7, Inc. (NASDAQ:RPD – Free Report) by 70.8% in the 4th quarter, according to the company in its most recent 13F filing with the SEC. The fund owned 13,623 shares of the technology company’s stock after selling 33,054 shares during the quarter. Hsbc Holdings PLC’s holdings in Rapid7 were worth $547,000 as of its most recent SEC filing.\n\nA number of other hedge funds and other institutional investors have also recently modified their holdings of the company. Nordea Investment Management AB boosted its position in shares of Rapid7 by 100.8% during the 4th quarter. Nordea Investment Management AB now owns 75,109 shares of the technology company’s stock valued at $3,030,000 after purchasing an additional 37,708 shares in the last quarter. Diversified Trust Co boosted its holdings in shares of Rapid7 by 8.6% during the 4th quarter. Diversified Trust Co now owns 21,534 shares of the technology company’s stock worth $866,000 after buying an additional 1,708 shares in the last quarter. Harbor Capital Advisors Inc. grew its position in shares of Rapid7 by 259.1% during the 4th quarter. Harbor Capital Advisors Inc. now owns 288,965 shares of the technology company’s stock worth $11,625,000 after buying an additional 208,501 shares during the period. Assenagon Asset Management S.A. increased its stake in shares of Rapid7 by 106.9% in the 4th quarter. Assenagon Asset Management S.A. now owns 49,155 shares of the technology company’s stock valued at $1,978,000 after acquiring an additional 25,398 shares in the last quarter. Finally, SG Americas Securities LLC lifted its position in shares of Rapid7 by 126.6% during the 4th quarter. SG Americas Securities LLC now owns 9,908 shares of the technology company’s stock valued at $399,000 after acquiring an additional 5,536 shares during the period. Institutional investors and hedge funds own 95.66% of the company’s stock.\n\nGet Rapid7 alerts:\n\nRapid7 Stock Performance\n\nRPD opened at $24.07 on Wednesday. The firm has a market cap of $1.55 billion, a P/E ratio of 61.72 and a beta of 1.06. Rapid7, Inc. has a fifty-two week low of $21.61 and a fifty-two week high of $46.39. The firm has a 50-day moving average of $25.85 and a 200 day moving average of $34.61.\n\nInsider Activity\n\nRapid7 ( NASDAQ:RPD Get Free Report ) last issued its quarterly earnings results on Wednesday, February 12th. The technology company reported $0.12 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.50 by ($0.38). Rapid7 had a negative return on equity of 130.41% and a net margin of 3.46%. Equities research analysts predict that Rapid7, Inc. will post 0.35 earnings per share for the current fiscal year.\n\nIn other news, insider Christina Luconi sold 12,551 shares of the business’s stock in a transaction that occurred on Monday, April 7th. The shares were sold at an average price of $23.12, for a total value of $290,179.12. Following the sale, the insider now owns 58,165 shares of the company’s stock, valued at $1,344,774.80. The trade was a 17.75 % decrease in their ownership of the stock. The transaction was disclosed in a document filed with the SEC, which is available at the SEC website. Insiders own 2.60% of the company’s stock.\n\nAnalysts Set New Price Targets\n\nA number of equities research analysts have commented on RPD shares. Stifel Nicolaus reduced their price target on shares of Rapid7 from $42.00 to $38.00 and set a “hold” rating for the company in a report on Thursday, February 13th. Citigroup decreased their target price on Rapid7 from $46.00 to $44.00 and set a “buy” rating for the company in a research report on Thursday, February 13th. Robert W. Baird cut their price target on Rapid7 from $43.00 to $39.00 and set a “neutral” rating on the stock in a report on Thursday, February 13th. Stephens started coverage on Rapid7 in a report on Tuesday, April 1st. They set an “equal weight” rating and a $33.00 price objective for the company. Finally, DA Davidson cut their target price on Rapid7 from $35.00 to $29.00 and set a “neutral” rating on the stock in a report on Tuesday, March 25th. Fifteen investment analysts have rated the stock with a hold rating, seven have assigned a buy rating and one has assigned a strong buy rating to the company’s stock. According to data from MarketBeat, the company presently has a consensus rating of “Hold” and a consensus target price of $37.32.\n\nCheck Out Our Latest Stock Report on Rapid7\n\nRapid7 Profile\n\n(Free Report)\n\nRapid7, Inc provides cybersecurity solutions under the Rapid7, Nexpose, and Metasploit brand names. The company offers endpoint to cloud data collection and sharing applications, such as Rapid7 Insight Agent, a software-based agent that is used on assets across on-premises and cloud environments to centralize and monitor data on company's platform; Rapid7 Insight Network Sensor that analyzes raw end-to-end network traffic to increase visibility into user activity, pinpoint real threats, and investigations; Rapid7 Cloud Event Data Harvesting that offers visibility into changes made to cloud resources; and third-party integrations and ecosystem, as well as orchestration and automation solutions.\n\nRead More\n\nReceive News & Ratings for Rapid7 Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Rapid7 and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "BleepingComputer"
    },
    "author": "Sergiu Gatlan",
    "title": "SonicWall urges admins to patch VPN flaw exploited in attacks",
    "description": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks [...]",
    "url": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-patch-vpn-flaw-exploited-in-attacks/",
    "urlToImage": "https://www.bleepstatic.com/content/hl-images/2025/05/08/SonicWall.jpg",
    "publishedAt": "2025-05-08T11:19:58Z",
    "content": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks.\r\nDiscovered and reported by … [+2608 chars]",
    "full_content": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks.\n\nDiscovered and reported by Rapid7 cybersecurity researcher Ryan Emmons, the three security flaws (CVE-2025-32819, CVE-2025-32820, and CVE-2025-32821) can be chained by attackers to gain remote code execution as root and compromise vulnerable instances.\n\nThe vulnerabilities impact SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and are patched in firmware version 10.2.1.15-81sv and higher.\n\n\"SonicWall strongly advises users of the SMA 100 series products (SMA 200, 210, 400, 410, and 500v) to upgrade to the mentioned fixed release version to address these vulnerabilities,\" SonicWall said in a Wednesday advisory.\n\nSuccessful exploitation of CVE-2025-32819 allows threat actors to delete the primary SQLite database, reset the password of the default SMA admin user, and log in as admin to the SMA web interface. Next, they can exploit the CVE-2025-32820 path traversal vulnerability to make the /bin folder writable and then gain remote code execution as root by exploiting CVE-2025-32821.\n\n\"An attacker with access to an SMA SSLVPN user account can chain these vulnerabilities to make a sensitive system directory writable, elevate their privileges to SMA administrator, and write an executable file to a system directory. This chain results in root-level remote code execution,\" Rapid7 said.\n\n\"Based on known (private) IOCs and Rapid7 incident response investigations, we believe this vulnerability may have been used in the wild.\"\n\nSonicWall advised admins to check their SMA devices' logs for any signs of unauthorized logins and enable the web application firewall and multifactor authentication (MFA) on their SMA100 appliances as a safety measure.\n\nLast week, SonicWall warned customers that two other vulnerabilities (CVE-2023-44221 and CVE-2024-38475) affecting SMA appliances are now actively exploited in attacks to inject commands and execute code remotely.\n\nThe company flagged another high-severity flaw (CVE-2021-20035) as exploited in remote code execution attacks targeting SMA100 VPN appliances in April. One day later, cybersecurity company Arctic Wolf revealed the security bug had been under active exploitation since at least January 2025.\n\nIn January, SonicWall also urged admins to patch a critical flaw in SMA1000 secure access gateways exploited in zero-day attacks, and one month later warned of an actively exploited authentication bypass flaw impacting Gen 6 and Gen 7 firewalls that lets hackers hijack VPN sessions."
  },
  {
    "source": {
      "id": null,
      "name": "Help Net Security"
    },
    "author": "Zeljka Zorz",
    "title": "LockBit hacked: What does the leaked data show?",
    "description": "The affiliate panel of the infamous LockBit Ransomware-as-a-Service (RaaS) group has been hacked and defaced, showing a link to a MySQL database dump ostensibly containing leaked data relating to the group’s operations: The defaced dark web affiliate panel (S…",
    "url": "https://www.helpnetsecurity.com/2025/05/09/lockbit-hacked-data-leaked/",
    "urlToImage": "https://img.helpnetsecurity.com/wp-content/uploads/2024/02/26145946/lockbit-hands.jpg",
    "publishedAt": "2025-05-09T11:27:59Z",
    "content": "The affiliate panel of the infamous LockBit Ransomware-as-a-Service (RaaS) group has been hacked and defaced, showing a link to a MySQL database dump ostensibly containing leaked data relating to the… [+3547 chars]",
    "full_content": "The affiliate panel of the infamous LockBit Ransomware-as-a-Service (RaaS) group has been hacked and defaced, showing a link to a MySQL database dump ostensibly containing leaked data relating to the group’s operations:\n\nThe defaced dark web affiliate panel (Source: Help Net Security)\n\nThe breach has been confirmed by LockBitSupp – the creator, developer and administator of the LockBit ransomware group – who downplayed the attack by saying that decryptors, stolen company data, and the ransomware source code haven’t been compromised.\n\nThe dump of the backend MySQL database was apparently generated on April 29, 2025, and contains:\n\nNearly 60,000 unique bitcoin addresses / wallets\n\nCustom versions of the ransomware created for specific attacks and the associated public keys\n\nNearly 4,500 negotiation messages exchanged by the ransomware operators and victims\n\nA list of 76 affiliates (i.e., users of the affiliate panel)\n\nThe leaked data will help investigators\n\nSpeculation abounds on the person or group behind the breach, but in cybersecurity circles excitement can be felt due to the leaked data that – many have noted – looks to be legitimate.\n\n“Early analysis of the data itself reveals that it is partly composed of ‘user data’ for the LockBit site, almost certainly relating to affiliates or administrators of the group. We have identified 76 users in the data, whose usernames and passwords are contained in the leak,” Luke Donovan, Head of Threat Intelligence at Searchlight Cyber, told Help Net Security.\n\n“This user data will prove to be valuable for cybersecurity researchers, as it allows us to learn more about the affiliates of LockBit and how they operate. For example, within those 76 users, 22 users have TOX IDs associated with them, which is a messaging service popular in the hacking community. These TOX IDs have allowed us to associate three of the leaked users with aliases on hacking forums, who use the same TOX IDs. By analysing their conversations on hacking forums we’ll be able to learn more about the group, for example the types of access they buy to hack organizations.”\n\nChristiaan Beek, Senior Director of Threat Analytics at Rapid7, noted that the negotiation messages show how aggressive LockBit is during ransom negotiations.\n\nIt’s unknown how many of those ransoms have been paid out, but the messages offer a peek into how LockBit’s affiliates negotiate with victims and show that LockBit affiliates attack organizations big and small.\n\n“In some cases, victims were pressured to pay just a few thousand dollars. In others, the group demanded much more: $50,000, $60,000, or even $100,000,” Beek pointed out.\n\nLockBit crippled but not crushed\n\nThe LockBit operation has suffered a major blow in 2024, when an international law enforcement operation (“Operation Cronos”) took over its dark web leak site and additional infrastructure.\n\nThe law enforcement action also led to the arrest and/or indictment of several LockBit affiliates in Poland, Ukraine and Russia, the freezing of over 200 cryptocurrency accounts linked to the group, and takedown of servers.\n\nA few months later, the alleged identity of LockBitSupp was revealed and a few months after that, an individual was indicted for allegedly developing software for the ransomware group.\n\nThough it was hit hard, the LockBit outfit obviously managed to weather that storm and continue operations and recruiting affiliates. Time will tell whether this latest blow will result in the threat actors ditching the LockBit brand and setting up a new criminal outfit.\n\nSubscribe to our breaking news e-mail alert to never miss out on the latest breaches, vulnerabilities and cybersecurity threats. Subscribe here!"
  },
  {
    "source": {
      "id": null,
      "name": "CNA"
    },
    "author": null,
    "title": "Ransomware group Lockbit appears to have been hacked, analysts say",
    "description": "WASHINGTON :The ransom-seeking cybercriminals behind the extortion group Lockbit appear to have suffered a breach of their own, according to a rogue post to one of the group's websites and security analysts who follow the gang.On Wednesday one of Lockbit's da…",
    "url": "https://www.channelnewsasia.com/business/ransomware-group-lockbit-appears-have-been-hacked-analysts-say-5118471",
    "urlToImage": "https://dam.mediacorp.sg/image/upload/s--rmGtKJnO--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-08t212403z_1_lynxmpel4718p_rtroptp_3_cyber-attack.jpg?itok=9tboZH6R",
    "publishedAt": "2025-05-08T20:35:18Z",
    "content": "WASHINGTON :The ransom-seeking cybercriminals behind the extortion group Lockbit appear to have suffered a breach of their own, according to a rogue post to one of the group's websites and security a… [+1580 chars]",
    "full_content": "(This May 8 story has been corrected to capitalize the 'D' in 'DiMaggio', in paragraphs 8 and 9)\n\nBy Raphael Satter\n\nWASHINGTON : The ransom-seeking cybercriminals behind the extortion group Lockbit appear to have suffered a breach of their own, according to a rogue post to one of the group's websites and security analysts who follow the gang.\n\nOn Wednesday one of Lockbit's darkweb sites was replaced with a message saying, \"Don't do crime CRIME IS BAD xoxo from Prague\" and a link to an apparent cache of leaked data.\n\nSubscribe to our Chief Editor’s Week in Review Our chief editor shares analysis and picks of the week's biggest news every Saturday. This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp’s partners. Loading Loading\n\nReuters could not immediately verify the data, which appeared to capture chats between the hackers and their victims, among other things. But others who sifted through the material told Reuters it appeared authentic.\n\n\"It's legit,\" said Jon DiMaggio, the chief security strategist with the cybersecurity company Analyst1.\n\nChristiaan Beek, senior director of threat analytics at cybersecurity firm Rapid7, agreed the leak \"looks really authentic.\" He said he was struck by how it showed Lockbit's hackers hustling even for modest payouts from small businesses.\n\n\"They attack everyone,\" he said.\n\nReuters could not immediately reach Lockbit or establish who had apparently leaked their data. Some darkweb sites associated with Lockbit appeared to be inoperative on Thursday, displaying a note saying they would be \"working soon.\"\n\nLockbit is one of the world's most prolific cyber extortion gangs - DiMaggio once called it \"the Walmart of ransomware groups\" - and it has survived past disruptions. Last year British and U.S. officials worked with a coalition of international law enforcement agencies to seize some of the gang's infrastructure. A few days later, the group defiantly announced it was back online, saying, \"I cannot be stopped.\"\n\nBehind the bravado, DiMaggio said this week's hack was an embarrassment.\n\n\"I think it will hurt them and slow them down,\" he said."
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "go.theregister.com",
    "title": "You think ransomware is bad now? Wait until it infects CPUs",
    "description": "You think ransomware is bad now? Wait until it infects CPUs\nRapid7 threat hunter told The Reg wrote a PoC. No he's not releasing it\nRSAC If Rapid7's Christiaan Beek decided to change careers and become a ransomware criminal, he knows exactly how he'd innovate…",
    "url": "https://biztoc.com/x/c28617b9976a8c35",
    "urlToImage": "https://biztoc.com/cdn/c28617b9976a8c35_s.webp",
    "publishedAt": "2025-05-11T20:34:48Z",
    "content": "You think ransomware is bad now? Wait until it infects CPUsRapid7 threat hunter told The Reg wrote a PoC. No he's not releasing itRSAC If Rapid7's Christiaan Beek decided to change careers and become… [+149 chars]",
    "full_content": "You think ransomware is bad now? Wait until it infects CPUs\n\nRapid7 threat hunter told The Reg wrote a PoC. No he's not releasing it\n\nRSAC If Rapid7's Christiaan Beek decided to change careers and become a ransomware criminal, he knows exactly how he'd innovate: CPU ransomware.\n\nThe senior…\n\nThis story appeared on go.theregister.com , 2025-05-11 20:22:08."
  },
  {
    "source": {
      "id": "newsweek",
      "name": "Newsweek"
    },
    "author": "Jenna Sundel",
    "title": "Woman Who Called Kid N-Word Raises Over $700K in Just 5 Days",
    "description": "A woman who was filmed calling a young Black child the n-word at a local park has raised over $700,000 through an online fundraiser.",
    "url": "https://www.newsweek.com/woman-who-called-kid-n-word-raises-over-700000-2068587",
    "urlToImage": "https://d.newsweek.com/en/full/2639359/shiloh-hendrix.png",
    "publishedAt": "2025-05-06T14:36:35Z",
    "content": "A Minnesota woman who was filmed calling a young Black child the n-word at a local park has raised over $700,000 through an online fundraiser after she said that she needs to relocate her family for … [+4659 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "SiliconANGLE News"
    },
    "author": "Robert Hof",
    "title": "Enterprise stalwarts get serious about AI agents",
    "description": "Established enterprise tech providers that aren’t cloud giants are getting serious about AI agents too. IBM, for one, unveiled a raft of AI agent capabilities and ServiceNow invaded Salesforce’s core customer relationship management market using agents and de…",
    "url": "https://siliconangle.com/2025/05/09/enterprise-stalwarts-get-serious-ai-agents/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2025/05/a-photograph-of-three-sharply-dressed-bu_nmRMKP3aRsCqJt8cxX-uBQ_JRmLR2hVTP2VkaIKfJC3Zg.jpeg",
    "publishedAt": "2025-05-09T14:33:53Z",
    "content": "Established enterprise tech providers that arent cloud giants are getting serious about AI agents too.\r\nIBM, for one, unveiled a raft of AI agent capabilities and ServiceNow invaded Salesforces core … [+11328 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Royal Bank of Canada Lowers Bumble (NASDAQ:BMBL) Price Target to $5.00",
    "description": "Bumble (NASDAQ:BMBL – Get Free Report) had its price objective lowered by analysts at Royal Bank of Canada from $7.00 to $5.00 in a research report issued to clients and investors on Thursday,Benzinga reports. The firm currently has an “outperform” rating on …",
    "url": "https://www.etfdailynews.com/2025/05/10/royal-bank-of-canada-lowers-bumble-nasdaqbmbl-price-target-to-5-00/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/bumble-inc-logo-1200x675.png?v=20240521115558&w=240&h=240&zc=2",
    "publishedAt": "2025-05-10T07:13:05Z",
    "content": "Bumble (NASDAQ:BMBL – Get Free Report) had its price objective lowered by analysts at Royal Bank of Canada from $7.00 to $5.00 in a research report issued to clients and investors on Thursday,Benzing… [+5097 chars]",
    "full_content": "Bumble (NASDAQ:BMBL – Get Free Report) had its price objective lowered by analysts at Royal Bank of Canada from $7.00 to $5.00 in a research report issued to clients and investors on Thursday,Benzinga reports. The firm currently has an “outperform” rating on the stock. Royal Bank of Canada’s price target suggests a potential downside of 12.13% from the stock’s previous close.\n\nOther analysts also recently issued reports about the stock. Susquehanna decreased their price objective on shares of Bumble from $6.00 to $5.00 and set a “neutral” rating on the stock in a research report on Friday, March 7th. Wells Fargo & Company decreased their price target on Bumble from $7.00 to $5.00 and set an “equal weight” rating on the stock in a report on Wednesday, April 9th. Citigroup lowered their price objective on Bumble from $6.80 to $4.80 and set a “neutral” rating on the stock in a research report on Friday, April 25th. JPMorgan Chase & Co. cut their target price on Bumble from $8.00 to $7.00 and set a “neutral” rating for the company in a research report on Wednesday, February 19th. Finally, Evercore ISI lowered their price target on Bumble from $8.00 to $7.00 and set an “in-line” rating on the stock in a report on Wednesday, February 19th. One research analyst has rated the stock with a sell rating, fifteen have given a hold rating and two have issued a buy rating to the company. According to data from MarketBeat, the stock has an average rating of “Hold” and an average target price of $6.75.\n\nGet Bumble alerts:\n\nView Our Latest Analysis on Bumble\n\nBumble Price Performance\n\nNASDAQ BMBL opened at $5.69 on Thursday. The business’s fifty day moving average is $4.46 and its 200 day moving average is $6.61. Bumble has a fifty-two week low of $3.55 and a fifty-two week high of $12.49. The company has a debt-to-equity ratio of 0.75, a quick ratio of 2.09 and a current ratio of 2.09. The company has a market capitalization of $600.56 million, a PE ratio of -1.16 and a beta of 1.76.\n\nBumble (NASDAQ:BMBL – Get Free Report) last posted its quarterly earnings data on Wednesday, May 7th. The company reported $0.13 earnings per share for the quarter, missing analysts’ consensus estimates of $0.16 by ($0.03). The company had revenue of $247.10 million for the quarter, compared to analysts’ expectations of $246.68 million. Bumble had a negative net margin of 54.19% and a positive return on equity of 3.31%. The firm’s quarterly revenue was down 7.7% on a year-over-year basis. During the same period in the previous year, the firm earned $0.19 earnings per share. Sell-side analysts predict that Bumble will post 4.19 earnings per share for the current year.\n\nInstitutional Investors Weigh In On Bumble\n\nA number of hedge funds have recently bought and sold shares of the business. Ameriprise Financial Inc. increased its holdings in shares of Bumble by 25.5% in the 4th quarter. Ameriprise Financial Inc. now owns 6,382,478 shares of the company’s stock worth $51,953,000 after buying an additional 1,298,630 shares during the last quarter. Dimensional Fund Advisors LP grew its position in Bumble by 0.6% in the fourth quarter. Dimensional Fund Advisors LP now owns 3,965,283 shares of the company’s stock worth $32,279,000 after acquiring an additional 22,136 shares in the last quarter. RPD Fund Management LLC bought a new stake in Bumble during the fourth quarter worth approximately $30,940,000. Northern Trust Corp raised its position in Bumble by 3.5% during the fourth quarter. Northern Trust Corp now owns 950,014 shares of the company’s stock valued at $7,733,000 after purchasing an additional 32,353 shares during the period. Finally, First Trust Advisors LP lifted its stake in shares of Bumble by 429.5% in the 4th quarter. First Trust Advisors LP now owns 772,394 shares of the company’s stock valued at $6,287,000 after purchasing an additional 626,528 shares during the last quarter. Hedge funds and other institutional investors own 94.85% of the company’s stock.\n\nAbout Bumble\n\n(Get Free Report)\n\nBumble Inc provides online dating and social networking platforms in North America, Europe, internationally. It owns and operates websites and applications that offers subscription and in-app purchases dating products. The company operates apps, including Bumble, a dating app built with women at the center, where women make the first move; Badoo, the web and mobile free-to-use dating app; Official app where users connect their profile with that of their partner enabling a shared, linked product experience; Bumble BFF and Bumble Bizz Modes that have a format similar to the date mode requiring users to set up profiles and matching users through yes and no votes, similar to the dating platform; and Bumble for Friends, a friendship app where people in all stages of life can meet people nearby and create meaningful platonic connections, as well as Fruitz app is centered around encouraging honesty and transparency by sharing dating intentions from the first touch point.\n\nFeatured Stories\n\nReceive News & Ratings for Bumble Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Bumble and related companies with MarketBeat.com's FREE daily email newsletter."
  },
  {
    "source": {
      "id": null,
      "name": "Macworld"
    },
    "author": "Author: Thomas Bergbold",
    "title": "B&W International Media Set review: The ultimate in MacBook protection",
    "description": "Macworld\n\n\n\r\n\n\n\nAt a glanceExpert's Rating\r\n\n\nPros\r\n\n<ul>\n<li>Robust</li>\n\n\n\n<li>Sturdy handle</li>\n\n\n\n<li>Eyelets for locks</li>\n\n\n\n<li>Detachable carrying strap</li>\n</ul>\n\r\n\n\n\n\nCons\r\n\n<ul>\n<li>No intermediate base for laptop compartment</li>\n</ul>\n\r\n\n\n\n\nOu…",
    "url": "https://www.macworld.com/article/2775712/bw-international-media-set-review.html",
    "urlToImage": "https://www.macworld.com/wp-content/uploads/2025/05/BWKoffer_01-1.jpg?quality=50&strip=all&w=1024",
    "publishedAt": "2025-05-09T13:42:00Z",
    "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nAt a glance<ul><li>R… [+3544 chars]",
    "full_content": "At a glance Expert's Rating Pros Robust\n\nSturdy handle\n\nEyelets for locks\n\nDetachable carrying strap Cons No intermediate base for laptop compartment Our Verdict This is the case if you need protection for your MacBook at Construction sites or in harsh environments. The transport case set impresses with its protection, workmanship, and quality. Price When Reviewed This value will show the geolocated pricing text for product undefined Best Pricing Today\n\nBest Prices Today: B&W International Media-Set PP.162.BG.TEX\n\nRetailer Price B&W International €184 View Deal Product Price\n\nThe B&W International Media Set: Laptop Bag with Divider System set consists of two parts: the TEX.162.RPD laptop case and the robust outdoor case type 5040 (the type 6040 is also available). Both parts can be used individually and purchased separately.\n\nThe outdoor case is recognizable as a typical heavy-duty protective case. It is made of robust polypropylene, and it is authorized for the transport of dangerous goods. The case is stackable, making it easier to store and transport. With IP protection class 67, the case is dust and waterproof, ideal for use in extreme conditions. It is also temperature-stable and airworthy thanks to an automatic pressure equalisation valve. The lid of the case is fitted with dimpled foam for additional protection. Two eyelets with a diameter of 7 millimeters are provided for the use of padlocks. The inside dimensions of the case are 430 by 300 by 125 millimeters, and the outside dimensions are 470 by 365 by 140 millimeters. The weight of the case is 2.5 kilograms and the volume is 16.2 litres. The case is available in black and bronze green.\n\nThe TEX.162.RPD laptop case is fitted with an all-around zipper that allows it to be opened completely. The inside dimensions are 420 by 280 by 650 millimeters. The interior partitioning can be freely repositioned with Velcro dividers. For example, you can create a 335 by 280 by 65 millimeter laptop compartment with small compartments on the side for cables, a power bank or power supply, and an SSD drive. The polyester material is water-repellent. The total weight is 0.75 kilograms, and the volume is 7.6 liters. A shoulder strap is included, which can be attached to both the laptop bag and the case.\n\nB&W International demonstrates its extensive experience with this set. There is nothing to criticize about the robustness or the workmanship. The laptop bag seems to have been designed for thick Windows laptops from 15 years ago–a MacBook Air gets a little lost in there. You could even consider adding an intermediate shelf to transport an iPad or documents.\n\nShould you buy the B&W International Media Set?\n\nThis is the case if you need protection for your MacBook at construction sites or in harsh environments. The transport case set impresses with its protection, workmanship, and quality.\n\nThere are other bags to consider for your MacBook, read: Best MacBook bags, cases and sleeves for the best we’ve tested."
  },
  {
    "source": {
      "id": null,
      "name": "fox6now.com"
    },
    "author": "Fox6 News Digital Team",
    "title": "2023 Racine police shooting, standoff; man found guilty at trial",
    "description": "A Racine man has been found guilty at trial for a 2023 shooting that wounded two police officers during a standoff.",
    "url": "https://www.fox6now.com/news/racine-police-shooting-suarez-verdict-guilty",
    "urlToImage": "https://images.foxtv.com/static.fox6now.com/www.fox6now.com/content/uploads/2023/01/1280/720/2f08d433-A1.jpg?ve=1&tl=1",
    "publishedAt": "2025-05-10T01:08:04Z",
    "content": "RACINE, Wis. - A Racine man has been found guilty at trial for a 2023 shooting that wounded two police officers during a standoff.\r\nIn court\r\nWhat we know:\r\nCourt records show 28-year-old Daniel Suar… [+1785 chars]",
    "full_content": "The Brief A Racine man has been found guilty at trial for a 2023 police shooting. Prosecutors said he shot at four officers, wounding two of them, during a standoff. A jury convicted him of all 10 counts he faced.\n\n\n\nA Racine man has been found guilty at trial for a 2023 shooting that wounded two police officers during a standoff.\n\nIn court\n\nWhat we know:\n\nCourt records show 28-year-old Daniel Suarez was charged with seven felonies – including attempted first-degree intentional homicide – and three misdemeanors. A jury convicted him of all 10 counts on Friday.\n\nSIGN UP TODAY: Get daily headlines, breaking news emails from FOX6 News\n\nWhat's next:\n\nSuarez is scheduled to be sentenced in July.\n\n2 Racine officers shot, wounded after domestic incident on Gillen Street\n\nThe backstory:\n\nPolice were initially called for a domestic violence incident on Jan. 18, 2023. According to a criminal complaint, Suarez's girlfriend called police because he was inside their home with two guns and their two children – who were 1 and 3 years old at the time. Officials said he came outside and fired a gun into the air before police arrived.\n\nTwo hours after police arrived and had been trying to communicate with Suarez, officials said he fired multiple shots from a window at four officers. Officers returned fire, but did not hit the man.\n\nOfficers Joe Burinda and Benjamin Eiden (Courtesy: RPD)\n\nFREE DOWNLOAD: Get breaking news alerts in the FOX6 News app for iOS or Android.\n\nThe Racine Police Department said two officers, Joe Burinda and Benjamin Eiden, were hit by Suarez's gunfire. The police chief at the time said Burinda sustained a shoulder injury and Eiden sustained facial injuries from what police believe were birdshot pellets. The other two officers involved were identified as Tom DeBaker and Dan Wasmund.\n\nSuarez was eventually talked out of the residence, and he surrendered around 1:20 a.m. Wednesday. Police said he had \"superficial injuries\" and was taken to a hospital for evaluation."
  }
]