[
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Margherita Bassi",
    "title": "All 28 of the U.S.’s Largest Cities Are Sinking, Study Finds",
    "description": "A new study reveals that uneven land subsidence could impact 29,000 buildings across the America's most populated metropolises.",
    "url": "https://gizmodo.com/all-28-of-the-u-s-s-largest-cities-are-sinking-study-finds-2000599621",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/cities-sinking.jpg",
    "publishedAt": "2025-05-09T11:00:50Z",
    "content": "Americas biggest cities are slowly sinkingand not just the ones near the ocean, according to a study published today in the journal Nature Cities. The satellite-based study shows that all 28 U.S. cit… [+3732 chars]",
    "full_content": "America’s biggest cities are slowly sinking—and not just the ones near the ocean, according to a study published today in the journal Nature Cities. The satellite-based study shows that all 28 U.S. cities with over 600,000 people are subsiding, putting infrastructure in fast-growing urban areas increasingly at risk.\n\nResearchers used satellite data to investigate the vertical land movements in large U.S. cities, finding that all of them are sinking to some extent. Groundwater extraction seems to be the most common culprit, and its impact on land movement has direct implications for the infrastructure in the country’s most populated neighborhoods.\n\n“As cities continue to grow, we will see more cities expand into subsiding regions,” Leonard Ohenhen, lead author of the study and a postdoctoral researcher at Columbia Climate School’s Lamont-Doherty Earth Observatory, said in a university statement. “Over time, this subsidence can produce stresses on infrastructure that will go past their safety limit.”\n\nOhenhen and his colleagues used recent satellite data to map vertical land movement in the U.S.’s most populated cities, analyzing it in systematic 90-square-foot (28-square-meter) grids. While many people have heard that large coastal cities such as New Orleans are sinking, the study reveals that even municipalities far inland—including Denver, Oklahoma City, and Fort Worth—are subsiding.\n\nOverall, the results show that in 25 of the 28 cities analyzed, at least two-thirds of the land is sinking. Houston is the fastest sinking metropolis, with over 40% of its land dropping more than 0.20 inches (5 millimeters) every year—and 12% subsiding at twice that speed. Cities including New York, Las Vegas, Washington D.C., and San Francisco also have relatively small but fast-sinking zones.\n\nThis contributes to differential motion: regions sinking at different speeds, or some regions subsiding while others uplift. This uneven movement can endanger infrastructure by causing buildings to tilt.\n\nWhile only around 1% of the documented areas are experiencing strong enough differential motion to impact infrastructure, these regions tend to be the most urbanized, accounting for around 29,000 buildings. According to the study, one in 45 buildings in San Antonio are at high risk, as are one in 71 in Austin, one in 143 in Fort Worth, and one in 167 in Memphis. An even more detailed study would be needed to assess the specific risk for individual buildings, Ohenhen said in the statement.\n\n“Unlike flood-related subsidence hazards, where risks manifest only when high rates of subsidence lower the land elevation below a critical threshold, subsidence-induced infrastructure damage can occur even with minor changes in land motion,” the authors wrote in the study. Nevertheless, sinking land is generally more vulnerable to floods.\n\nBy analyzing groundwater extraction alongside vertical land movements, the researchers determined that this activity is responsible for 80% of the documented subsiding. That’s because when humans remove water from aquifers—layers of porous rock that hold groundwater—the pores can collapse, lowering the land surface above it. The researchers argue that this phenomenon will only worsen in some areas because of elements such as population growth (meaning increasing water needs) and climate-driven droughts.\n\nThere are also other forces at play, however. Some sinking areas are still recovering from the bulging caused by long-gone ice age glaciers in North America’s interior. The monumental weight of buildings might also impact some cities’ land movement (cough cough, New York).\n\nUltimately, the researchers hope their study will inspire a push for mitigation efforts, which could include land raising, building retrofitting, and updated construction codes.\n\n“As opposed to just saying it’s a problem, we can respond, address, mitigate, adapt,” Ohenhen concluded. “We have to move to solutions.”"
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Justin Carter",
    "title": "Godzilla x Kong is Going Supernova, What Could It Mean?",
    "description": "An intriguing new subtitle suggests the next Godzilla x Kong could take its cast to some new, possibly cosmic heights.",
    "url": "https://gizmodo.com/godzilla-kong-supernova-spacegodzilla-gigan-2000600696",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/godzilla-kong-newempire.jpg",
    "publishedAt": "2025-05-11T16:25:30Z",
    "content": "Almost a full year after it was teased, we recently learned the third Godzilla x Kong movie is subtitled Supernova, and it’s coming March 2027. As fans wonder what’ll bring the two Titans together on… [+3577 chars]",
    "full_content": "Almost a full year after it was teased, we recently learned the third Godzilla x Kong movie is subtitled Supernova, and it’s coming March 2027. As fans wonder what’ll bring the two Titans together once more, some think the title could be mean the MonsterVerse is introducing interstellar threats. After all, both Godzilla vs. Kong and Godzilla x Kong: The New Empire took the characters underground to the Hollow Earth, so the next place left to go, in theory, would be up into the stars.\n\nOne of the first candidates that comes to mind is SpaceGodzilla. Like the name implies, it’s an evil clone of the King of the Monsters who first appeared in 1994’s Godzilla vs. SpaceGodzilla. Created by Godzilla’s genetic material merging with a crystalline organism in space, then absorbed by a black hole and subsequently spat out by a white hole, the cosmic-themed variant attacked Godzilla and Little Godzilla using its power to create and control crystals.\n\nThe monster was subsequently defeated by Godzilla’s red heat ray attack, and since then, it’s mostly appeared in non-movie media more than the films themselves. On screen, it last showed up as a toy in 2004’s Godzilla: Final Wars, but its most recent overall appearance was in the 2021 gacha game Godzilla Battle Line and anniversary toys for the franchise’s 40th birthday. Suffice to say, it’s not an A-tier baddie, but the potential Godzilla x Kong connection comes from the name of its special attack, Corona Beam—or Void Invader, the retitled name bestowed upon it from a 2020 Magic: The Gathering expansion. The Beam has been likened to the cosmic explosion, and the Supernova logo seems to support this theory.\n\nAlternatively, there’s Gigan, first introduced in 1972’s Godzilla vs. Gigan. This monster is an alien converted into a cyborg by the Nebulans, aliens looking to use it to decimate Earth and prepare the planet for their eventual subjugation. Godzilla and Anguirus defeated Gigan, who came back in 1973’s Godzilla vs. Megalon as a support monster to that film’s titular villain, then in 2004’s Godzilla: Final Wars, where he was awakened by the alien Xiliens and upgraded to help destroy the Earth. It lost in both returning appearances, and in Final Wars’ case, it decapitated itself with its own weapon before a flaming Mothra finished it off for good. Unlike SpaceGodzilla, it’s had a more consistent multimedia appearance: along with being playable in GigaBash, it’s shown up in the Godzilla vs. Megalon web video from 2023 and the short anime series Chibi Godzilla Raids Again.\n\nIf Supernova’s actually introducing another Godzilla-related enemy, it’d continue a trend first established with MechaGodzilla in vs. Kong. Despite the King’s mechanical nemesis being that film’s final baddie, both it and New Empire have largely focused on Kong to flesh out his corner of the world, and Godzilla’s been more of a special guest star stomping around during the first and last acts. Now that Kong has an ape tribe, a surrogate son, and a new weapon to his name, he’s well established enough to cede ground over to Godzilla, whose last substantial mythology and character development was back in 2019’s King of the Monsters. If these two are a package deal now, the MonsterVerse writers will have to give them both material to work with, and any fans watching would tell you it’s only fair Godzilla get the spotlight now.\n\nWhichever evil monster ends up being the primary baddie, we’ll be there for Godzilla x Kong: Supernova on March 26, 2027, and we’ll have more news on it as information comes out."
  },
  {
    "source": {
      "id": null,
      "name": "Hackaday"
    },
    "author": "Tyler August",
    "title": "Exploring the RP2350’s UART-Bootloader",
    "description": "The RP2350 has a few advantages over its predecessor, one of which is the ability to load firmware remotely via UART, as [Thomas Pfilser] has documented on his blog and in the video below. [Thomas]…",
    "url": "https://hackaday.com/2025/05/11/exploring-the-rp2350s-uart-bootloader/",
    "urlToImage": "https://hackaday.com/wp-content/uploads/2025/05/P1001181.jpg",
    "publishedAt": "2025-05-11T14:00:37Z",
    "content": "The RP2350 has a few advantages over its predecessor, one of which is the ability to load firmware remotely via UART, as [Thomas Pfilser] has documented on his blog and in the video below.\r\n[Thomas] … [+2007 chars]",
    "full_content": "The RP2350 has a few advantages over its predecessor, one of which is the ability to load firmware remotely via UART, as [Thomas Pfister] has documented on his blog and in the video below.\n\n[Thomas] had a project that needed more PWM than the RP2350 could provide, and hit upon the idea of using a second RP2350 as a port expander. Now, one could hard-code this, but dealing with two sets of firmware on one board can be annoying. That’s where the UART bootloader comes in: it will allow [Thomas] to program the port-expander RP2350 using the main microcontroller. Thus he only has to worry about one firmware, speeding up development.\n\nThere are limits to this technique: for one, your code must fit into the RP2350’s RAM– but the chip has 512 kB. While 640 kB should be enough for anyone, 512 kB is plenty for the port-expander [Thomas] is working on. The second drawback is that your device now has a boot time of a second or so, since the UART connection is not exactly high-bandwidth. Third, using UART on the same pins as the bootloader within the program is a bit tricky, though [Thomas] found a solution that may soon be in the SDK.\n\n[Thomas] also wanted to be able to perform this trick remotely, which isn’t exactly UART’s forte. RS-485 comes to the rescue, via TI’s THVD1450. That worked reliably at the 10m cable length used for the test. [Thomas] sees no reason it could not work over much longer distances. ([Thomas] suggests up to 100 m, but the baud rate is fairly low, so we wouldn’t be surprised if you could push it quite a bit further than that. The standard is good out to a kilometer, after all.) For all the wrinkles and links to tips and solutions, plus of course [Thomas]’s code, check out the blog. If you want to listen to the information, you can check out the video below.\n\nWe’re grateful to [Thomas] for letting us know about his project via the tip line, like we are to everyone who drops us a tip. Hint, hint.\n\nGiven that it is the new chip on the block, we haven’t seen too many hacks with the RP2350 yet, but they’re starting to trickle in. While a UART bootloader is a nice feature to have, it can also introduce a security risk, which is always something to keep in mind."
  },
  {
    "source": {
      "id": null,
      "name": "CNET"
    },
    "author": "Jason Cockerham",
    "title": "Review: This Portable Controller Is the Perfect On the Go Gaming Accessory",
    "description": "The Crkd Neo S is a fun, little controller with a reasonable price -- and a few quirks.",
    "url": "https://www.cnet.com/tech/gaming/review-this-portable-controller-is-the-perfect-on-the-go-gaming-accessory/",
    "urlToImage": "https://www.cnet.com/a/img/resize/92ec600f9f6e10c8f1332c8358e79ee537fe4732/hub/2025/04/14/5fe591a7-0797-414a-a032-e23082c242f6/img-4927.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2025-05-07T20:37:41Z",
    "content": "Gaming controllers are a dime a dozen, and it's not easy to know which ones are worth spending money on. Often, the question is whether you really need to upgrade to a new controller when you still h… [+5259 chars]",
    "full_content": "Gaming controllers are a dime a dozen, and it's not easy to know which ones are worth spending money on. Often, the question is whether you really need to upgrade to a new controller when you still have the one that came with your console. However, the truth is there are so many more ways we can play our favorite games now, including on our phones and tablets. Plus, having something you can quickly drop into your bag in case you want to game on the go is super helpful, too.\n\nI've been testing a lot of controllers lately, and the Crkd (pronounced like \"cracked\") Neo S offers nearly everything you'd want in a good, easily portable game controller -- and it's affordable, too. The company let me check out the Frost Edition, and I've been quite impressed.\n\nWhat I like about the Crkd Neo S\n\nHardware and customization\n\nCrkd mostly nails the hardware on the Neo S. Firstly, I had not used a rectangular controller before, but it felt very comfortable after just a few minutes. The slightly protruding grips on the back help out quite a bit.\n\nThe buttons are really clicky, the joysticks are stiff without being too rigid and the triggers feel great. Gaming with the Neo S for a couple of hours at a time was a pleasure, and I never missed an input due to mushy controls.\n\nThe Neo S is about the same size as the Nintendo Switch's display. Jason Cockerham/CNET\n\nThe Neo S connects wirelessly via Bluetooth, but there's also a USB-C port and an included cable for wired gaming. Up to three devices can be connected at a time. Once set up, I was able to quickly switch between my PC, iPad and Nintendo Switch in just a few seconds.\n\nIt's impressive that it's as good as it is, considering its size. The Neo S is small enough to tuck into a large pants or jacket pocket if you really need to, and it easily slipped into my backpack. Although, the lack of a carrying case meant the sticks caught on my bag occasionally, but it's quite easy to travel with.\n\nAnother fun thing about the Neo S is all the different special editions available. I have the Frost Edition, which is exclusive to the Apple Store (and currently sold out), but there are options like Retro Gold, Classic Clear, Fortnite and several others. You can add them to your \"collection\" in the Crkd app, and the app will tell you the product number of your controller and even give it a rarity rank depending on how many were made.\n\nIt would be cool if you could collect points or something by adding more to your collection, which you could then redeem for discounts on other controllers or accessories, but right now, points seem to be for bragging rights only.\n\nJason Cockerham/CNET\n\nOne other impressive thing about the Neo S is the pro-level of customization built into it. Considering its price and size, you wouldn't necessarily think you could customize almost everything possible input on it. Things like the vibration intensity, trigger sensitivity, even the dead zones for the joysticks -- all things that you can normally only customize on controllers that cost a few hundred dollars.\n\nDespite all of its features and compact design, the Neo S is still reasonably priced. At the time of writing, you can find most editions for about $40 to $50, though newly released editions are typically around $60. Plus, you get even more discounts if you buy a few at a time (like if you want to upgrade the kiddos' Switch controllers). That's really not a bad price at all for such a good controller, especially with as much customization as this one offers.\n\nWhat I don't like about the Crkd Neo S\n\nFor as good as the inputs on the Neo S are, the haptics are surprisingly mediocre. They aren't as bad as others I've used, but I would recommend keeping them on the lowest setting or just turning them off. They're nice to have for some games, but I'm just not a fan.\n\nAlso, while the controller is extremely customizable, tweaking those settings is pretty confusing. Changing any of them manually on the controller requires pressing a combination of the big Crkd button at the top and some other random button. It's not at all intuitive, so you either have to memorize the different button combos or look them up every time.\n\nJason Cockerham/CNET\n\nThankfully, you can change everything in the Crkd iOS or Android app, but that means pausing your game, connecting to the other device, changing the settings and switching back to the console. It's quite a lot of steps, and it doesn't save settings between devices -- you'll have to change them every time.\n\nThis confusion also translates to the setup process. Pairing to and switching between devices took some trial and error at first, and even so, you have to remember which button combo connects to which device (D-pad up plus Crkd button for iOS, D-pad right plus Crkd button for Switch, and so on). Having a tiny LCD screen that could help walk you through stuff might help, but my recommendation is to just pair the controller with one device and leave it.\n\nShould you buy the Crkd Neo S?\n\nAll that being said, I would absolutely recommend the Neo S in a heartbeat. It's a really solid little controller that's incredibly portable and quite comfortable to use. Plus, the immense level of customization means you can get pro-level controls for a fraction of what you'd pay for something like an Xbox Elite controller.\n\nThe collectible nature of the special editions also adds another layer of fun to the Neo S.\n\nPersonally, I wish I'd discovered Crkd controllers years ago."
  },
  {
    "source": {
      "id": null,
      "name": "Android Central"
    },
    "author": "bradypsnyder@gmail.com (Brady Snyder)",
    "title": "Google won't bring Android 16's Battery Health page to older Pixels",
    "description": "Google is prepping a Battery Health page for Pixels in Android 16, and we now know exactly which models will — and won't — be supported.",
    "url": "https://www.androidcentral.com/apps-software/android-os/google-wont-bring-android-16s-battery-health-page-to-older-pixels",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/5nUS8ARcLSz8raULVFxjcD.jpg",
    "publishedAt": "2025-05-06T20:01:30Z",
    "content": "What you need to know\r\n<ul><li>Android 16 is about to bring a robust Battery Health page to Pixel phones with key performance data.</li><li>The page will show estimated battery capacity as a real-tim… [+2708 chars]",
    "full_content": "What you need to know\n\nAndroid 16 is about to bring a robust Battery Health page to Pixel phones with key performance data.\n\nThe page will show estimated battery capacity as a real-time percentage compared to a new battery.\n\nNotably, Google is confirming that only the Pixel 8a and newer will receive the useful features.\n\nGoogle is adding a Battery Health statistics page to the Settings app for Pixel phones with Android 16, but most models won't be supported. The company says that the feature will be available \"on Pixel 8a and Pixel 9 products including 9 Pro Fold\" in a reply to an Issue Tracker ticket concerning Battery Health availability. That leaves out all Pixel models released before the Google Pixel 8a, including the rest of the Pixel 8 series and the original Pixel Fold.\n\n\"The Battery Health Indicator feature is currently supported in Beta 3 on Pixel 8a and Pixel 9 products including 9 Pro Fold,\" a Google employee wrote on May 1. \"Due to product limitations, this feature will not be available on older in-market Pixel devices.\"\n\nNewer Google Pixel devices already showed cycle count data as of last year, but the Battery Health page is set to bring more detailed analytics. Specifically, battery capacity will be shown as a percentage compared to its new state. This should give users an easy-to-understand idea of how their battery will perform on a daily basis, even years after their phone purchase.\n\n(Image credit: Brady Snyder / Android Central)\n\n\"This [battery capacity] is an estimated percentage of charge the battery can currently hold compared to a new standard battery,\" the Battery Health page in the Android 16 beta explains. \"Battery capacity decreases over time.\"\n\nAdditionally, the Battery Health page shows a green checkmark and a Normal status if the battery is working as expected. It also offers quick links to battery-related support articles, and lists any charging optimization features that are enabled — such as Adaptive Charging.\n\nWhile it's unclear what \"product limitations\" prevent Pixel phones older than the Pixel 8a from supporting the Battery Health page, it may have something to do with the batteries themselves.\n\nStarting with the Pixel 8a, Google says Pixel phones can reach 1,000 charge cycles before needing a battery replacement. Older Pixel phones, namely the Pixel 3 through Pixel 8 Pro and Pixel Fold, are only rated for up to 800 charge cycles before a battery replacement is recommended.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nAndroid 16, and the Battery Health feature for Pixels, will likely be shown off at Google I/O 2025. Here's everything you need to know about how to watch Google I/O 2025, and how much you should care."
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Isaac Schultz",
    "title": "These Satellites Just Nailed the Most Precise Formation Flight in Space History",
    "description": "ESA's Proba-3 just achieved a world-first: millimeter-precise formation flying, entirely on its own.",
    "url": "https://gizmodo.com/these-satellites-just-nailed-the-most-precise-formation-flight-in-space-history-2000599575",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/proba-3-satellite-eclipse.jpg",
    "publishedAt": "2025-05-08T14:55:15Z",
    "content": "The European Space Agencys Proba-3 mission has achieved something no other missionor synchronized swimmerhas before: autonomous, precision formation flying in space with millimeter accuracy.\r\nESAs Pr… [+2573 chars]",
    "full_content": "The European Space Agency’s Proba-3 mission has achieved something no other mission—or synchronized swimmer—has before: autonomous, precision formation flying in space with millimeter accuracy.\n\nESA’s Proba-3 satellites—the Occulter and the Coronagraph, respectively—maintained a steady 492-foot (150-meter) distance from one another in a highly elliptical orbit, simulating a single massive instrument. The same principle is used by satellite constellations and planned space telescopes to capitalize on the laws of physics and the relatively noiseless environment of space to collect more data than otherwise possible. But Proba-3’s goal is unique: to align the spacecraft in such a way that one (the Occulter) can block out the Sun’s glare, while the other (the Coronagraph) can take a clean look at its wispy outer atmosphere—the solar corona.\n\nFor this to work, the two spacecraft can’t just drift around together—they must stay aligned with millimeter-level (0.04-inch) precision, with no micromanagement from Earth. Specifically, the instruments need to be aligned such that there’s nearly 500 feet (152.4 m) between them, and a 4.6-foot (1.4-m) disc on the Occulter casts a 2-inch (5-centimeter) shadow on the Coronagraph—that’s all the latter needs to be sheltered from the Sun’s brilliance and image its faint, ethereal corona.\n\nAfter initial positioning by ground control, the satellite duo’s autonomous system of cameras, LEDs, and laser rangefinders brings the two spacecraft closer together, leveraging an algorithm to ensure that the Coronagraph stays safely in the Occulter’s shadow.\n\nThe Fine Lateral and Longitudinal Sensor (FLLS)—a laser system that detects position shifts—ensures the two spacecraft remain precisely aligned; constant measuring of laser light is the same technology that will keep LISA, the next-generation gravitational wave observatory from NASA and ESA, in alignment at much greater distances, 10 years from now.\n\nProba-3’s achievement marks a level of orbital choreography that’s never been accomplished before. “We are talking about millimetric accuracy in range, and sub-millimetric in the lateral position,” said project manager Damien Galano in an ESA release. “We can’t wait to see the completion of the instrument calibration and the first processed image of the Sun’s corona.”\n\nThe solar science will be a remarkable feat in itself, but Proba-3’s technology demonstration also helps prove out the precision measurements that will be crucial for future multi-spacecraft missions, such as LISA.\n\nIt’s marvelously precise science that sets the stage for astronomy’s future. For now, ESA’s Proba-3 will prepare for its research campaign—tethered by lasers in a Kubrickian waltz, getting ready to stare straight into the Sun."
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "Second Grand Theft Auto 6 trailer arrives days after delay announced",
    "description": "After pushing the much-anticipated sequel into 2026, developer Rockstar gives fans a new glimpse of the game.",
    "url": "https://www.bbc.com/news/articles/c4g2grmrx4po",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/dee4/live/9e297760-2a85-11f0-8f57-b7237f6a66e6.jpg",
    "publishedAt": "2025-05-06T14:35:19Z",
    "content": "Riyah Collins and Tom Richardson\r\nLucia Caminos is one of GTA 6's two protagonists\r\nThe second trailer for Grand Theft Auto 6 has been released just days after the game was officially delayed to next… [+2281 chars]",
    "full_content": "What have we learned from Grand Theft Auto 6's second trailer?\n\n7 days ago Share Save Riyah Collins and Tom Richardson BBC Newsbeat Share Save\n\nRockstar Games Lucia Caminos is one of GTA 6's two protagonists\n\nJust when you'd come to terms with the fact that Grand Theft Auto 6 had been delayed until next year, Rockstar Games goes and drops a brand new trailer. Last week, the video game developer announced the game had been pushed back to May 2026, shocking fans who were expecting it to land this autumn. It's been 12 years since the last GTA game was released, and the long wait for the most anticipated sequel of all time just became even more agonising. But earlier, the company released a new, three-minute trailer, giving eager players a stack of new information to dissect in the meantime. Here are some of the highlights.\n\nRockstar Games Jason Duval is the other main character in the game, and Lucia's partner\n\nThe record-breaking first trailer for GTA 6, published online in late 2023, introduced players to protagonists Jason and Lucia - a couple who live a life of crime in Leonida, the fictional US state where the game is set. We now know a bit more about their backstory. The new trailer opens with Jason doing odd jobs before driving around Vice City - the Miami-inspired location from the 2002 PlayStation 2 game. According to Rockstar, Jason was a troubled teen who joined the army to escape his bad influences, but fell back into crime after returning home. In the trailer he eventually collects Lucia from prison, where she has been serving time for \"protecting her family\". From there, the clip launches into a montage of action sequences, romantic scenes and glimpses of the game's wider world. We see the couple carrying out armed heists, partying on a yacht and riding a jetski together. According to a description on Rockstar's website, the two want to forge a new life together but are plunged into \"the middle of a conspiracy\" after an \"easy score goes wrong\".\n\nNew characters revealed\n\nRockstar Games Rap Duo Real Dimez are among the new characters introduced in GTA 6\n\nPlayers also got to put names to faces of some of game's wider cast, including bank robber Raul Bautista, smuggler Brian Heder and rap combo Real Dimez. Like GTA 5, which was heavily based on Los Angeles and its surrounding areas, the sequel also appears to contain accurate recreations of some of Florida's most famous landmarks. Vice City's version of Miami's art deco, neon-lit beachfront appears in the trailer, as does the Grassrivers swampland, inspired by the Florida everglades. Rockstar also revealed the Leonida Keys, the industrial Ambrosia region, sleazy Port Gellhorn and the mountainous Kalaga National Park. In each case, it suggested the areas would be home to different groups and factions, from \"hillbilly mystics\" to biker gangs.\n\nThe trailer did not appear to include any gameplay footage, but was made up of cinematic sequences usually seen between story missions. But fans were quick to praise the game's next-generation graphics in the trailer and a series of screenshots published by Rockstar. Video game trailers are sometimes created using powerful PCs but a note at the end of the trailer said the scenes in it were taken from a PlayStation 5 console. But that doesn't answer questions about new ways of interacting with the game's world, or whether players can switch between characters on-the-fly as they could in GTA 5.\n\nWhy has GTA 6 taken so long?\n\nRockstar Vice City is modelled on Miami and other real-life parts of Florida\n\nThe hype around GTA 6 is huge, and Rockstar has form for delaying its games and a reputation for perfectionism. When it announced the delay last week it told fans it needed extra time to \"deliver at the level of quality you expect and deserve\". According to Bloomberg journalist Jason Schreier, the delay was to also to avoid \"crunch\" - a gaming industry term for enforced overtime. The company was previously criticised by some staff over the practice - it accepted that some worked \"long hours\" but said some accounts were exaggerated. When GTA 6's delay was announced, shares in Rockstar's parent company, Take Two Interactive, dropped by 10%. The industry was banking on the game - which will initially be available only on Xbox and PlayStation 5 - to boost console sales and break software sales records. However, having a firm date of 26 May 2026 for GTA 6 means that other publishers can now avoid releasing their own games at the same time."
  },
  {
    "source": {
      "id": null,
      "name": "VentureBeat"
    },
    "author": "Ben Dickson",
    "title": "Mem0’s scalable memory promises more reliable AI agents that remembers context across lengthy conversations",
    "description": "Mem0's architecture is designed to LLM memory and enhance consistency for more reliable agent performance in long conversations.",
    "url": "https://venturebeat.com/ai/mem0s-scalable-memory-promises-more-reliable-ai-agents-that-remembers-context-across-lengthy-conversations/",
    "urlToImage": "https://venturebeat.com/wp-content/uploads/2025/05/robot-recalling-past-conversations.webp?w=1024?w=1200&strip=all",
    "publishedAt": "2025-05-08T19:13:30Z",
    "content": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\r\nResearchers at Mem0 have introduced two new memory architectures design… [+9110 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Kenneth Shepard",
    "title": "Overwatch 2’s Street Fighter Collaboration Would Be Cool If The Game Wasn’t Becoming Fortnite",
    "description": "I love Overwatch 2. I love Street Fighter. Put the two of them together for a skin collaboration, and that should, in theory, speak to me directly. But I don’t know, I feel like I’m becoming desensitized to all the collaborations Blizzard has been shoving int…",
    "url": "https://kotaku.com/overwatch-2-street-fighter-skin-collaboration-crossover-1851779908",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/2ce56c5952f6608104549486b4c23657.jpg",
    "publishedAt": "2025-05-09T14:10:00Z",
    "content": "I love Overwatch 2. I love Street Fighter. Put the two of them together for a skin collaboration, and that should, in theory, speak to me directly. But I dont know, I feel like Im becoming desensitiz… [+2272 chars]",
    "full_content": "I love Overwatch 2. I love Street Fighter. Put the two of them together for a skin collaboration, and that should, in theory, speak to me directly. But I don’t know, I feel like I’m becoming desensitized to all the collaborations Blizzard has been shoving into its hero shooter, even when they involve things I enjoy. It sometimes feels like this is the only way the company knows how to drum up hype for the hero shooter, which is a shame because the game is in such a good state these days that it shouldn’t have to rely on other properties.\n\nAdvertisement\n\nI don’t want to diminish how much cool shit Blizzard has put into Overwatch 2 in the past few seasons. The Perks system, which allows you to upgrade your hero’s kit over the course of a match, has reinvigorated several heroes in its roster in standard play. The build-centric Stadium mode is easily one of the biggest overhauls the game has gotten in the past decade, and is an incredible new way to play the game. Blizzard’s doing some really incredible stuff right now, and is making the most of a bad situation after years of broken promises. But man, I’m less enthusiastic about the reliance on collaboration skins because it feels like the game is slowly becoming Fortnite. There have been so many crossovers in the past few years that you could conceivably play a match made up of players all cosplaying other properties, rather than existing in the rich, underutilized world Blizzard has created.\n\nBlizzard Entertinament\n\nThe Street Fighter crossover event will begin on May 20, bringing with it eight skins that dress Overwatch 2’s heroes as some of the most iconic fighters in Capcom’s legendary fighting game, and for what it’s worth, some of the choices are inspired. The full list is as follows:\n\nHanzo as Ryu\n\nJuno as Chun-Li\n\nWidowmaker as Cammy\n\nKiriko as Juri\n\nSoldier: 76 as Guile\n\nSigma as M. Bison\n\nWinston as Blank\n\nZenyatta as Dhalsim\n\nFor now, we’ve only seen Hanzo as Ryu in-game, and it looks like he’ll get emotes based on the iconic Hadouken and Tatsumaki Senpukyaku attacks. We do see every other hero in the event in the animated trailer announcing the collaboration, and it kinda seems like the skins aren’t so much the “Overwatch characters cosplaying” sort that Blizzard used to aspire to as they are just Street Fighter characters dropped wholesale into Overwatch 2. Maybe they’ll look more distinct when they’re released later this month. Click through to see all eight."
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Kenneth Shepard",
    "title": "Grand Theft Auto 6’s Jason Is Gaymers’ Latest Sex Symbol",
    "description": "I was gonna play Grand Theft Auto 6 regardless of who I got to be, but I gotta give a shoutout to Rockstar for giving everyone some eye candy with its protagonist duo, Jason and Lucia. While Jason is in a loving relationship with Lucia and seemingly straight …",
    "url": "https://kotaku.com/grand-theft-auto-6-gta6-jason-duval-shirtless-trailer-1851779751",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/c2fcea2f15075a6ee3165eb5ce03d852.jpg",
    "publishedAt": "2025-05-08T16:31:52Z",
    "content": "I was gonna play Grand Theft Auto 6regardless of who I got to be, but I gotta give a shoutout to Rockstar for giving everyone some eye candy with its protagonist duo, Jason and Lucia. While Jason is … [+1821 chars]",
    "full_content": "I was gonna play Grand Theft Auto 6 regardless of who I got to be, but I gotta give a shoutout to Rockstar for giving everyone some eye candy with its protagonist duo, Jason and Lucia. While Jason is in a loving relationship with Lucia and seemingly straight (to be determined), that hasn’t stopped gay men from latching onto the guy after he was shown shirtless, sweaty and gross in the latest trailer. Grand Theft Auto 6 may still be a year away, but its male lead is already becoming a sex symbol among the gay community after just two trailers.\n\nYou Should Play Grand Theft Auto III Before GTA VI | Total Recall CC Share Subtitles Off\n\nEnglish view video Total Recall: You Should Play Grand Theft Auto III Before GTA VI\n\nYou Should Play Grand Theft Auto III Before GTA VI | Total Recall CC Share Subtitles Off\n\nEnglish Total Recall: You Should Play Grand Theft Auto III Before GTA VI\n\nIt’s easy to see why gays are latching onto the guy. Rockstar probably knew what it was doing when it led the latest trailer with a scene of Jason working hard while his jacked upper body glistened in the sunlight. Though choosing this scene probably had a double meaning, as Jason mentions that he’s “fixing some leaks” on a rooftop, which is likely a nod to the giant leak GTA 6 suffered in 2023. While Jason’s filthy, country trashbandit disposition may win over some ladies, too, it’s the kind of thing gays flock to. Sure, there’s probably something to unpack about gay guys gravitating towards men who look like they wouldn’t respect them, but that’s a psychologist’s job, and I am simply a gay man who is predictably drawn to men who look like they would call me a slur. But I’m not alone. Plenty of us are thirsting for the next Grand Theft Auto protagonist in the out-of-pocket ways they tend to.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nThis is a win for the girls and the gays. A mere 20 seconds of footage has piqued the interest of every gay gamer you’ve ever met. That’s exquisite targeted marketing on Rockstar’s part, and now the game will get even more free promotion through the inevitable bump in Rule 34 searches for Jason in the coming months. Not that the game really needs that much promotion. This is the kind of game that sells millions of copies on the first day, then stays near the top of the charts for several years. But it’s nice to see Rockstar is aware of every market it can possibly corner.\n\n."
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Brandon Morgan",
    "title": "Path of Exile 2’s Huntress Has Powerful Early Game Skills You Should Take Advantage Of",
    "description": "Path of Exile 2 already offers a handful of enjoyable and powerful character classes—Witch, Druid, and Mercenary, for example—along with more to come as Early Access progresses. With the launch of the latest season—Dawn of the Hunt—the most significant conten…",
    "url": "https://kotaku.com/path-of-exile-2-poe-huntress-best-skills-disengage-1851779789",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/110e80b37388415a56038ff21e9b4526.webp",
    "publishedAt": "2025-05-08T18:40:00Z",
    "content": "Path of Exile 2 already offers a handful of enjoyable and powerful character classesWitch, Druid, and Mercenary, for examplealong with more to come as Early Access progresses. With the launch of the … [+3162 chars]",
    "full_content": "Path of Exile 2 already offers a handful of enjoyable and powerful character classes—Witch, Druid, and Mercenary, for example—along with more to come as Early Access progresses. With the launch of the latest season—Dawn of the Hunt—the most significant content update to the game yet, we have yet another to play around with: Huntress. She’s a mighty warrior queen wielding a spear and buckler shield, and her best early-game skills create the foundation for a powerhouse hero!\n\nWhat Is Dragonsplague? Dragon’s Dogma 2’s Devastating Contagion Explained CC Share Subtitles Off\n\nEnglish What Is Dragonsplague? Dragon’s Dogma 2’s Devastating Contagion Explained\n\nAfter spending several hours with the Huntress, running through Act One and pushing into the second Act, I can confidently say that she’s immensely powerful. I didn’t feel this strong wielding a crossbow as the Mercenary at launch. Her abilities range from mobility to attack, allowing you to disengage enemies quickly and hit hard with magic-infused spears.\n\n\n\nAdvertisement\n\n1. Disengage\n\n2. Lightning Spear\n\n3. Barrage\n\nDisengage\n\nAdvertisement\n\nFirst and foremost, I recommend opting for Disengage for your tier-one skill. While Explosive Spear proves powerful and is a valuable skill to invest a gem in, that’s for later. Right now, let’s prioritize a movement ability that does damage and allows you to put some distance between you and your formidable foes.\n\nAdvertisement\n\nDisengage, once activated, allows you to leap backward while rupturing the ground in front of you, sending spikes of dirt and stone toward your enemies. It’s an excellent AOE (area-of-effect) ability that grants invulnerability for a short period, too.\n\nAdvertisement\n\nTier : 1\n\n: 1 Cost : 6 Mana\n\n: 6 Mana Cooldown : 1.50S\n\n: 1.50S Attack Damage : 93%\n\n: 93% Requires: Level 3, 9 Dexterity, Spear\n\nLightning Spear\n\nAdvertisement\n\nWith Disengage tackling mobility, it’s time to invest in a hard-hitting projectile attack ability that, honestly, is currently one of my favorite skills in the game. Lightning Spear hits like an eighteen-wheeler, sending out a spear imbued with lightning damage that slams into single and group targets, electrocuting an area around where the ability lands.\n\nIt’s an excellent follow-up attack after popping Disengage. Remove yourself from a fight, tap Lightning Spear, and watch as electrical currents charge through the mob ahead of you. It’s also a useful skill when you want to kickstart a fight!\n\nAdvertisement\n\nTier : 3\n\n: 3 Cost : 10 Mana\n\n: 10 Mana Attack Speed : 50% of Base\n\n: 50% of Base Attack Damage : 127%\n\n: 127% Requires: Level 6, 16 Dexterity, Spear\n\nBarrage\n\nAdvertisement\n\nFor your third major skill, the tier five ability, I’d opt for Barrage. While Rapid Assault hits fast and hard, and Storm Lance continues the theme of electrical damage-dealing attacks, Barrage allows you to tackle groups relatively easily. Like with Lightning Spear, albeit less situational, you can pop Barrage first to start a fight, dealing damage across a wide area and softening all targets, or use it after Disengage to finish a fight.\n\nThe downside to an area-of-effect (AOE) ability is dealing with a boss fight, which is generally a one-on-one showdown. While still effective if it lands right, an AOE isn’t as powerful against a single target.\n\nAdvertisement\n\nTier : 5\n\n: 5 Cost : 16 Mana\n\n: 16 Mana Cooldown : 2.00S\n\n: 2.00S Cast Time : 0.70S\n\n: 0.70S Requires: Level 14, 34 Dexterity, Spear/Bow\n\nPath of Exile 2 Dawn of the Hunt is available now, with a brand-new class, five new Ascendancy classes, unique items and support gems, and additional endgame content to explore!\n\nAdvertisement\n\n."
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Ethan Gach",
    "title": "Not Even Gearbox's Boss Knows What Borderlands 4's Price Will Be",
    "description": "Borderlands 4 is now just a few months away, and if it’s anything like the previous games in the looter shooter series it will be one of the top-selling blockbusters of 2025. But how much will it cost? Will publisher 2K try to undercut the competition or matc…",
    "url": "https://kotaku.com/borderlands-4-price-preorders-randy-pitchford-pax-east-1851780045",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/459ff8d1b9ca15f90a343a674164462c.jpg",
    "publishedAt": "2025-05-09T20:00:00Z",
    "content": "Borderlands 4 is now just a few months away, and if its anything like the previous games in the looter shooter series it will be one of the top-selling blockbusters of 2025. But how much will it cost… [+2460 chars]",
    "full_content": "Borderlands 4 is now just a few months away, and if it’s anything like the previous games in the looter shooter series it will be one of the top-selling blockbusters of 2025. But how much will it cost? Will publisher 2K try to undercut the competition or match it as some new releases creep up to $80 this year? Gearbox Entertainment CEO Randy Pitchford says even he doesn’t know.\n\nFirefight’s Back In Halo! What Is Firefight? CC Share Subtitles Off\n\nEnglish Firefight’s Back In Halo! What Is Firefight?\n\n“We’re going to have a price set soon,” he told fans at a Borderlands 4 PAX East panel on Friday, GamesSpot reports. “It might be the new price that Nintendo and Microsoft have led with. It might be that we stay back. It’s going to be the people at the publishing house that decide that. We’ll know soon. I think it’s going to be fine, whatever the [price is]. It’s worth it.”\n\nAdvertisement\n\nPitchford added that the upcoming sequel, which features new vault hunters, big open maps with no loading screens, and the ability for guns to drop with parts mixed-and-matched from different in-universe manufacturers, had “more than twice” the budget of Borderlands 3, which was released back in 2019 for the last generation of consoles.\n\nBorderlands 4 is coming at an unusual time for game pricing. We usually only see hikes when jumping from one console cycle to another. This time around, however, we’re seeing pressure from ballooning development budgets and trade wars bump up pricing for the most premium releases. Mario Kart World is $80, and Microsoft has hinted that the next Call of Duty will be as well.\n\nAdvertisement\n\nMeanwhile, some of the top-rated games of 2025, like Clair Obscur: Expedition 33, are only $50. That’s the case with Mafia: The Old Country as well, another 2K-published “premium game” that’s being positioned by the company as a more focused, cinematic release. It will “provide a linear highly-polished narrative experience that can easily complement the other more persistent games our players also love and engage with on a more consistent basis,” 2K announced this week.\n\nAdvertisement\n\nIt seems unlikely that Borderlands 4 will drop that low, though it could surprise everyone by sticking to its predecessor’s last-gen price point of $60. An $80 price point seems more likely, though Pitchford said that while he wants his team to get paid and to be able to reinvest that money into future projects, he also wants as many people as possible to be able to pick up and play the game. And I’m sure that regardless of the base price, there will be a $100 or even $120 deluxe edition for the day-one super fans out there.\n\nAdvertisement\n\n“I’ll tell you the truth, I don’t know,” Pitchford told the audience at PAX East. “That is the truth.” It’s hard to see from the Twitch stream whether his nose started growing after he said that.\n\n."
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku"
    },
    "author": "Zack Zwiezen and Andy Mills",
    "title": "Here's Why Tony Hawk 4's Career Mode Is Gone In THPS 3+4",
    "description": "According to Iron Galaxy, the choice was made to create a more cohesive package",
    "url": "https://kotaku.com/tony-hawk-pro-skater-3-4-career-mode-explained-1851780036",
    "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/bc414ededbe9a5cb983473c217732472.webp",
    "publishedAt": "2025-05-09T19:32:00Z",
    "content": "According to Iron Galaxy, the choice was made to create a more cohesive package\r\nWe may earn a commission from links on this page.",
    "full_content": "According to Iron Galaxy, the choice was made to create a more cohesive package"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": null,
    "title": "Intel Arrow Lake processors bottleneck PCIe 5.0 NVMe SSDs by 16%, limiting peak speeds to 12GB/s instead of 14GB/s",
    "description": null,
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_61325e9a-b38f-4195-92da-c8ee1f0147e2",
    "urlToImage": null,
    "publishedAt": "2025-05-08T11:23:12Z",
    "content": "If you click 'Accept all', we and our partners, including 241 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": "the-verge",
      "name": "The Verge"
    },
    "author": "Andrew Webster",
    "title": "Grand Theft Auto VI’s second trailer sets up its Bonnie and Clyde story",
    "description": "It’s been quite some time since Rockstar set the internet on fire with the first Grand Theft Auto VI trailer, and then subsequently delayed the game, but now we finally have a second look. The new trailer is — like the first — pretty heavily-focused on settin…",
    "url": "https://www.theverge.com/news/24235732/gta-6-grand-theft-auto-trailer",
    "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/Boobie_Ike_01.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
    "publishedAt": "2025-05-06T13:50:50Z",
    "content": "Heres your second look at Rockstars long-awaited follow-up.\r\nHeres your second look at Rockstars long-awaited follow-up.\r\nIts been quite some time since Rockstar set the internet on fire with the fir… [+1598 chars]",
    "full_content": "It’s been quite some time since Rockstar set the internet on fire with the first Grand Theft Auto VI trailer, and then subsequently delayed the game, but now we finally have a second look. The new trailer is — like the first — pretty heavily focused on setting up the characters and world, without much in the way of gameplay (though the developer does call it “the biggest, most immersive evolution of the series yet”)."
  },
  {
    "source": {
      "id": null,
      "name": "VentureBeat"
    },
    "author": "Dean Takahashi",
    "title": "Q1’s $7.8B in game investments and M&A marks largest quarter since 2023 | DDM",
    "description": "The game industry’s motto for all of last year was \"survive til 2025.\" And in some respects, that wasn't just wishful thinking.",
    "url": "https://venturebeat.com/games/q1s-7-8b-in-game-investments-and-ma-marks-largest-quarter-since-2023-ddm/",
    "urlToImage": "https://venturebeat.com/wp-content/uploads/2025/05/DDM-Games-Investment-Review-Q1-2025-Investment-Pie-Graph.jpg?w=1024?w=1200&strip=all",
    "publishedAt": "2025-05-08T15:00:00Z",
    "content": "The game industrys motto for all of last year was survive til 2025. And in some respects, that wasnt just wishful thinking. \r\n As the industry trudged through 2024, market researcher DDM saw positive… [+8032 chars]",
    "full_content": "The game industry’s motto for all of last year was “survive til 2025.” And in some respects, that wasn’t just wishful thinking.\n\nAs the industry trudged through 2024, market researcher DDM saw positive signs. And with one quarter of 2025 in the books, it certainly seems that things are trending in the right direction when it comes to game deals — investments or M&A.\n\nQ1 2025 not only marks the second consecutive quarter of growth, but it is the largest quarter since Q4 2023, with combined games investments and M&As totaling $7.8 billion across 245 transactions (+29% in value and +1% in volume compared to Q4’s $6.0B across 243 combined investments and M&As).\n\nQ1 2025 overview\n\nDDM’s count of M&A in the first quarter of 2025.\n\nQ1 2025 investments saw a significant increase in value, totaling $4.4 billion across 190 investments (+370% in value and -8% in volume compared to Q4’s $945.9 million across 207 investments) recording 4.7 times in value growth QoQ and the largest quarter since Q2 2022.\n\nQ1 2025 M&As saw a sizable decline in value, totaling $3.3 billion across 55 transactions (-34% in value and +53% in volume compared to Q4’s $5.1 billion across 36 transactions), despite having the largest quarterly volume since Q4 2022. That was largely driven by 44 undisclosed M&As (80% of total volume and 13% above the quarterly average of 67%).\n\nAnd the quarter saw a major surge in new fund announcements, totaling $21.8 billion across 43 funds (+122% in value and +13% in volume compared to Q4’s $9.8 billion across 38 funds), marking the largest quarter since Q2 2022; this 2.2 times QoQ value growth was driven by five funds collectively raising over $14.3 bilion (65% of the capital raised).\n\nMitchell Reavis, DDM games investment review director, said in a statement, “There’s no doubt that ‘survive til 2025’ became a defining mantra for the games industry during recent turbulent years. While DDM anticipates ongoing layoffs, strategic pivots, and the divestiture of non-core business offerings throughout 2025, the data reveals genuine signs of recovery with investment and M&A trends moving in the right direction.”\n\nSummary of investments\n\nQ1 2025 investments totaled $4.4 billion across 190 investments (+370% in value and -8% in volume compared to Q4’s $945.9 million across 207 investments) achieving a 4.7 times in value growth QoQ and the highest value since Q2 2022 of $6.1 billion; this achievement can be attributed to Infinite Reality’s $3.0 billion mid/late-staged investment from Sterling Select (67% of the quarter’s value).\n\nThe firm said Q1 2025 game developer investments totaled $4.0 billion across 103 investments (+457% in value and -27% in volume compared to Q4’s $720.0 million across 141 investments).\n\nArtificial intelligence and blockchain continue to receive ongoing investor enthusiasm as game industry artificial intelligence investments totaled $3.1 billion across 32 investments (+2,288% in value and +14% in volume compared to Q3’s $130.8 million across 28 investments) and games industry blockchain investments totaled $372.2 million across 28 investments (+74% in value and -50% in volume compared to Q4’s $214.5 million across 56 investments).\n\nThe highest segment by value was led by Tech/Other (86%), followed by Console/PC (8%), Mobile (5%), MCG* (1%), eSports (<1%), AR/VR (<1%) and Browser (<1%).\n\nAnd Q1 2025’s undisclosed investments totaled 93 investments (49% of the quarter); using historical averages to estimate the undisclosed investment values, Q1 2025 reached $4.9 billion [+/- $179.1 million].\n\nM&As\n\nDDM’s game investment tracking showed Q12025 was strong.\n\nThe quarter’s M&As totaled $3.3B across 55 transactions (-34% in value and +53% in volume compared to Q4’s $5.1B million across 36 transactions) achieving the highest quarterly volume since Q4 2022 of 63 transactions; the sizable decline in value is a result of undisclosed M&As totaled 44 transactions (80% the total volume or +13% above the quarterly average of 67%).\n\nQ1 2025 game developer M&As totaled $2.1 billion across 26 transactions (+7% in value and +53% in volume compared to Q4’s $2.0 billion across 17 transactions).\n\nThe highest M&A segment by value was led by mobile (63%), followed by console/PC (36%), MCG* (1%), and esports (<1%).\n\nAsia, Europe, and North America led M&A activity by both value and volume with Asia totaling for $1.3 billion over seven transactions (38% of the value and 13% of the volume) and Europe totaling $1.2 billion across 22 transactions (37% of the value and 40% of the volume); North America contributed 38% of the total transaction volume however, deal values were not disclosed.\n\nExits (M&A + IPOs)\n\nQ1 2025 Exits (M&As + IPO) totaled $5.6 billion across 56 transactions (+10% in value and +44% in volume compared to Q4’s $5.1 billion in value and 39 in volume) marking the largest quarter by volume since Q2 2022’s 67 transactions and a full-year of increased value dating back to Q1 2024 of $5.2 million.\n\nGrand Centrex’s SPAC reverse merger is the first such transaction since Semper Fortis Esports’ $15.9 million deal in Q4 2023.\n\nThe first quarter’s sole IPO had a market capitalization of $2.2 billion (+14,038% in value and -67% in volume compared to Q4’s $15.9 million in combined market capitalization across 3 IPOs).\n\nThe highest exit (M&A + IPOs) by segment value was led by tech/other (40%), followed by mobile (37%), console/PC (22%), MCG* (1%), and esports (<1%).\n\nFund Announcements\n\nGame deals by quarter.\n\n[Note: DDM tracks announcements from venture capital firms and funds on the new capital they raise that eventually become deployed in the investments in its reports].\n\nThe first quarter’s new fund announcements totaled $21.8 billion across 43 funds (+122% in value and +13% in volume compared to Q4’s $9.8 billion across 38 funds) marking the largest quarter for fund announcements since Q2 2022 of $25.1 billion across 40 funds; this 2.2 times QoQ value growth was driven by five funds collectively raising over $14.3 billion (65% of the capital raised): Bank of China ($6.9 billion), Khosla Ventures ($3.5 billion), Thoma Bravo ($1.9 billion), Haun Ventures ($1.0 billion), and the Government of India ($1.0B).\n\nWorth noting: Not all of that capital is going to be invested in games. Artificial intelligence and blockchain are still drawing significant interest from venture capital firms as funds targeting AI totaled $5.2 billion across 15 funds (+128% in value and +15% in volume compared to Q4’s $2.3 billion across 13 funds) and blockchain totaled $2.1B across 8 funds (+22% in value and -43% in volume compared to Q4’s $1.7 billion across 14 funds).\n\nFunds that were solely focused on early-staged companies dominated in value and volume raising $10.9 billion across 28 funds (50% of the value and 65% of the volume) with stage-agnostic funds trailing closely behind raising $8.8 billion across 13 funds (40% of value and 30% of the volume); funds focused solely on mid/late-staged companies raised $2.1 billion across two funds (10% of the value and 5% of the volume)\n\n*Mass Community Games (MCG) are games driven by online community play. Includes MMOs, MOBAs, battle royale, and metaverse games.\n\nMethodology\n\nIn reporting values, DDM only include deals when the investment or acquisition closes, not simply announced. This methodology has been used consistently with DDM data for 17+ years and it ensures that the company is measuring actual activity instead of potential activity.\n\nAdditionally, with SPACs, DDM considers the investment value to be what was raised in the transaction, not the company valuation afterward. This is consistent with how DDM tracks investment data, where it tracks the money raised in the transaction and, separately, its effect on the company’s overall enterprise value.\n\nThe exclusion of announced deals may result in a large difference between DDM’s quarterly total and other firms, but DDM said its methodology gives a clearer picture of the money deployed in the last quarter, providing valuable data consistency for companies evaluating game industry investment and acquisitions."
  },
  {
    "source": {
      "id": null,
      "name": "KSN-TV"
    },
    "author": "Carina Branson",
    "title": "‘We’re not gonna force the issue’: Standoff in south Wichita ends, police walk away",
    "description": "Just after 6 p.m., an incident prompted officers to gather in the 2100 block of S. Seneca St.",
    "url": "https://www.ksn.com/news/incident-prompts-large-police-presence-in-south-wichita/",
    "urlToImage": "https://media.zenfs.com/en/ksnw_wichita_articles_865/97ce9b068cb6e1e21991d0cfe0d7a159",
    "publishedAt": "2025-05-08T23:54:06Z",
    "content": "WICHITA, Kan. (KSNW) A standoff in south Wichita prompted a large police presence Thursday evening.\r\nJust after 6 p.m., police were dispatched to the Seneca Place Apartments in the 2100 block of S. S… [+2132 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Gizmodo.com"
    },
    "author": "Justin Carter",
    "title": "Kirsten Dunst and Mikey Madison Mermay Fall in Love In a New Movie",
    "description": "The two actresses will star in Reptilia, a 'dark and wet' thriller set in Florida about a mermaid seducing a human.",
    "url": "https://gizmodo.com/kirsten-dunst-and-mikey-madison-mermay-fall-in-love-in-a-new-movie-2000600444",
    "urlToImage": "https://gizmodo.com/app/uploads/2025/05/anora-mikey-madison.jpg",
    "publishedAt": "2025-05-10T16:25:56Z",
    "content": "Last month, we learned Mikey Madison, fresh off her Best Actress Oscar win for Anora, declined to join the cast of Star Wars: Starfighter. Now, we know what her next big role is, and it’s an interest… [+1176 chars]",
    "full_content": "Last month, we learned Mikey Madison, fresh off her Best Actress Oscar win for Anora, declined to join the cast of Star Wars: Starfighter. Now, we know what her next big role is, and it’s an interesting one: Reptilia, a movie about mermaids.\n\nPer the Hollywood Reporter, this is a “unique thriller” wherein a dental hygienist winds up “seduced by a mysterious mermaid into the dark and wet underworld of Florida’s exotic animal trade.” Madison’s costar is Kirsten Dunst, recently of Civil War and the upcoming Roofman, and according to THR’s Borys Kit, she’ll be the one doing the seducing. The film, which begins production in the fall, comes courtesy of director Alejandro Landes Echavarría, director of 2019’s war thriller Monos, working off a script he cowrote with Duke Merriman.\n\nNot counting the recent Little Mermaid remake, it’s been a while since we’ve had a major movie about the undersea people. But we’re in an era where classic monsters like vampires and mummies are coming back to the silver screen (or Netflix), so Reptilia is coming in at a good time. Can’t wait to see more about it, and what a mermaid’s doing over in Florida, in the coming months"
  }
]