[
  {
    "source": {
      "id": null,
      "name": "Internet"
    },
    "author": "info@thehackernews.com (The Hacker News)",
    "title": "Critical Langflow Flaw Added to CISA KEV List Amid Ongoing Exploitation Evidence",
    "description": "A recently disclosed critical security flaw impacting the open-source Langflow platform has been added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructure Security Agency (CISA), citing evidence of active exploita…",
    "url": "https://thehackernews.com/2025/05/critical-langflow-flaw-added-to-cisa.html",
    "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhw6sLlizbyssgoIYMOEX4lqWt_3mEDPsaarzYSyeiNQTZKoNGTa_DtPhOqZnGkt-4ThjqSIj1aXjP_Ok6z0bu255_1ZbZNLSS8HrzZ_8K9ZY83bSWFQ_uW79mv7YpgZy-OSIHJPI-np-zeYk1fjLTHdC2FZI10C0OGeqCgCbU42DLnprh6Apua4hSEyZEC/s728-rw-e365/langflow.jpg",
    "publishedAt": "2025-05-06T04:24:00Z",
    "content": "A recently disclosed critical security flaw impacting the open-source Langflow platform has been added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructur… [+1949 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "JB Orecchia, Forbes Councils Member, \n JB Orecchia, Forbes Councils Member\n https://www.forbes.com/councils/forbesfinancecouncil/people/jborecchia/",
    "title": "How Financial Institutions Can Reshape Gen Z’s Financial Road Map",
    "description": "Considering the myriad obstacles Gen Z is facing, FIs are strategically situated to change this generation’s financial lives.",
    "url": "https://www.forbes.com/councils/forbesfinancecouncil/2025/05/07/how-financial-institutions-can-reshape-gen-zs-financial-road-map/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5fa2b5f44f01240c3d0061f8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-07T11:00:00Z",
    "content": "JB Orecchia is the President and CEO of SavvyMoney. \r\ngetty\r\nMany members of Generation Z have taken a radically different financial journey than members of past generations. For example, recent rese… [+5341 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Hubspot.com"
    },
    "author": "juthompson@hubspot.com (Justina Thompson)",
    "title": "The best marketing campaigns of the year (thus far), what to learn from them, and why they worked so darn well [new data]",
    "description": "Cookie-scented body wash flew off the shelves. Shaken espressos made a comeback (as long as they’re associated with short ‘n sweet blondes), and, oddly, interactive guerrilla marketing caught a second wind (or whiff?). I think it’s safe to say that 2025, thus…",
    "url": "https://blog.hubspot.com/marketing/best-marketing-campaigns#article",
    "urlToImage": "https://knowledge.hubspot.com/hubfs/marketing-campaigns-1-20250508-1357892.webp",
    "publishedAt": "2025-05-12T11:00:00Z",
    "content": "Cookie-scented body wash flew off the shelves. Shaken espressos made a comeback (as long as theyre associated with short n sweet blondes), and, oddly, interactive guerrilla marketing caught a second … [+22273 chars]",
    "full_content": "Cookie-scented body wash flew off the shelves. Shaken espressos made a comeback (as long as they’re associated with short ‘n sweet blondes), and, oddly, interactive guerrilla marketing caught a second wind (or whiff?). I think it’s safe to say that 2025, thus far, has been a chaotically charming year to be both a marketer and, in turn, consume it.\n\nThis year, tons of digital marketing campaigns circulated social media channels and group chats, but, as the old proverb goes, only the most stellar stood out. Get the full rundown of which brand moments made the cut below. Plus, get an inside look at why these campaigns performed so well with a peek at original data from HubSpot’s annual State of Marketing Report.\n\nTable of Contents:\n\nThe Latest Data About Marketing Trends You Should Know\n\nIn my opinion, no marketing campaign is successful all on its own. A top-tier marketing campaign is only defined by the people, trends and data, consumers, and cultural commentary that shape its impact.\n\nThat said, take a look at fresh data from HubSpot’s 2025 State of Marketing Report for an insights-driven perspective on why this year’s biggest and best digital marketing campaigns captured the hearts (and pockets) of modern consumers everywhere:\n\nFree Marketing Plan Template Outline your company's marketing strategy in one simple, coherent plan. Pre-Sectioned Template\n\nPre-Sectioned Template Completely Customizable\n\nCompletely Customizable Example Prompts\n\nExample Prompts Professionally Designed Download for free Learn more Download for free Download Free All fields are required. You're all set! Click this link to access this resource at any time. Download Now\n\n92% of marketers plan to maintain or increase their investments in brand awareness in 2025.\n\n1 in 4 (25%) marketers are currently exploring creating content that reflects their brand’s values.\n\nThe top reported advantages of using data to inform marketing strategy are: 1) reaching target audiences more effectively (35%), 2) increasing the ROI of marketing efforts (34%), and 3) planning media mixes more effectively (32%).\n\nThe top reported ways that marketers believe the marketing industry has changed in the past year are: 1) focusing on the customer and their experience (44%), 2) creating content that reflects your brand’s values (35%), 3) using data to inform marketing efforts (35%), and 4) using data to demonstrate the ROI and business value of marketing efforts (31%).\n\nOver 70% of marketers plan to target Millennials in 2025.\n\nThe Best Marketing Campaigns of This Year\n\nAs I’ve already mentioned, 2025 is already shaping up to be a pretty dope year for marketing, particularly digital marketing campaigns. From Rhode Skin to Dove and Crumbl Cookie, unconventional, authentic, audience-first marketing campaigns are setting the standard for what it means to do brand identity, storytelling, and consumer visibility right.\n\nTake a look below for my full list of marketing campaign favorites from this year thus far (and what you can take away from them):\n\n1. Rhode Skin: Peptide Lip Shape Launch\n\nSince its inception in 2022, Rhode Skin has been the talk of the (beauty) town. With a focus on scent-free, sensitive skin-friendly, clean, and simple offerings, Hailey Bieber’s first-ever beauty venture was a hit with every product launch.\n\nSource\n\nIn January 2025, to complement its growing collection of lip-specific product options, Rhode unleashed a new showstopper to the beauty rodeo: lip liners. (And while I would argue that the beauty industry does not need another “must-have lip staple,” many beauty consumers, creators, and connoisseurs demonstrated that Rhode’s take on the sculpted lip was worth the hype and investment.)\n\nThus, Rhode’s Peptide Lip Shape campaign went live, and the internet … went crazy over it — in both a good and “bad” way (more context on the “bad” later).\n\nSource\n\nThe social media marketing campaign on Instagram featured sporty, movement-focused aesthetics (to represent the flexibility of the actual product) paired with classic 90s it-girl motifs — a signature emblem that Hailey has been known to lean into throughout Rhode’s branding and visuals — and the faces of Tate McRae as well as other cool-girl-coded models that perfectly embodied what it means to be a true, glazed Rhode girl.\n\nSource\n\nSource\n\nNow, enter: the “bad” I mentioned above. When Rhode’s Peptide Lip Shape actually arrived in folks’ hands, consumers had a lot to say about how the product was meant to be worn, its shade inclusivity (which has been a misstep for Rhode before; if you don’t know about it, do some research research their initial pocket blush launch), and its actual wear-longevity. The girls (rightfully) had questions, comments, and concerns!\n\nNevertheless, the average beauty consumer seemed pretty open to testing Rhode’s newest addition out (whether they bought it themselves or received it through a PR list), sharing user-generated content (UGC) with their followers and feeds, and offering their honest opinion about the product to the world.\n\nI say all of this to say: Mixed reviews and all, Rhode’s Peptide Lip Shape campaign still made waves — online and IRL. There’s much to extract here — from the brand’s marketing wins to mistakes — so here’s what lessons I think you can implement into your next marketing campaign:\n\nFree Marketing Plan Template Outline your company's marketing strategy in one simple, coherent plan. Pre-Sectioned Template\n\nPre-Sectioned Template Completely Customizable\n\nCompletely Customizable Example Prompts\n\nExample Prompts Professionally Designed Download for free Learn more Download for free Download Free All fields are required. You're all set! Click this link to access this resource at any time. Download Now\n\nLean into aesthetic storytelling. Rhode succeeded by aligning the Peptide Lip Shape launch with visuals rooted in flexibility, movement, and 90s nostalgia — a perfect match for Hailey’s brand persona and Gen Z’s sensibilities.\n\nRhode succeeded by aligning the Peptide Lip Shape launch with visuals rooted in flexibility, movement, and 90s nostalgia — a perfect match for Hailey’s brand persona and Gen Z’s sensibilities. Own the conversations that are being had about your product or service, even when they’re messy. Rhode didn’t shy away from user feedback. After experiencing backlash about shade diversity for its blushes, the brand confronted their mistake and ensured that its Peptide Lip Shape collection was universal and inclusive.\n\nRhode didn’t shy away from user feedback. After experiencing backlash about shade diversity for its blushes, the brand confronted their mistake and ensured that its Peptide Lip Shape collection was universal and inclusive. Let UGC do the legwork. When Peptide Lip Shape hit Rhode’s site, it was the consumers — not just the brand — who amplified reach. Bolstering consumer content made the campaign feel real, not overproduced.\n\nAlso, here’s a pro tip: If you need some help (without the headache) designing a multi-platform marketing strategy, you might want to give HubSpot’s Free Marketing Plan Template a try. It comes fully equipped with all the resources you need — from a SWOT analysis breakdown to a budget sheet — to plan next your campaign smarter, not harder.\n\n2. Dunkin’ Donuts: Sabrina Carpenter’s Shakin’ Espresso\n\nAlmost every year, Dunkin’ sweeps with a celebrity-signed sweet treat launch. We all know it’s coming. I think we all almost look forward to it. In 2021, it was Charli D’Amelio’s “Charli Cold Foam” beverage; the year before that, it was Ice Spice and her official Ice Spice Munchkins Drink. But in 2025, Dunkin’ tapped the only five-foot blonde that timelines wouldn’t stop talking about: Sabrina Carpenter.\n\nSource\n\nIn honor of her chart-topping single, “Espresso,” Dunkin’ Donuts collaborated with Sabrina to create a very on-brand version of a Brown Sugar Shakin’ Espresso. Stamped by Sabrina’s go-to kiss mark and her undeniably fresh Gen Z wit, this collaboration was truly a match made in marketing heaven. Dunkin’ even hard-launched this partnership with a hilariously inappropriate — in true Sabrina fashion — commercial. The title? Shakin’ that Ess. (BTW: I laughed out loud, so I know you did.)\n\nWhile most of this campaign was social media-oriented, I think there are so many reasons why it 1) worked and 2) got people talking. There’s a lot for brands to take away from Dunkin’s power move, so here’s what I think is worth taking notes on:\n\nEmbrace (pop) cultural timing. Dunkin’ dropped this collab as “Espresso” (and Sabrina Carpenter in general) was still at peak virality — riding the wave of Sabrina’s momentum instead of trying to concoct buzz.\n\nDunkin’ dropped this collab as “Espresso” (and Sabrina Carpenter in general) was still at peak virality — riding the wave of Sabrina’s momentum instead of trying to concoct buzz. Tone-matching is everything. The Shaken’ Ess campaign embraced Sabrina’s playful, tongue-in-cheek persona perfectly, which made the campaign feel more authentic and less manufactured.\n\nThe Shaken’ Ess campaign embraced Sabrina’s playful, tongue-in-cheek persona perfectly, which made the campaign feel more authentic and less manufactured. If you can, embrace the power of a multi-sensory hook. From the name of the drink to the kiss-mark branding and cheeky video rollout, Dunkin’s campaign rollout hit every touchpoint — visual, auditory, and emotional — turning a celeb drink collaboration into a full-on brand moment.\n\n3. Bumble: Amelia Dimoldenberg x Interview Magazine\n\nIf you’re chronically online (like me), you know that comedian Amelia Dimoldenberg, also known as the host of the “Chicken Shop Date” web series on YouTube, is one of the most endearingly flirty, funny, and high key awkward gals with a platform right now. And you want to know what else is endearingly awkward and also prompts a whole lot of laughs? Finding love through a dating app.\n\nSource\n\nLuckily, Bumble, with the help of their year-long content partner, the iconic Interview Mag, knew this, took it, and ran with it … with Amelia’s darling hand entangled with their Q1 digital marketing efforts.\n\nAnd Bumble’s campaign didn’t just seize a relevant face for clicks and views. On the strategy side, the dating app’s social media marketing efforts targeted Amelia’s personal YouTube channel (‘cause duh) and Instagram, along with their own native social media channels (primarily Instagram and TikTok), with tons of digestible, short-form video content to keep audiences engaged.\n\nFrom a marketing campaign perspective, these moves from Bumble were brilliant, particularly because they were massively called out in 2024 for releasing an anti-celibacy, anti-woman ad. Plus, on another note, having turned this campaign into an editorial/interview-style moment — something that Bumble hasn’t ever done before — signaled a bold, playful, refreshing campaign that actually resonated with online communities.\n\nSource\n\nHere’s what inspiration I think brands can draw from Bumble:\n\nWhen you’ve done wrong, do better the next time around. After backlash in 2024, Bumble didn’t ignore criticism — they recalibrated with self-awareness, humor, and a culturally relevant face who embodied the brand’s softer side.\n\nAfter backlash in 2024, Bumble didn’t ignore criticism — they recalibrated with self-awareness, humor, and a culturally relevant face who embodied the brand’s softer side. Stretch your (content) format. By blending short-form social content with an editorial-style rollout, Bumble pushed a typical influencer partnership into branded storytelling.\n\nBy blending short-form social content with an editorial-style rollout, Bumble pushed a typical influencer partnership into branded storytelling. If you’re going to work with internet personalities or influencers, tap the ones that align with your brand values and identity. The campaign worked because it felt real — Amelia’s charm paired naturally with Bumble’s forthright perspectives on online dating, creating authentic, shareable content.\n\n4. Billie: Scratch and Sniff Pits\n\nMove over Native, Suave, and Secret. Billie, the Gen Z-coded razor and bodycare brand, didn’t just steal your swag in 2025 — they reinvented it entirely and, shockingly, were bold enough to target people where they knew they’d catch their attention: on the streets they roam.\n\nSource\n\nIn April 2025, Billie literally hit the streets of New York to preview their new coconut-vanilla scented deodorant — a new addition to the brand’s collection of several non-shave products. With huge, guerrilla-style “scratch and sniff” posters, Billie debuted its product to thousands of fresh eyes (and brave noses), clearly demonstrating a contemporary commitment to bringing back old school experiential marketing.\n\nSource\n\nEven if you wouldn’t personally market your brand’s product in this way, neither of us can hate too much on Billie’s swag. Ultimately, they did their big one by leveraging and executing the unconventional. If you liked what they did to pull this off, these are the power plays I recommend keeping in your back pocket:\n\nIf you’ve got the budget to do so, go beyond the scroll. In a hyper-digital world, Billie proved that IRL activations, when paired with bold creative tactics, can break through the noise in ways paid ads simply can’t.\n\nIn a hyper-digital world, Billie proved that IRL activations, when paired with bold creative tactics, can break through the noise in ways paid ads simply can’t. Make scent (or any sense) a part of your campaign strategy. Billie’s scratch-and-sniff posters weren’t just quirky — they were memorable. Think beyond visuals and engage multiple senses when possible.\n\nBillie’s scratch-and-sniff posters weren’t just quirky — they were memorable. Think beyond visuals and engage multiple senses when possible. Don’t play it safe with product launches. Billie didn’t just post a product shot — they built a moment. Turning a basic deodorant drop into a street-level spectacle gave consumers something to talk (and post) about.\n\n5. Dove: Dove x Crumbl Cookie\n\nCrumbl Cookie made waves in 2024, so it was only fitting that they did so again in 2025. However, I personally never imagined that their next move would be to make the impossible possible. But with some unexpected brand chemistry and a little bit of scent-engineering from Dove, they made it happen — and went viral while doing it.\n\nSource\n\nWhen both brands announced they’d be collaborating to create a cookie-scented body care line, many people (rightfully so) asked, “Why?” Confused consumers took to the internet to share their hot takes, disdain, and, for a few, excitement, about this unexpected mashup.\n\nWhile most level-headed people are not actively using a strawberry crumb cake body scrub for their daily showers, I think that Dove’s choice to collaborate with Crumbl Cookie wasn’t about rationale. It was about digital momentum, explosive reach, and product experimentation.\n\nIn short, this 2025 marketing campaign was indeed uncanny, but it worked. Avid Crumbl Cookie taste-testers ran to Walmart stores to pick up items from this exclusive collection, and some even offered reviews through YouTube and TikTok to show folks what they were really missing.\n\nRegardless of how you felt about this marketing campaign taking up space in 2025, there’s mastery in the mayhem. If you’re curious about why this marketing campaign worked, these are the learnings I suggest you zero in on:\n\nFree Marketing Plan Template Outline your company's marketing strategy in one simple, coherent plan. Pre-Sectioned Template\n\nPre-Sectioned Template Completely Customizable\n\nCompletely Customizable Example Prompts\n\nExample Prompts Professionally Designed Download for free Learn more Download for free Download Free All fields are required. You're all set! Click this link to access this resource at any time. Download Now\n\nLean into the absurd — if it’s on-brand. We both know that a cookie-scented body scrub was never a logical product extension, but it was weird enough to spark conversation and get people talking, which is half the battle.\n\nWe both know that a cookie-scented body scrub was never a logical product extension, but it was weird enough to spark conversation and get people talking, which is half the battle. Create culture collisions. Unconventional brand pairings (like Dove and Crumbl) force audiences to pay attention, especially when the collab taps into things like sensory appeal and/or novelty.\n\nUnconventional brand pairings (like Dove and Crumbl) force audiences to pay attention, especially when the collab taps into things like sensory appeal and/or novelty. Use scarcity to fuel buzz. The limited-time drop and exclusive retail partnership with Walmart added urgency, driving traffic and user-generated reviews that extended the campaign’s shelf life.\n\n6. Severance: Severance x Grand Central Station (plus Lumon’s super dope LinkedIn presence)\n\n2025 quickly became the year of Severance. After a three-year hiatus, the jaw-dropping Apple TV original’s Season 2 comeback did not disappoint. It also wasn’t subtle.\n\nSource\n\nTo commemorate the return of the long-awaited second season, the entire Severance show cast — Adam Scott, Britt Lower, Zach Cherry, Patricia Arquette, and Tramell Tillman — placed themselves on display in a glass box in Grand Central Station’s Vanderbilt Hall.\n\nIn the company of some replica furniture from the show’s Macrodata Refinement department — a cubicle-style set-up, desktop computers, and sterile office props straight out of Lumon Industries — the Severance squad put on a mini-performance of a lifetime in front of Grand Central’s passersby.\n\nFolks were really into it, too. They even brought their cameras.\n\nSource\n\nIn addition to this exhibitionist marketing installation, the Severance digital marketing team was hard at work building an astoundingly on-brand LinkedIn presence for the show as it aired weekly.\n\nOn LinkedIn, Lumon Industries shared weekly cryptic, Lumon-themed posts to keep fans and viewers guessing about what could be next for the show’s characters as its Season 2 plot unfolded every Friday until the show’s finale.\n\nMany people praised the Severance marketing team for its commitment to creating memorable experiences for its viewers, both online and offline. If you’re hoping to do the same for your next marketing campaign, here’s what I think you can learn (and steal) from Severance’s Season 2 marketing efforts:\n\nBuild immersive worlds, not just campaigns. From in-person pop-ups to an entire LinkedIn persona, Severance didn’t just promote a show — it extended its universe into everyday life.\n\nFrom in-person pop-ups to an entire LinkedIn persona, Severance didn’t just promote a show — it extended its universe into everyday life. Surprise your audience in unexpected places. The Grand Central stunt and corporate-themed LinkedIn presence gave fans something fresh and out of context (but still within bounds), which made it all the more memorable.\n\nThe Grand Central stunt and corporate-themed LinkedIn presence gave fans something fresh and out of context (but still within bounds), which made it all the more memorable. Commit to the bit. The Severance team stuck to its eerie, hyper-professional tone across all touchpoints. When your tone, content, and platform choices are aligned, the whole campaign feels stronger and more cohesive.\n\n7. Nike: “So Win” x WNBA\n\nFrom Angel Reese to Caitlin Clark, the female athletes of the Women’s National Basketball Association (WNBA) had folks rooting for their big wins, court-related or not, during all of 2024. In 2025, the love and support continued with a WNBA-centered marketing campaign from Nike.\n\nSource\n\nThe “So Win” campaign commercial debuted during Super Bowl 59 in February; it featured a motivational monologue from none other than Doechii, and its digital marketing rollout featured a few other non-WNBA athletes (i.e., Sha’Carri Richardson, Sophia Wilson).\n\nSource\n\nTons of visually stunning editorial clips of each athlete, juxtaposed with some short vignettes of their most groundbreaking moments as professional athletes, created a resonant narrative about what it means to be a woman who works hard in sports, or what it means to be a woman who works hard (but is still questioned about her dedication and strength).\n\nWhen it comes to promoting their products, Nike has always known how to bring the heat. But this marketing campaign in particular? It felt like an elevated version of the emotion-meets-performance narrative work they do best. Critics online even agreed.\n\nSource\n\nSource\n\nBelow, review soe marketing gems that I think you can learn from Nike’s “So Win” campaign execution:\n\nGo cinematic, not just commercial. The visual and editorial quality of the campaign leaned more like a short film than a product promo — proof that brand storytelling thrives when it feels premium and personal.\n\nThe visual and editorial quality of the campaign leaned more like a short film than a product promo — proof that brand storytelling thrives when it feels premium and personal. Reframe the campaign spotlight. By shifting focus from just the game to the grind, Nike tapped into a more inclusive and emotionally resonant story — broadening their audience without losing athletic credibility.\n\nBy shifting focus from just the game to the grind, Nike tapped into a more inclusive and emotionally resonant story — broadening their audience without losing athletic credibility. Layer your cast intentionally. Including non-WNBA athletes like Sha’Carri Richardson created intersections across sports, elevating the campaign beyond basketball and helping it hit different cultural corners.\n\n8. Heaven by Marc Jacobs: Heaven x Starface\n\nIf you’re not familiar with Heaven by Marc Jacobs or Starface, get familiar.\n\nSource\n\nBoth brands have entirely redefined what it means to be rule breakers in their respective industries — Starface in beauty and skincare, Heaven in luxury fashion and decor — and by joining forces for a limited-time capsule drop of tattoo pimple patches, they’ve blurred the line between skincare and self-expression.\n\nSource\n\nThe campaign, which primarily rolled out on Starface’s Instagram, also featured the unforgettable faces of Gen Z’s pop culture scene (i.e., Lil’ Uzi Vert, Beabadoobee, BB Trickz, etc.), all of whom have already become spokespeople for the brand in its previous campaigns. (Now, you may not know these names, you may not even care about what they do or why they’re popular — but Starface’s and Marc Jacobs’ consumers do. And that’s the whole reason why this campaign attracted traction online.)\n\nSource\n\nIf you want to do Gen Z-marketing right, consider Starface and Heaven by Marc Jacobs your Krabby Patty formula. Check out what ingredients you can snag for your next marketing campaign below:\n\nCast with cultural fluency. Don’t just go after “cool influencers” — tap people who are actually shaping the subcultures your audience cares about. Collaborations that are tailor-made to the audiences that love your brand will garner attention without you (or your digital marketing team) lifting a finger.\n\nDon’t just go after “cool influencers” — tap people who are actually shaping the subcultures your audience cares about. Collaborations that are tailor-made to the audiences that love your brand will garner attention without you (or your digital marketing team) lifting a finger. Let the product be weird (on purpose). Tattoo pimple patches aren’t just skincare — it’s statement-making. Gen Z embraces the unexpected, especially when it doubles as self-expression.\n\nTattoo pimple patches aren’t just skincare — it’s statement-making. Gen Z embraces the unexpected, especially when it doubles as self-expression. Match the vibe, not just the platform. Starface and Heaven didn’t just post on Instagram — they posted on Instagram like themselves. Tailor your tone, aesthetics, and language to feel native to both your brand and your audience’s feed.\n\n9. NYX Professional Makeup: NYX Fat Lip Oil x Big Fat Kiss Campaign\n\nBack in February 2025, NYX Professional Makeup, in collaboration with DraftKings, took to Super Bowl 59 to promote its collection of NYX Fat Oils, a shade-diverse lineup of shiny lip glosses, and used one of the internet’s funniest personalities, Brittany Broski, to sell the hype.\n\nSource\n\nThis marketing campaign was purely designed for social. It launched on Instagram and was even paired with a $60,000 predictions-based contest that encouraged sports fans and beauty lovers to cast their vote via DraftKings for which team would score big during football’s biggest night.\n\nSource\n\nLeading up to the Super Bowl, NYX fueled their Instagram, YouTube, and TikTok with organic user-generated content mixed with short-form, humor-filled video content of Brittany hamming up — in true sports commentator style — how NYX is prepping for the second biggest moment after the game: the big fat kiss.\n\nThis marketing campaign was major for NYX and was also their first influencer-led campaign of the year. While it was short-lived, there’s stuff to learn from its strategy. Here’s what I think you ought to bookmark from it:\n\nTap into culture collisions. NYX x DraftKings was unexpected — but that’s what made it memorable. Cross-category collabs create fresh talking points, especially when they blend beauty and sports in a way that feels playful, not forced.\n\nNYX x DraftKings was unexpected — but that’s what made it memorable. Cross-category collabs create fresh talking points, especially when they blend beauty and sports in a way that feels playful, not forced. Put your talent in their element, then trust them to deliver. Brittany Broski’s charm came through because the content matched her tone — comedic, fun, and fully Gen Z-coded. Let your influencer shine in their own voice.\n\nBrittany Broski’s charm came through because the content matched her tone — comedic, fun, and fully Gen Z-coded. Let your influencer shine in their own voice. Design for scroll-first success. NYX built this campaign with virality in mind: bite-sized video, UGC, and humor tailored to social platforms. When your audience is moving fast, give them multiple reasons and opportunities to slow down (and engage).\n\nNot Just Noise: Campaigns That Cut Through\n\nIf there’s one thing this year’s standouts made clear, it’s that meaningful marketing doesn’t have to be polished to be powerful. In fact, I think that 2025 proved that marketing campaigns need to be more loud, more offbeat, more unapologetically niche — ‘cause clearly, resonance outshines reach.\n\nSo as you plan your next big launch or brand refresh, ask yourself: are you adding to the noise — or creating something that might actually break through it?\n\nEditor's note: This post was originally published in December 2023 and has been updated for comprehensiveness."
  },
  {
    "source": {
      "id": null,
      "name": "Highsnobiety"
    },
    "author": null,
    "title": "Un-Gatekeeping the Tree-Hugger Tote",
    "description": "Made from scraps of truck tarp, FREITAG bags from Switzerland have long been a hit amongst eco-attuned shoppers. Now they're coming for the In-crowd.",
    "url": "https://www.highsnobiety.com/p/freitag-bag-trend/",
    "urlToImage": "https://www.highsnobiety.com/static-assets/dato/1745852246-freitag-hed.jpg",
    "publishedAt": "2025-05-08T10:00:00Z",
    "content": "They took their sweet, sweet time but FREITAG bags have at long last found their cool and hit IYKYK accessory status. As a years-long fan, I must reluctantly un-gatekeep.\r\nOnce my sock-and-sandal-wea… [+2907 chars]",
    "full_content": "They took their sweet, sweet time but FREITAG bags have at long last found their cool and hit IYKYK accessory status. As a years-long fan, I must reluctantly un-gatekeep.\n\nOnce my sock-and-sandal-wearing geography teacher's satchel-maker of choice, the Swiss brand has become an unassuming favorite amongst style-savvy city folk. I'd know ‘cause I see them all around me.\n\nSure, it has long been popular with an eco-conscious, slightly cliché cohort of otherwise disengaged consumers. But FREITAG is picking up momentum among young fashion disciples, not unlike what happened to Birkenstock.\n\nFREITAG was founded in 1993 in response to Markus Freitag’s need for a roomy, waterproof means of carrying his coursework.\n\nYour Highsnobiety privacy settings have blocked this Instagram post. Enable All Media Manage consent Privacy policy\n\nLegend has it that, while studying art in Zurich, he noticed trucks zooming past on a nearby freeway and felt compelled to reimagine their colorful tarpaulins as bags.\n\nYour Highsnobiety privacy settings have blocked this Tiktok. Enable All Media Manage consent Privacy policy\n\nTo this day, every FREITAG bag is still cut from weathered truck tarps with old seatbelts for straps. It's in their nature to be unequivocally unique in pattern and texture.\n\nNo FREITAG is exactly like another, each individually assembled from a stock of circularly salvaged textiles and priced anywhere between $100 to $400.\n\nAdd a handful of scene-y collaborations with the likes of Hender Scheme and COMME des GARÇONS — FREITAG has particularly style-conscious presence in Japan, where it maintains a flagship in Shibuya — a couple of especially smart stockists, and you've got yourself an intriguing case study.\n\nCOMME des GARÇONS x FREITAG COMME des GARÇONS 1 / 9\n\nFor most of its lifespan, FREITAG was more functional than cool. Its sturdily sizeable bags and green-ish backstory granted it popularity with a bookish, if not stylish, sort of shopper.\n\nYour Highsnobiety privacy settings have blocked this Tiktok. Enable All Media Manage consent Privacy policy\n\nBut, as far as today's 'fit-checking Gen Zs are concerned, FREITAG is due more flowers. Its bags are a welcome relief from overhyped competitors to some, a “Cool Copenhagen Girly workwear bag” to others. Its crossbodies are what one ought to opt into when seeking something with more personality than the COSs and UNIQLOs of the world.\n\nThough somewhat painful for me to say, I fear this might be a taste of the slow-growing but juicy fruits of FREITAG's low-key splendid social media game, labored by its own camp as much as by fans.\n\nEach party has put a PR team's worth of efforts, actual or figurative, purposefully or not, into shifting the bags’ perception from tree-hugger totes to familiar TikTok sight, not despite but because of FREITAG's previous lack of cool.\n\nYour Highsnobiety privacy settings have blocked this Tiktok. Enable All Media Manage consent Privacy policy\n\nAre we on the cusp of a post-Wirkin Sirkin — the Sustainable Birkin? Nah, don't think so. But does the FREITAG have the potential to resemble a Telfar-ian takeover?\n\nYour Highsnobiety privacy settings have blocked this Tiktok. Enable All Media Manage consent Privacy policy\n\nI mean, hey, quasi-recyclable bags seem all the rave anyway, am I right?"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Colleen Batchelder, Contributor, \n Colleen Batchelder, Contributor\n https://www.forbes.com/sites/colleenbatchelder/",
    "title": "3 Experts Weigh In On Why Gen Z Is Struggling To Find Happiness",
    "description": "Find out why Gen Z is struggling to find happiness, as experts break down the unique pressures and roadblocks facing this generation.",
    "url": "https://www.forbes.com/sites/colleenbatchelder/2025/05/05/3-experts-weigh-in-on-why-gen-z-is-struggling-to-find-happiness/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68196c5f8160b05d9298d5e2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-06T03:38:38Z",
    "content": "Young Gen Z asian girl wearing casual sweatshirt with hoodie over white background. Relaxed with sad ... More expression on face. Simple and natural looking at the camera.\r\ngetty\r\nHow many of you wis… [+4880 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "HipHopDX"
    },
    "author": "Sam Moore",
    "title": "JAY-Z Claims Rape Accuser Cost Him Almost $200 Million",
    "description": "JAY-Z has claimed that allegations that he raped a 13-year-old girl cost him and his companies almost $200 million in contracts and loans.",
    "url": "https://hiphopdx.com/news/jay-z-claims-rape-accuser-cost-him-almost-200-million",
    "urlToImage": "https://app.hiphopdx.com/wp-content/uploads/2025/02/jay-z-given-boost-in-tony-buzbee-defamation-case-over-social-media-slip-up.jpg?w=1200",
    "publishedAt": "2025-05-07T16:00:46Z",
    "content": "JAY-Z has claimed that the rape accusations aimed at him by an anonymous woman has cost him almost $200 million.\r\nIn an amendment to his defamation lawsuit against the anonymous accuser and her attor… [+2548 chars]",
    "full_content": "JAY-Z has claimed that the rape accusations aimed at him by an anonymous woman has cost him almost $200 million.\n\nIn an amendment to his defamation lawsuit against the anonymous accuser and her attorney, Tony Buzbee, the rap mogul alleges that he suffered serious financial harm resulting from the accusations.\n\nThe filing claims Jay “lost other contracts in the sports and entertainment space that would have generated revenues of, at least, $20 million.”\n\nThe Roc Nation founder claims the total would have been far higher if the contract had been carried out.\n\nAD AD LOADING... AD\n\nJay also claims that he was denied a $55 million credit line and that Roc Nation itself was refused a $115 million loan from a bank.\n\nJay-Z amended his lawsuit against attorney Tony Buzbee and the woman who sued him for rape. This is new: “Buzbee directed employees to edit Wikipedia pages to enhance Buzbee’s image and damage Mr. Carter’s and Roc Nation’s reputations.” https://t.co/IPjJGmh0DYpic.twitter.com/3SEIljMNpD — Meghann Cuniff (@meghanncuniff) May 6, 2025\n\nThe filing further states: “We have agreements to produce entertainment programs for certain sporting events. After Mr. Buzbee filed the lawsuit, the media reported that other businesses could end their deals with Roc Nation, and forced one to speak out and address whether these false allegations would end our business relationship.”\n\nAD AD LOADING... AD\n\nJAY-Z’s rape accuser has previously filed to get his defamation lawsuit against her dismissed.\n\nThe woman originally claimed that JAY-Z and Diddy raped her when she was 13 before she dropped her suit after numerous discrepancies were found in her story.\n\nAfter she dropped her own lawsuit, Jay filed one of his own, accusing the woman and her controversial attorney, Tony Buzbee, of defamation for bringing the case in the first place.\n\nrelated news JAY-Z’s Rape Accuser Heard On Recording Saying He Didn't Assault Her March 12, 2025\n\nThe anonymous woman has now motioned a judge for dismissal, claiming that JAY-Z can’t sue her as the claims were made in court documents and thus protected by law.\n\nAD AD LOADING... AD\n\nShe also claims that an interview she did with NBC was based entirely on the contents of the court documents.\n\nBuzbee also previously filed a motion to dismiss, claiming that he and JAY-Z had come to an agreement.\n\nThe filing stated: “Eventually, the relentless pressure that Mr. Carter and his associates placed upon Doe became too much for her. On February 4, 2025, an agreement to resolve the litigation was reached between Doe and Mr. Carter, through their attorneys, which included the voluntary dismissal of the SDNY Action.”\n\nHowever, Jay’s attorney claims that no such agreement exists: “Total lie. He brought a false case, lost badly and was forced to dismiss quickly. End of story.”"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Promising Airline Stocks To Follow Today – May 6th",
    "description": "TransDigm Group, American Airlines Group, and Zscaler are the three Airline stocks to watch today, according to MarketBeat’s stock screener tool. Airline stocks are shares of publicly traded companies that operate passenger or cargo air transportation service…",
    "url": "https://www.etfdailynews.com/2025/05/08/promising-airline-stocks-to-follow-today-may-6th/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/transdigm-group-incorporated-logo-1200x675.png?v=20231222092553&w=240&h=240&zc=2",
    "publishedAt": "2025-05-08T06:02:47Z",
    "content": "TransDigm Group, American Airlines Group, and Zscaler are the three Airline stocks to watch today, according to MarketBeat’s stock screener tool. Airline stocks are shares of publicly traded companie… [+3627 chars]",
    "full_content": "TransDigm Group, American Airlines Group, and Zscaler are the three Airline stocks to watch today, according to MarketBeat’s stock screener tool. Airline stocks are shares of publicly traded companies that operate passenger or cargo air transportation services. They represent an ownership stake in airlines, whose financial performance depends heavily on factors like passenger demand, fuel prices, labor agreements and industry regulations. Because airlines carry high fixed costs and are sensitive to economic cycles and external shocks, their stocks tend to experience greater volatility than the broader market. These companies had the highest dollar trading volume of any Airline stocks within the last several days.\n\nGet alerts:\n\nTransDigm Group (TDG)\n\nTransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. The Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, sensor products, switches and relay panels, hoists, winches and lifting devices, and cargo loading and handling systems.\n\nTransDigm Group stock traded down $84.77 during mid-day trading on Tuesday, reaching $1,387.85. 243,014 shares of the company were exchanged, compared to its average volume of 257,707. TransDigm Group has a twelve month low of $1,176.31 and a twelve month high of $1,488.54. The firm has a market cap of $77.84 billion, a PE ratio of 48.84, a price-to-earnings-growth ratio of 2.76 and a beta of 1.09. The firm’s 50-day simple moving average is $1,351.72 and its two-hundred day simple moving average is $1,320.86.\n\nRead Our Latest Research Report on TDG\n\nAmerican Airlines Group (AAL)\n\nAmerican Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle/Tacoma, Sydney, and Tokyo.\n\nShares of NASDAQ AAL traded down $0.14 during trading on Tuesday, hitting $10.53. 28,090,132 shares of the company were exchanged, compared to its average volume of 39,557,299. American Airlines Group has a 1 year low of $8.50 and a 1 year high of $19.10. The company has a market cap of $6.94 billion, a price-to-earnings ratio of 9.21, a PEG ratio of 0.21 and a beta of 1.31. The firm’s fifty day moving average price is $10.83 and its 200 day moving average price is $14.15.\n\nRead Our Latest Research Report on AAL\n\nZscaler (ZS)\n\nZscaler, Inc. operates as a cloud security company worldwide. The company offers Zscaler Internet Access solution that provides users, workloads, IoT, and OT devices secure access to externally managed applications, including software-as-a-service (SaaS) applications and internet destinations; and Zscaler Private Access solution, which is designed to provide access to managed applications hosted internally in data centers, and private or public clouds.\n\nShares of Zscaler stock traded up $1.21 during trading on Tuesday, hitting $234.19. 773,765 shares of the company were exchanged, compared to its average volume of 2,008,386. The firm has a 50 day moving average price of $202.39 and a 200 day moving average price of $198.78. Zscaler has a fifty-two week low of $153.45 and a fifty-two week high of $235.67. The stock has a market capitalization of $36.23 billion, a price-to-earnings ratio of -935.78 and a beta of 1.14.\n\nRead Our Latest Research Report on ZS\n\nSee Also"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Jeff Fromm, Contributor, \n Jeff Fromm, Contributor\n https://www.forbes.com/sites/jefffromm/",
    "title": "Priceline’s AI Tool To Drive Travel Search And Personalization Trends",
    "description": "In an age of abundant options and algorithmic recommendations, the modern traveler doesn’t just want to go somewhere—they want to belong somewhere.",
    "url": "https://www.forbes.com/sites/jefffromm/2025/05/09/pricelines-ai-tool-to-drive-travel-search-and-personalization-trends/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681b86ab064c5c0b761aed2b/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-09T13:56:26Z",
    "content": "In an age of abundant options and algorithmic recommendations, the modern traveler doesnt just want to go somewherethey want to belong somewhere. Thats where Pricelines new AI tool, Neighborhood Navi… [+4746 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Casper Ravn-Sørensen, Forbes Councils Member, \n Casper Ravn-Sørensen, Forbes Councils Member\n https://www.forbes.com/councils/forbestechcouncil/people/casperravnsorensen/",
    "title": "Understanding Gen A To Z: Why You Shouldn't Take A One-Size-Fits-All Approach When Advertising On Social Media",
    "description": "The future of digital advertising is shifting.",
    "url": "https://www.forbes.com/councils/forbestechcouncil/2025/05/12/understanding-gen-a-to-z-why-you-shouldnt-take-a-one-size-fits-all-approach-when-advertising-on-social-media/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681e1072b194194f7e57f7cf/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-12T10:15:00Z",
    "content": "Casper Ravn-Sørensen, CEO of GoWish.\r\ngetty\r\nSo, I heard Evan Spiegel just name-dropped your company in Snapchats Q4 earnings call?\r\nThis was one of several similar texts I received just the other da… [+4849 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Ian Shepherd, Contributor, \n Ian Shepherd, Contributor\n https://www.forbes.com/sites/ianshepherd/",
    "title": "How Top Creators Are Outsmarting The Algorithm For Good",
    "description": "In the early days of content creation, success was all about the numbers. But creators are starting to realize that going viral doesn’t always lead to lasting income.",
    "url": "https://www.forbes.com/sites/ianshepherd/2025/05/06/how-top-creators-are-outsmarting-the-algorithm-for-good/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681a91959e275c8461d06fe9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-06T22:56:22Z",
    "content": "Young african american woman smiling while recording an audio broadcast in a modern cozy studio. ... More Cheerful black female content creator hosting an internet podcast. Copy space. Looking into t… [+5204 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Cosmopolitan.com"
    },
    "author": "Megan Uy",
    "title": "The Honest Adanola Review to Read Before You Add Anything to Your Cart",
    "description": "Cosmo editors tested, wore, and reviewed the viral UK athleisurewear brand, Adanola, that Kendall Jenner swears by. We tried on leggings, sports bras, and more.",
    "url": "https://www.cosmopolitan.com/style-beauty/fashion/g64527368/adanola-review/",
    "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/adanola-review-6812790e6c2f0.png?crop=1xw:1xh;center,top&resize=1200:*",
    "publishedAt": "2025-05-09T14:13:00Z",
    "content": "At this point, the athleisure market feels like its overflowing with options. And Ill admit, even with all there is to offer, Ive been riding hard for a few viral retailers for almost a decade. You c… [+1478 chars]",
    "full_content": "We may earn commission from links on this page, but we only recommend products we love. Promise.\n\nAt this point, the athleisure market feels like it’s overflowing with options. And I’ll admit, even with all there is to offer, I’ve been riding hard for a few viral retailers for almost a decade. You can't fix what's not broke! But when I started spotting It girls like Kendall Jenner, Kaia Gerber, and Emily Ratajkowski sporting Adanola in their street style, I couldn’t resist jumping in to see what the hype was all about.\n\nAfter I did some internet digging, it came to my attention that I was obviously late to the party. Adanola has been a UK favorite for a minute. With almost a million Instagram followers, it's clear this brand is making waves. So, of course, your friendly shopping editors here at Cosmo had to see what we've been missing out on for ourselves and share our unfiltered thoughts on the brand. We spent weeks testing out everything from leggings and sports bras to sweatshirts and matching sets to bring you this Adanola review. But first…\n\n\n\nWhat Is Adanola?\n\nYou know those sweaters with “ADA” across the front all over your Pinterest, TikTok, and Instagram feeds? That’s Adanola, a British activewear and loungewear brand known for its classic, clean, sporty aesthetic. With everything under $200, it’s Gen Z’s go-to for elevated wardrobe staples that won’t cost you a million bucks. If this brand hasn’t been on your radar, it truly should be!\n\nHere’s just a little peek at some of our favorite pieces.\n\nChic, right? Below, you’ll find a curated list of Adanola’s best-selling and newest styles—each one tested, worn, and reviewed by Cosmo editors. From everyday basics to standout sets, read on to see which have our stamp of approval!"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Rachel Wells, Contributor, \n Rachel Wells, Contributor\n https://www.forbes.com/sites/rachelwells/",
    "title": "50 Companies Now Hiring Remote Jobs In 2025",
    "description": "Looking for remote jobs after being laid off? Here are the 50 companies now hiring fully remote and hybrid jobs in 2025, and some tips on how to find remote work easily.",
    "url": "https://www.forbes.com/sites/rachelwells/2025/05/07/50-companies-now-hiring-remote-jobs-in-2025/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/681b606cc5b3003524b3ab86/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2025-05-07T14:00:33Z",
    "content": "Companies in tech, health, and defense industries have the greatest share of remote jobs\r\ngetty\r\nOnce upon a time, getting a good, stable job meant relocating into a big city, traveling into the offi… [+6691 chars]",
    "full_content": null
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "ROME 25/4– Day 27: Getting rooked",
    "description": "On the last day before the 2025 Conclave, the 126th day of the calendar year, the sun rose in Rome at 5:58. Sunset is at 20:17: The Ave Maria Bells hasn’t budged… in more ways than one… at 20:30. Today … Read More →",
    "url": "https://wdtprs.com/2025/05/rome-25-4-day-27-getting-rooked/",
    "urlToImage": null,
    "publishedAt": "2025-05-06T14:56:00Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "On the last day before the 2025 Conclave, the 126th day of the calendar year, the sun rose in Rome at 5:58.\n\nSunset is at 20:17:\n\nThe Ave Maria Bells hasn’t budged… in more ways than one… at 20:30.\n\nToday was a dies non so I celebrated a Mass “for the election of a Supreme Pontiff” and then worked on a piece here about the Mass texts. Powerful stuff.\n\nTonight in the parish Exposition, Rosary, Benediction and Solemn Mass for that intention.\n\nI was out to supper with The Great Roman™ last night. We split portions of two pastas for the sake of variety. Tonnarelli with a ragu of venison and spaghetti with guanciale, pecorino and fave (like gricia with beans). Both were good, the venison ragu was great. The place we went to is under new management since about last February. Some continuity with the menu, but new people and new chef. Style has been upgraded. Alas, part of that is change of service items like bowls. Our pastas were served in Stupid Bowls, hard to eat out of. Of course these days, cooks have a mania for twisting pasta up with tweezers and stacking it like Babel. I am unimpressed. It had better taste better than you’ve tried to make it look. I get the visual part. But….\n\nStupid Bowl.\n\nIt was not an inexpensive supper, but we wanted to check it out under the new regime. It was close. Good quality food, nice staff, spiffed up tables, … alas, stupid bowls.\n\nI checked out this little church on the Via Giulia, which still has the coat-of-arms of BENEDICT XV… yes… 15. (14 would have been even better) I don’t know how they held out.\n\nI had a little time so I wandered over the Angel Bridge to the other side of the river… first time since being here.\n\nNice and clean.\n\nHere, an angel is holding a large chess rook, …\n\nThe angel is sad that you don’t play chess and the he wants you to be happy by signing up for\n\nOkay… it’s not really a big chess rook. It is the pillar of the flagellation. I tried.\n\nPSSSST….\n\nStrong candidates right now, the day before… Pizzaballa and Mamberti with a hedge toward Erdö. I think this will take more than one day."
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "Pre-Conclave photos are out. This was the most interesting to me.",
    "description": "Photos of the different conclave areas and items have been released.  This is the that interested me the most.  You can right-click for larger.",
    "url": "https://wdtprs.com/2025/05/pre-conclave-photos-are-out-this-was-the-most-interesting-to-me/",
    "urlToImage": null,
    "publishedAt": "2025-05-06T19:53:24Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "“He [Satan] will set up a counter-Church which will be the ape of the Church because, he the devil, is the ape of God. It will have all the notes and characteristics of the Church, but in reverse and emptied of its divine content. It will be a mystical body of the anti-Christ that will in all externals resemble the mystical body of Christ. In desperate need for God, whom he nevertheless refuses to adore, modern man in his loneliness and frustration will hunger more and more for membership in a community that will give him enlargement of purpose, but at the cost of losing himself in some vague collectivity.”\n\n“Who is going to save our Church? Not our bishops, not our priests and religious. It is up to you, the people. You have the minds, the eyes, and the ears to save the Church. Your mission is to see that your priests act like priests, your bishops act like bishops.”\n\n- Fulton Sheen\n\nTherefore, ACTIVATE YOUR CONFIRMATION and get to work!"
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "Some Notes about Leo XIV.. maybe more to follow",
    "description": "Let’s start with the important stuff, like the coat-of-arms and motto. ‘Cause I like that stuff. Here is the coat-of-arms of Pope Leo XIV.   His motto is “In Illo Uno Unum”, which from the elegance you know is from St. … Read More →",
    "url": "https://wdtprs.com/2025/05/some-notes-about-leo-xiv-maybe-more-to-follow/",
    "urlToImage": null,
    "publishedAt": "2025-05-10T17:50:11Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "Let’s start with the important stuff, like the coat-of-arms and motto. ‘Cause I like that stuff.\n\nHere is the coat-of-arms of Pope Leo XIV. His motto is “In Illo Uno Unum”, which from the elegance you know is from St. Augustine. Indeed it is, from en. ps. 127. I’ll write separated about that.\n\nThe arms bear a Marian lily of purity and the symbol of the Augustinians, the arrow-pierced burning heart on the book, for Augustine is a Doctor of the Church. It is simple. That is good.\n\nThat Augustinian symbol is so familiar to me, since I studied in Rome at the Patristic Institute “Augustinianum” (while Prevost was there… and his classmate was president).\n\nHis name. He told the cardinals that he wanted to affirm the path that the Church took with the Second Vatican Council, underscoring certain elements that both Benedict and Francis emphasized. Hence he took the name Leo, calling to Leo XIII, and the social teaching of the Church. Perhaps it is only coincidence that Leo XIII’s family had intimate dealings with Augustinians.\n\nIn that talk to Cardinals he mentioned AI. This is a big deal.\n\nHis pectoral cross, at least what he has now, has relics of Augustinian saints, including Augustine and Monica. I also have their relics in my chapel. That will help me with a sense of solidarity, I hope.\n\nThe Pope will live in the Apostolic Palace.\n\nJust watch. Pretty Casa Santa Marta will return to being a “5 star hotel”.\n\nPlease, God, let the performative humility be at an end?\n\nHis theological background.\n\nHe has the coveted M.Div from the worst possible school in the worst possible years, Chicago Theological Union.\n\nThat doesn’t mean he is a heretic, like the instructors. However it doesn’t point to a profound foundation. It could be that he has done more on his own. However, his jobs have kept him busy.\n\nMy sources say that he believes and that he prays.\n\nThat’s a good start."
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "ROME 25/4– Day 28: Conclave day",
    "description": "On this Conclave Day 2025, the sun rose on Rome at 5:56. It will set – whether there is a new Pope or not – at 20:18. The Ave Maria won’t ring in the conclave at 20:30. It is the … Read More →",
    "url": "https://wdtprs.com/2025/05/rome-25-4-day-28-conclave-day/",
    "urlToImage": null,
    "publishedAt": "2025-05-07T20:25:43Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "On this Conclave Day 2025, the sun rose on Rome at 5:56.\n\nIt will set – whether there is a new Pope or not – at 20:18.\n\nThe Ave Maria won’t ring in the conclave at 20:30.\n\nIt is the Feast of Flavia Domitilla.\n\nThere will be a new full Moon on 12 May.\n\nLast night at The Parish™ we had a Solemn Mass for the Election of a Supreme Pontiff.\n\nHere is a brief video from the beginning of the Mass.\n\nAfter Mass the whole congregation sand the Litany of Loreto as the clergy knelt before the parish’s lovely image of Mary over the altar in the transept.\n\nI was at a gather of Catholic journalistic glitterati tonight. You would have known most of them.\n\nIn the cab on the way home.\n\nI’m tired.\n\nTomorrow, four votes.\n\nI predict Friday evening."
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "ASK FATHER: What if the cardinals chose a man who is not in the conclave?",
    "description": "From a reader… QUAERITUR: What if the cardinals chose a man who is not in the conclave?   They can chose a baptized male, right?   It’s unlikely that they would go outside the Cardinals in the conclave, even for an older … Read More →",
    "url": "https://wdtprs.com/2025/05/ask-father-what-if-the-cardinals-chose-a-man-who-is-not-in-the-conclave/",
    "urlToImage": null,
    "publishedAt": "2025-05-08T13:51:36Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "From a reader…\n\nQUAERITUR:\n\nWhat if the cardinals chose a man who is not in the conclave? They can chose a baptized male, right? It’s unlikely that they would go outside the Cardinals in the conclave, even for an older non-voting Cardinal. It’s extremely unlikely that they would choose a non-Cardinal. But if they do, what happens?\n\nBTW… see the post immediately before this one! The Sonnet by Belli about this topic.\n\nThe document about death the election of Popes is called Universi Domini Gregis. UDG says:\n\n90. If the person elected resides outside Vatican City, the norms contained in the Ordo Rituum Conclavis are to be observed.\n\nThe ORC says:\n\n62. Si autem Electus extra Civitatem Vaticanam degit, Cardinal, electores duos Cardinales eligunt ut Cardinali qui praeest continuo adsint usque ad adventum et acceptationem Electi.\n\nDeinde Cardinalis qui praeest et duo Cardinales qui ei adsunt Substitutum Secretariae Status arcessent, qui caute et prudenter efficiat ut Electus quantocius ad Urbem perveniat, vitatis omnino mediis communicationis socialis per quae secretum Conclavis violari possit. Cum Electus in Civitatem Vaticanam pervenerit, Substitutus Secretariae Status immediate dc cius adventu Cardinalem qui preeest cer-tiorem faciat eiusque mandata adamussim exsequatur. Cardinalis qui praeest, consiliis cum duobus Cardinalibus qui ei adsunt collatis, Cardinales electores convocabit et Electum in Sacellum Sixtinum introducet, ut ad acceptationis ritum procedatur.\n\n63. Post acceptationem, Electus qui episcopali ordinatione iam pollet est illico Romanae Ecclesiae Episcopus simulque verus Summus Pontifex et Caput Collegii Episcopalis; idemque actu plenam et supremam potestatem in universam Ecclesiam acquirit.\n\nor\n\n62. If the Elect resides outside Vatican City, the Cardinal electors choose two Cardinals who assist the presiding Cardinal until the arrival and acceptance of the Elect. Then the Cardinal who presides and the two Cardinals who assist him will call the Substitute of the Secretariat of State, who will carefully ensure that the Elected One comes to Rome as soon as possible, absolutely avoiding the means of communication by which the secret of the Conclave can be violated. When the Elected Representative is in Vatican City, the Substitute of the Secretariat of State immediately informs the presiding Cardinal of his arrival and follows his orders exactly. The presiding Cardinal, after having taken counsel from the two Cardinals assisting him, shall convoke the Cardinal electors and introduce the Elected Cardinals into the Sistine Chapel so that the rite of acceptance may take place.\n\n63. After acceptance, the Elect who has already received priestly ordination is immediately Bishop of the Church of Rome, true Supreme Pontiff and Head of the Episcopal College; he acquires in fact the full and supreme power over the universal Church.\n\nSo, they send a couple of guys (they better be strong) to go get the poor man and drag him to the Sistine Chapel and put the question to him formally. By this time, he has probably figured out what’s going on.\n\nI would be tempted to make them stop at a bar first before getting to Vatican City.\n\nOne problem I have with this is that at the death of a Pope, all roles in the Curia cease except for the Camerlengo, the Vicar of Rome, and the Major Penitentiary. So, there shouldn’t be a Sostituto, technically, since there is also not Secretary of State, technically."
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "Card. Burke on Leo XIV",
    "description": "Please join me in thanking Our Lord for the election of Pope Leo XIV, Successor of Saint Peter, as the Shepherd of the Church throughout the world. The Shrine of Our Lady of Guadalupe at La Crosse has a particularly … Read More →",
    "url": "https://wdtprs.com/2025/05/card-burke-on-leo-xiv/",
    "urlToImage": null,
    "publishedAt": "2025-05-08T22:46:16Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "“He [Satan] will set up a counter-Church which will be the ape of the Church because, he the devil, is the ape of God. It will have all the notes and characteristics of the Church, but in reverse and emptied of its divine content. It will be a mystical body of the anti-Christ that will in all externals resemble the mystical body of Christ. In desperate need for God, whom he nevertheless refuses to adore, modern man in his loneliness and frustration will hunger more and more for membership in a community that will give him enlargement of purpose, but at the cost of losing himself in some vague collectivity.”\n\n“Who is going to save our Church? Not our bishops, not our priests and religious. It is up to you, the people. You have the minds, the eyes, and the ears to save the Church. Your mission is to see that your priests act like priests, your bishops act like bishops.”\n\n- Fulton Sheen\n\nTherefore, ACTIVATE YOUR CONFIRMATION and get to work!"
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "Here’s an idea to bring about healing and peace: Let the “Dubia Cardinals” re-submit the 2016 Dubia (Amoris) and 2023 Dubia (Synodality)",
    "description": "One of the thing that a new Pope has to do, is tie up the loose ends left by his predecessor. There are no ends looser that one can imagine that the DUBIA about Amoris laetitia submitted in 2016 to … Read More →",
    "url": "https://wdtprs.com/2025/05/heres-an-idea-to-bring-about-healing-and-peace-let-the-dubia-cardinals-re-submit-the-2016-dubia-amoris-and-2023-dubia-synodality/",
    "urlToImage": null,
    "publishedAt": "2025-05-09T11:48:00Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": ""
  },
  {
    "source": {
      "id": null,
      "name": "Wdtprs.com"
    },
    "author": "Fr. John Zuhlsdorf",
    "title": "Your Sunday Sermon Notes – 3rd Sunday after Easter 2025 (N.O. 4th Sunday of Easter)",
    "description": "Too many people today are without good, strong preaching, to the detriment of all. Share the good stuff. It is the 4th Sunday of Easter in the Novus Ordo and the 3rd Sunday after Easter in the Vetus Ordo.   In … Read More →",
    "url": "https://wdtprs.com/2025/05/your-sunday-sermon-notes-3rd-sunday-after-easter-2025-n-o-4th-sunday-of-easter/",
    "urlToImage": null,
    "publishedAt": "2025-05-11T12:40:11Z",
    "content": "\"The great Father Zed, Archiblogopoios\"\r\n- Fr. John Hunwicke\"Some 2 bit novus ordo cleric\"\r\n- Anonymous\r\n\"Rev. John Zuhlsdorf, a traditionalist blogger who has never shied from picking fights with pr… [+1945 chars]",
    "full_content": "Too many people today are without good, strong preaching, to the detriment of all. Share the good stuff.\n\nIt is the 4th Sunday of Easter in the Novus Ordo and the 3rd Sunday after Easter in the Vetus Ordo. In the Novus Ordo this Sunday is “Good Shepherd Sunday”. In the Vetus Ordo, Good Shepherd Sunday was last week.\n\nWas there a GOOD point made in the sermon you heard at your Sunday Mass of obligation?\n\nTell about attendance especially for the Traditional Latin Mass.\n\nAny local changes or (hopefully good) news?\n\nI have a few thoughts about the orations in the Vetus Ordo for this Sunday: HERE\n\nA taste:"
  }
]